import 'package:flutter/material.dart';
import 'package:flutter/foundation.dart';
import 'package:shared_preferences/shared_preferences.dart';

const _kLocaleStorageKey = '__locale_key__';

class FFLocalizations {
  FFLocalizations(this.locale);

  final Locale locale;

  static FFLocalizations of(BuildContext context) =>
      Localizations.of<FFLocalizations>(context, FFLocalizations)!;

  static List<String> languages() => ['ru', 'en', 'tr'];

  static late SharedPreferences _prefs;
  static Future initialize() async =>
      _prefs = await SharedPreferences.getInstance();
  static Future storeLocale(String locale) =>
      _prefs.setString(_kLocaleStorageKey, locale);
  static Locale? getStoredLocale() {
    final locale = _prefs.getString(_kLocaleStorageKey);
    return locale != null && locale.isNotEmpty ? createLocale(locale) : null;
  }

  String get languageCode => locale.toString();
  String? get languageShortCode =>
      _languagesWithShortCode.contains(locale.toString())
          ? '${locale.toString()}_short'
          : null;
  int get languageIndex => languages().contains(languageCode)
      ? languages().indexOf(languageCode)
      : 0;

  String getText(String key) =>
      (kTranslationsMap[key] ?? {})[locale.toString()] ?? '';

  String getVariableText({
    String? ruText = '',
    String? enText = '',
    String? trText = '',
  }) =>
      [ruText, enText, trText][languageIndex] ?? '';

  static const Set<String> _languagesWithShortCode = {
    'ar',
    'az',
    'ca',
    'cs',
    'da',
    'de',
    'dv',
    'en',
    'es',
    'et',
    'fi',
    'fr',
    'gr',
    'he',
    'hi',
    'hu',
    'it',
    'km',
    'ku',
    'mn',
    'ms',
    'no',
    'pt',
    'ro',
    'ru',
    'rw',
    'sv',
    'th',
    'uk',
    'vi',
  };
}

class FFLocalizationsDelegate extends LocalizationsDelegate<FFLocalizations> {
  const FFLocalizationsDelegate();

  @override
  bool isSupported(Locale locale) {
    final language = locale.toString();
    return FFLocalizations.languages().contains(
      language.endsWith('_')
          ? language.substring(0, language.length - 1)
          : language,
    );
  }

  @override
  Future<FFLocalizations> load(Locale locale) =>
      SynchronousFuture<FFLocalizations>(FFLocalizations(locale));

  @override
  bool shouldReload(FFLocalizationsDelegate old) => false;
}

Locale createLocale(String language) => language.contains('_')
    ? Locale.fromSubtags(
        languageCode: language.split('_').first,
        scriptCode: language.split('_').last,
      )
    : Locale(language);

final kTranslationsMap = <Map<String, Map<String, String>>>[
  // authPage
  {
    'w6j5k473': {
      'ru': 'Войти',
      'en': 'Log in',
      'tr': 'Giriş yap',
    },
    'emm94lmq': {
      'ru': 'Введите вашу почту и пароль',
      'en': 'Enter your email and password',
      'tr': 'E-postanızı ve şifrenizi girin',
    },
    'mgs5vu41': {
      'ru': 'Введите почту',
      'en': 'Enter your email',
      'tr': 'postanızı girin',
    },
    'p7udgsum': {
      'ru': '********',
      'en': '********',
      'tr': '********',
    },
    'mu8qrcig': {
      'ru': 'Продолжить',
      'en': 'Continue',
      'tr': 'Devam et',
    },
    'nf3ifjzx': {
      'ru': 'Зарегистрироваться',
      'en': 'Sign up',
      'tr': 'Kaydol',
    },
    'kp6aljez': {
      'ru': 'Политика конфидециальности ',
      'en': 'Privacy policy ',
      'tr': 'Gizlilik Politikası ',
    },
    '85thm4ef': {
      'ru': 'и',
      'en': 'And',
      'tr': 'Ve',
    },
    'ozuxmslm': {
      'ru': ' Условия пользования',
      'en': ' Terms of use',
      'tr': ' Kullanım Şartları',
    },
    'oiqju9ox': {
      'ru': 'Home',
      'en': 'Home',
      'tr': 'Ev',
    },
  },
  // ConfirmMailPage
  {
    'i9zmsz5j': {
      'ru': 'Назад',
      'en': 'Back',
      'tr': 'Geri',
    },
    'ojn84voc': {
      'ru': 'Восстановление',
      'en': 'Recovery',
      'tr': 'Şifre kurtarma',
    },
    'vex9n3ig': {
      'ru': 'Введите почту, которая привязана к аккаунту',
      'en': 'Enter the email associated with your account',
      'tr': 'Hesabınıza bağlı e-postayı girin',
    },
    '7ia8b8gp': {
      'ru': 'Введите почту',
      'en': 'Enter your email',
      'tr': 'postanızı girin',
    },
    'ssbgkukj': {
      'ru': 'Продолжить',
      'en': 'Continue',
      'tr': 'Devam et',
    },
    'c097177i': {
      'ru': 'Home',
      'en': 'Home',
      'tr': 'Ev',
    },
  },
  // regPage
  {
    'ikzsif8f': {
      'ru': 'Назад',
      'en': 'Back',
      'tr': 'Geri',
    },
    'wkntlozf': {
      'ru': 'Регистрация',
      'en': 'Registration',
      'tr': 'Kayıt',
    },
    '7182jalv': {
      'ru': 'Введите ваше имя',
      'en': 'Enter your name',
      'tr': 'Adınızı girin',
    },
    'u164n7ki': {
      'ru': 'Введите имя',
      'en': 'Enter your name',
      'tr': 'Adınızı giriniz',
    },
    'c5r6qlfq': {
      'ru': 'Продолжить',
      'en': 'Continue',
      'tr': 'Devam et',
    },
    'nw5ez3th': {
      'ru': 'Назад',
      'en': 'Back',
      'tr': 'Geri',
    },
    'mgwatmsp': {
      'ru': 'Регистрация',
      'en': 'Registration',
      'tr': 'Kayıt',
    },
    '4ptv8z0s': {
      'ru': 'Введите почту для входа',
      'en': 'Enter email to login',
      'tr': 'Giriş yapmak için e-postayı girin',
    },
    's5pjhofd': {
      'ru': 'Введите почту',
      'en': 'Enter your email',
      'tr': 'E-postanızı giriniz',
    },
    'km1l1eut': {
      'ru': 'Поле пустое, введите почту',
      'en': 'The field is empty, please enter your email',
      'tr': 'Alan boş, lütfen e-postanızı girin',
    },
    'krelsjm5': {
      'ru': 'Please choose an option from the dropdown',
      'en': 'Please choose an option from the dropdown',
      'tr': 'Lütfen açılır listeden bir seçenek belirleyin',
    },
    '2a1t3swp': {
      'ru': 'Продолжить',
      'en': 'Continue',
      'tr': 'Devam et',
    },
    'vc0c4v8i': {
      'ru': 'Назад',
      'en': 'Back',
      'tr': 'Geri',
    },
    '2vk8qmsi': {
      'ru': 'Новый пароль',
      'en': 'New Password',
      'tr': 'Yeni Şifre',
    },
    'pfj1o3sg': {
      'ru': 'Придумайте восьмизначный пароль',
      'en': 'Create a six-digit password',
      'tr': 'Sekiz haneli bir şifre oluşturun',
    },
    'auchhfp7': {
      'ru': 'Введите пароль',
      'en': 'enter password',
      'tr': 'Parolanı Gir',
    },
    '9ttkozd3': {
      'ru': 'Пароль не введен',
      'en': '',
      'tr': '',
    },
    'o3usq3rw': {
      'ru': 'Пароль должен быть от 8 знаков',
      'en': 'Password must be at least 8 characters',
      'tr': 'Şifre en az 8 karakter olmalıdır',
    },
    '5if99asu': {
      'ru': 'Please choose an option from the dropdown',
      'en': '',
      'tr': '',
    },
    '1k3auive': {
      'ru': 'Продолжить',
      'en': 'Continue',
      'tr': 'Devam et',
    },
    'k44rcj9j': {
      'ru': 'Назад',
      'en': 'Back',
      'tr': 'Geri',
    },
    'vp0ly5f9': {
      'ru': 'Подтвердите пароль',
      'en': 'Confirm the password',
      'tr': 'Şifreyi tekrarlayın',
    },
    'y5n66grn': {
      'ru': 'Подтвердите ваш пароль',
      'en': 'Confirm your password',
      'tr': 'Şifreyi tekrarlayın',
    },
    'xtybcw0v': {
      'ru': 'Пароли не совпадают',
      'en': 'Password mismatch',
      'tr': 'Şifre eşleşmiyor',
    },
    'lul3sxn4': {
      'ru': 'Введите пароль',
      'en': 'enter password',
      'tr': 'Parolanı Gir',
    },
    'gl0xzvau': {
      'ru': 'Продолжить',
      'en': 'Continue',
      'tr': 'Devam et',
    },
    'xey72zu0': {
      'ru': 'Назад',
      'en': 'Back',
      'tr': 'Geri',
    },
    'bl4fl4we': {
      'ru': 'Подтверждение',
      'en': 'Confirmation',
      'tr': 'Onay',
    },
    'nc9zxm06': {
      'ru': 'Мы отправим вам на почту код подтверждения',
      'en': 'We will send you a confirmation code by email',
      'tr': 'Size e-postayla bir onay kodu göndereceğiz',
    },
    'wbv75ama': {
      'ru': 'Отправить код',
      'en': 'To come in',
      'tr': 'Tekrar gönder',
    },
    'p31krxsj': {
      'ru': 'Проверьте папку со спамом, если не получили код',
      'en': 'Check your spam folder if you didn\'t receive the code',
      'tr': 'Kodu almadıysanız spam klasörünü kontrol edin',
    },
    'o4n7wiqx': {
      'ru': 'Назад',
      'en': 'Back',
      'tr': 'Geri',
    },
    's5s2mmf4': {
      'ru': 'Вставьте код, который пришел на вашу почту сюда',
      'en': 'Paste the code that came to your email here',
      'tr': 'E-postanıza gelen kodu buraya yapıştırın',
    },
    'o7f037cf': {
      'ru': 'Отправить еще раз',
      'en': 'Send again',
      'tr': 'Tekrar gönderin',
    },
    'kge4kc32': {
      'ru': 'Проверьте папку со спамом, если не получили код',
      'en': 'Check your spam folder if you didn\'t receive the code',
      'tr': 'Kodu almadıysanız spam klasörünü kontrol edin',
    },
    'vf9qf0hh': {
      'ru': 'Назад',
      'en': 'Back',
      'tr': 'Geri',
    },
    'tfuy9kwj': {
      'ru': 'Успешно',
      'en': 'Successfully',
      'tr': 'Başarıyla',
    },
    '3lci0xmu': {
      'ru': 'Поздравляем! Регистрация завершена',
      'en': 'Congratulations! Registration completed',
      'tr': 'Tebrikler! Kayıt tamamlandı',
    },
    '3zqbywnu': {
      'ru': 'Войти',
      'en': 'To come in',
      'tr': 'Giriş yap',
    },
    'rlh6jd4w': {
      'ru': 'Home',
      'en': 'Home',
      'tr': 'Ev',
    },
  },
  // profileCabinet
  {
    'w827l0a7': {
      'ru': 'Личный кабинет',
      'en': 'Profile Cabinet',
      'tr': 'Profil',
    },
    'ysihvxwu': {
      'ru': 'Пользователь',
      'en': 'User',
      'tr': 'kullanıcı',
    },
    't9t8lst1': {
      'ru': 'Имя',
      'en': 'Name',
      'tr': 'İsim',
    },
    'flj8kskk': {
      'ru': 'Почта',
      'en': 'Mail',
      'tr': 'E - Posta',
    },
    '0suaniy5': {
      'ru': 'Настройки',
      'en': 'Settings',
      'tr': 'Ayarlar',
    },
    'j7z7whdg': {
      'ru': 'Push-уведомления',
      'en': 'Push Notifications',
      'tr': 'Bildirimler',
    },
    'e6ccpoon': {
      'ru': 'Язык приложения',
      'en': 'Application Language',
      'tr': 'Uygulama dili',
    },
    'owu9vsed': {
      'ru': 'Техническая поддержка',
      'en': 'Technical support',
      'tr': 'Teknik destek',
    },
    '75yxkikg': {
      'ru': 'Пользователь',
      'en': 'User',
      'tr': 'Hakkında',
    },
    's4kus2sn': {
      'ru': 'Политика конфидециальности',
      'en': 'Privacy policy',
      'tr': 'Gizlilik politikası',
    },
    'h7x0v3aa': {
      'ru': 'Правила пользования',
      'en': 'Terms of use',
      'tr': 'Kullanım koşulları',
    },
    'qyrovsfp': {
      'ru': 'Сведения о разработчике',
      'en': 'about developer',
      'tr': 'Geliştirici bilgileri',
    },
    'pnlcu0vr': {
      'ru': 'Выйти',
      'en': 'Log out',
      'tr': 'Dışarı çıkmak',
    },
    'xv2hk0dl': {
      'ru': 'Удалить аккаунт',
      'en': 'Delete account',
      'tr': 'Hesabı sil',
    },
    'isrsohpr': {
      'ru': 'Home',
      'en': 'Home',
      'tr': 'Ev',
    },
  },
  // homePageSea
  {
    'x9yocsdo': {
      'ru': 'Доставка по морю',
      'en': 'Sea freight',
      'tr': 'Deniz yolu',
    },
    '3t2o137e': {
      'ru': 'Активные заказы',
      'en': 'Active orders',
      'tr': 'Aktif teslimatlar',
    },
    'rb76r083': {
      'ru': 'Архивные заказы',
      'en': 'Archive orders',
      'tr': 'Sonuçlanmiş teslimatlar',
    },
    'vt1t0qg8': {
      'ru': 'Море',
      'en': 'Sea',
      'tr': 'Deniz',
    },
  },
  // homePageLand
  {
    '7qpc8kaf': {
      'ru': 'Доставка по cуше',
      'en': 'Land freight',
      'tr': 'Kara yolu',
    },
    'zhkurmsa': {
      'ru': 'Активные заказы',
      'en': 'Active orders',
      'tr': 'Aktif teslimatlar',
    },
    'sucz05jq': {
      'ru': 'Архивные заказы',
      'en': 'Archive orders',
      'tr': 'Sonuçlanmiş teslimatlar',
    },
    '024efrtn': {
      'ru': 'Суша',
      'en': 'Land',
      'tr': 'Kara',
    },
  },
  // orderStatusSea
  {
    '1l0wg7z6': {
      'ru': 'Данные заказа',
      'en': 'Order data',
      'tr': 'Teslimat ayrıntıları',
    },
    'vqyjm60z': {
      'ru': 'Статус заказа',
      'en': 'Order status',
      'tr': 'Teslimat durumu',
    },
    '8u0cy10m': {
      'ru': 'Номер партии',
      'en': 'Batch number',
      'tr': 'Parti numarası',
    },
    'gtxnex2z': {
      'ru': 'Наименование судна',
      'en': 'Vessel name',
      'tr': 'Gemi adı',
    },
    'gt74le6h': {
      'ru': 'Торговая марка',
      'en': 'Trademark',
      'tr': 'TM',
    },
    'uvcvg51p': {
      'ru': 'Наименование товара',
      'en': 'Name of product',
      'tr': 'Ürün adı',
    },
    '66jt8ufk': {
      'ru': 'Прибытие судна',
      'en': 'Ship arrival',
      'tr': 'Geminin varışı',
    },
    'ty4lqvk5': {
      'ru': 'Карантин',
      'en': 'Quarantine',
      'tr': ' Karantina kontrol',
    },
    '2o8e77du': {
      'ru': 'Пропечатка',
      'en': 'Proprint',
      'tr': 'Karantina izni',
    },
    'hdnf6vxv': {
      'ru': 'Подача декларации',
      'en': 'Filing a declaration',
      'tr': 'Beyanname açılışı',
    },
    '90wza7s0': {
      'ru': 'Выпуск декларации',
      'en': 'Release of the declaration',
      'tr': 'Beyanname kapanışı',
    },
    'ckdgwvk0': {
      'ru': 'Отъезд к клиенту',
      'en': 'Departure to the client',
      'tr': 'Müşteriye gidiş',
    },
    '8strlf5y': {
      'ru': 'Home',
      'en': 'Home',
      'tr': 'Ev',
    },
  },
  // orderStatusPageLand
  {
    'ldgont7z': {
      'ru': 'Данные заказа',
      'en': 'Order data',
      'tr': 'Teslimat ayrıntıları',
    },
    'hudsum85': {
      'ru': 'Статус заказа',
      'en': 'Order status',
      'tr': 'Teslimat durumu',
    },
    '0f58eeou': {
      'ru': 'Номер партии',
      'en': 'Batch number',
      'tr': 'Parti numarası',
    },
    'qspjbvrd': {
      'ru': 'Номер автомобиля',
      'en': 'Vehicle number',
      'tr': 'Araç plakası',
    },
    'sfzbimp1': {
      'ru': 'Торговая марка',
      'en': 'Trademark',
      'tr': 'TM',
    },
    'y6l30mhj': {
      'ru': 'Наименование товара',
      'en': 'Name of product',
      'tr': 'Ürün adı',
    },
    '4d21qy4l': {
      'ru': 'Пересечение границы РФ',
      'en': 'Crossing the border of the Russian Federation',
      'tr': 'Sınırı geçti',
    },
    'r8kvrwli': {
      'ru': 'Заезд на терминал',
      'en': 'Arrival at the terminal',
      'tr': 'İç gümrüğe varış',
    },
    'hny4dlpn': {
      'ru': 'Фитосанитарный контроль',
      'en': 'Phytosanitary control',
      'tr': 'Karantina kontrol ',
    },
    '232i1j5i': {
      'ru': 'Подача декларации',
      'en': 'Filing a declaration',
      'tr': 'Beyanname açılışı',
    },
    'p50cuxu5': {
      'ru': 'Выпуск декларации',
      'en': 'Release of the declaration',
      'tr': 'Beyanname kapanışı',
    },
    'uarzmfc0': {
      'ru': 'Home',
      'en': 'Home',
      'tr': 'Ev',
    },
  },
  // policyPage
  {
    'ks37onet': {
      'ru': 'О приложении',
      'en': 'About the app',
      'tr': 'uygulama hakkında',
    },
    'l6wd5f3g': {
      'ru': 'Политика конфидециальности',
      'en': 'Privacy Policy',
      'tr': 'Gizlilik Politikası',
    },
    'x363h85t': {
      'ru':
          'Это уведомление о конфиденциальности YOUREXPORT MANAGER IDARI DANISMANLIK NAKLIYE ITHALAT IHRACAT DIS TICARET VE SANAYI LIMITED SIRKETI («Компания», «мы», «нас» или «наш») описывает, как и почему мы можем собирать, хранить, использовать и/или делиться («обрабатывать») вашу информацию, когда вы пользуетесь нашими услугами (“Услуги”), например, когда вы: \n–\tЗагрузите и используйте наше мобильное приложение (FTC group) или любое другое наше приложение, которое ссылается на это уведомление о конфиденциальности.\n–\tВзаимодействуйте с нами другими соответствующими способами, включая любые продажи, маркетинг или мероприятия.\nВопросы или опасения?Ознакомление с этим уведомлением о конфиденциальности поможет вам понять свои права и варианты выбора в отношении конфиденциальности. Если вы не согласны с нашей политикой и практикой, пожалуйста, не пользуйтесь нашими Услугами. Если у вас все еще есть какие-либо вопросы или проблемы, свяжитесь с нами по адресу app@tradefru.com .\n\n\nОБЗОР КЛЮЧЕВЫХ МОМЕНТОВ\n\nВ этом кратком изложении представлены ключевые моменты нашего уведомления о конфиденциальности.\n\nКакую личную информацию мы обрабатываем? Когда вы посещаете, используете или перемещаетесь по нашим Сервисам, мы можем обрабатывать личную информацию в зависимости от того, как вы взаимодействуете YOUREXPORT MANAGER IDARI DANISMANLIK NAKLIYE ITHALAT IHRACAT DIS TICARET VE SANAYI LIMITED SIRKETI  и Услуги, выбор, который вы делаете, а также продукты и функции, которые вы используете. Узнайте больше о личной информации, которую вы раскрываете нам.\n\nОбрабатываем ли мы какую-либо конфиденциальную личную информацию?Мы не обрабатываем конфиденциальную личную информацию.\n\nПолучаем ли мы какую-либо информацию от третьих лиц?Мы можем получать информацию из общедоступных баз данных, маркетинговых партнеров, платформ социальных сетей и других внешних источников. Узнайте больше об информации, собранной из других источников.\n\nКак мы обрабатываем вашу информацию?Мы обрабатываем вашу информацию, чтобы предоставлять, улучшать и администрировать наши Сервисы, общаться с вами, обеспечивать безопасность и предотвращать мошенничество, а также соблюдать законы. Мы также можем обрабатывать вашу информацию для других целей с вашего согласия. Мы обрабатываем вашу информацию только тогда, когда у нас есть веская юридическая причина для этого. Узнайте больше о том, как мы обрабатываем вашу информацию.\n\nВ каких ситуациях и каким сторонам мы передаем личную информацию?Мы можем делиться информацией в определенных ситуациях и с определенными третьими лицами. Узнайте больше о том, когда и кому мы передаем вашу личную информацию.\n\nКак мы обеспечиваем безопасность вашей информации?У нас есть организационные и технические процессы и процедуры для защиты вашей личной информации. Однако никакая электронная передача через Интернет или технология хранения информации не могут быть гарантированы на 100% безопасными, поэтому мы не можем обещать или гарантировать, что хакеры, киберпреступники или другие неуполномоченные третьи лица не смогут нарушить нашу безопасность и ненадлежащим образом получить доступ к , украсть или изменить вашу информацию. Узнайте больше о том, как мы обеспечиваем безопасность вашей информации.\n\nКаковы ваши права?В зависимости от того, где вы находитесь географически, применимый закон о конфиденциальности может означать, что у вас есть определенные права в отношении вашей личной информации. Узнайте больше о своих правах на конфиденциальность.\n\nКак вы реализуете свои права?Самый простой способ воспользоваться своими правами — отправить запрос на доступ субъекта данных или связаться с нами. Мы рассмотрим любой запрос и примем меры в соответствии с применимыми законами о защите данных.\n\nХотите узнать больше о том, что YOUREXPORT MANAGER IDARI DANISMANLIK NAKLIYE ITHALAT IHRACAT DIS TICARET VE SANAYI LIMITED SIRKETI с любой информацией, которую мы собираем? Ознакомьтесь с уведомлением о конфиденциальности полностью.\n\n\n1. КАКУЮ ИНФОРМАЦИЮ МЫ СОБИРАЕМ?\n\nЛичная информация, которую вы раскрываете нам\n\nСуммируя:Мы собираем личную информацию, которую вы нам предоставляете.\n\nМы собираем личную информацию, которую вы добровольно предоставляете нам, когда регистрируетесь в Сервисах, выражаете заинтересованность в получении информации о нас или наших продуктах и Сервисах, когда вы участвуете в деятельности Сервисов или иным образом, когда вы связываетесь с нами.\n\nЛичная информация, предоставленная вами.Личная информация, которую мы собираем, зависит от контекста вашего взаимодействия с нами и Услугами, выбора, который вы делаете, а также продуктов и функций, которые вы используете. Личная информация, которую мы собираем, может включать следующее:\n–\tимена\n–\tадрес электронной почты\nКонфиденциальная информация.Мы не обрабатываем конфиденциальную информацию.\n\nДанные Приложения.Если вы используете наши приложения, мы также можем собирать следующую информацию, если вы решите предоставить нам доступ или разрешение:\n–\tВсплывающее уведомление.Мы можем запросить отправку вам push-уведомлений о вашей учетной записи или определенных функциях приложений. Если вы хотите отказаться от получения таких сообщений, вы можете отключить их в настройках вашего устройства.\nЭта информация в первую очередь необходима для обеспечения безопасности и работы наших приложений, для устранения неполадок, а также для нашей внутренней аналитики и отчетности.\n\nВся личная информация, которую вы нам предоставляете, должна быть достоверной, полной и точной, и вы должны уведомлять нас о любых изменениях такой личной информации.\n\nАвтоматически собираемая информация\n\nСуммируя:Некоторая информация, такая как ваш адрес интернет-протокола (IP) и/или характеристики браузера и устройства, собирается автоматически, когда вы посещаете наши Сервисы.\n\nМы автоматически собираем определенную информацию, когда вы посещаете, используете или перемещаетесь по Услугам. Эта информация не раскрывает вашу конкретную личность (например, ваше имя или контактную информацию), но может включать информацию об устройстве и использовании, например ваш IP-адрес, характеристики браузера и устройства, операционную систему, языковые настройки, URL-адреса ссылок, имя устройства, страну, местоположение. , информацию о том, как и когда вы используете наши Услуги, и другую техническую информацию. Эта информация в первую очередь необходима для обеспечения безопасности и работы наших Сервисов, а также для нашей внутренней аналитики и отчетности.\n\nИнформация, которую мы собираем, включает:\n–\tДанные журнала и использования.Данные журнала и использования — это информация, относящаяся к услугам, диагностике, использованию и производительности, которую наши серверы автоматически собирают, когда вы получаете доступ к нашим Услугам или используете их, и которую мы записываем в файлы журналов. В зависимости от того, как вы взаимодействуете с нами, эти данные журнала могут включать ваш IP-адрес, информацию об устройстве, тип браузера, а также настройки и информацию о вашей активности в Сервисах.(например, метки даты/времени, связанные с вашим использованием, просмотренными страницами и файлами, поиском и другими действиями, которые вы предпринимаете, например, какие функции вы используете), информация о событиях устройства (например, системная активность, отчеты об ошибках (иногда называемые «аварийными дампами»). \') и настройки оборудования).\n–\tДанные устройства.Мы собираем данные об устройствах, такие как информация о вашем компьютере, телефоне, планшете или другом устройстве, которое вы используете для доступа к Услугам. В зависимости от используемого устройства эти данные устройства могут включать такую информацию, как ваш IP-адрес (или прокси-сервер), идентификационные номера устройства и приложения, местоположение, тип браузера, модель оборудования, интернет-провайдера и/или оператора мобильной связи, операционную систему и информация о конфигурации системы.\n–\tДанные о местоположении.Мы собираем данные о местоположении, такие как информация о местонахождении вашего устройства, которая может быть точной или неточной. Объем собираемой нами информации зависит от типа и настроек устройства, которое вы используете для доступа к Услугам. Например, мы можем использовать GPS и другие технологии для сбора данных геолокации, которые сообщают нам ваше текущее местоположение (на основе вашего IP-адреса). Вы можете запретить нам собирать эту информацию, либо отказав в доступе к информации, либо отключив настройку «Местоположение» на своем устройстве. Однако, если вы решите отказаться, вы не сможете использовать определенные аспекты Услуг.\nИнформация, собранная из других источников\n\nСуммируя:Мы можем собирать ограниченные данные из общедоступных баз данных, маркетинговых партнеров и других внешних источников.\n\nЧтобы расширить наши возможности по предоставлению вам соответствующих маркетинговых материалов, предложений и услуг, а также обновить наши записи, мы можем получать информацию о вас из других источников, таких как общедоступные базы данных, совместные маркетинговые партнеры, партнерские программы, поставщики данных и другие источники. третьи лица. Эта информация включает почтовые адреса, должности, адреса электронной почты, номера телефонов, данные о намерениях (или данные о поведении пользователей), адреса интернет-протокола (IP), профили в социальных сетях, URL-адреса социальных сетей и настраиваемые профили для целей целевой рекламы и мероприятий. повышение.\n\n2. КАК МЫ ОБРАБАТЫВАЕМ ВАШУ ИНФОРМАЦИЮ?\n\nСуммируя:Мы обрабатываем вашу информацию, чтобы предоставлять, улучшать и администрировать наши Сервисы, общаться с вами, обеспечивать безопасность и предотвращать мошенничество, а также соблюдать законы. Мы также можем обрабатывать вашу информацию для других целей с вашего согласия.\n\nМы обрабатываем вашу личную информацию по разным причинам, в зависимости от того, как вы взаимодействуете с нашими Услугами, в том числе:\n–\tЧтобы облегчить создание и аутентификацию учетной записи, а также иное управление учетными записями пользователей.Мы можем обрабатывать вашу информацию, чтобы вы могли создать свою учетную запись и войти в нее, а также поддерживать свою учетную запись в рабочем состоянии.\n–\tДля предоставления и облегчения предоставления услуг пользователю.Мы можем обрабатывать вашу информацию, чтобы предоставить вам запрошенную услугу.\n–\tЧтобы отправить вам административную информацию.Мы можем обрабатывать вашу информацию, чтобы отправлять вам сведения о наших продуктах и услугах, изменениях в наших условиях и политиках и другую подобную информацию.\n–\tДля выполнения и управления вашими заказами.Мы можем обрабатывать вашу информацию для выполнения и управления вашими заказами, платежами, возвратами и обменами, осуществляемыми через Сервисы.\n–\tЧтобы запросить отзыв.Мы можем обрабатывать вашу информацию, когда это необходимо, чтобы запросить отзыв и связаться с вами по поводу использования вами наших Услуг.\n–\tДля отправки вам маркетинговых и рекламных сообщений.Мы можем обрабатывать личную информацию, которую вы отправляете нам, в наших маркетинговых целях, если это соответствует вашим маркетинговым предпочтениям. Вы можете отказаться от наших маркетинговых рассылок в любое время. Для получения дополнительной информации см. «КАКОВЫ ВАШИ ПРАВА НА КОНФИДЕНЦИАЛЬНОСТЬ?» ниже.\n–\tЧтобы предоставить вам таргетированную рекламу.Мы можем обрабатывать вашу информацию для разработки и отображения персонализированного контента и рекламы с учетом ваших интересов, местоположения и многого другого.\n–\tЧтобы сохранить или защитить жизненно важные интересы человека.Мы можем обрабатывать вашу информацию, когда это необходимо для сохранения или защиты жизненно важных интересов человека, например, для предотвращения вреда.\n\n3. НА КАКИЕ ЮРИДИЧЕСКИЕ ОСНОВАНИЯ МЫ ОСНОВАЕМСЯ ДЛЯ ОБРАБОТКИ ВАШЕЙ ИНФОРМАЦИИ?\n\nСуммируя:Мы обрабатываем вашу личную информацию только тогда, когда мы считаем это необходимым, и у нас есть веская юридическая причина (т.е. юридическое основание) для этого в соответствии с применимым законодательством, например, с вашего согласия, для соблюдения законов, для предоставления вам услуг для заключения или выполнять наши договорные обязательства, защищать ваши права или выполнять наши законные деловые интересы.\n\nОбщее положение о защите данных (GDPR) и GDPR Великобритании требуют, чтобы мы объяснили действительные правовые основания, на которые мы полагаемся при обработке вашей личной информации. Таким образом, мы можем полагаться на следующие правовые основания для обработки вашей личной информации:\n–\tСогласие.Мы можем обрабатывать вашу информацию, если вы дали нам разрешение (т.е. согласие) на использование вашей личной информации для определенной цели. Вы можете отозвать свое согласие в любое время. Подробнее об отзыве согласия.\n–\tИсполнение контракта.Мы можем обрабатывать вашу личную информацию, когда мы считаем, что это необходимо для выполнения наших договорных обязательств перед вами, включая предоставление наших Услуг, или по вашему запросу до заключения с вами договора.\n–\tЗаконные интересы.Мы можем обрабатывать вашу информацию, когда мы считаем, что это разумно необходимо для достижения наших законных деловых интересов, и эти интересы не перевешивают ваши интересы и основные права и свободы. Например, мы можем обрабатывать вашу личную информацию для некоторых из описанных целей, чтобы:\n–\tОтправляйте пользователям информацию о специальных предложениях и скидках на наши продукты и услуги\n–\tРазрабатывать и отображать персонализированный и актуальный рекламный контент для наших пользователей\n–\tПонимать, как наши пользователи используют наши продукты и услуги, чтобы мы могли улучшить пользовательский опыт.\n–\tПравовые обязательства.Мы можем обрабатывать вашу информацию, если мы считаем, что это необходимо для соблюдения наших юридических обязательств, например, для сотрудничества с правоохранительным или регулирующим органом, осуществления или защиты наших законных прав или раскрытия вашей информации в качестве доказательства в судебном процессе, в котором мы участвуем. вовлеченный.\n\n–\tЖизненно важные интересы.Мы можем обрабатывать вашу информацию, когда мы считаем, что это необходимо для защиты ваших жизненно важных интересов или жизненно важных интересов третьей стороны, например, в ситуациях, связанных с потенциальными угрозами безопасности любого лица.\n\n4. КОГДА И КОМУ МЫ ПЕРЕДАЕМ ВАШУ ЛИЧНУЮ ИНФОРМАЦИЮ?\n\nСуммируя:Мы можем делиться информацией в определенных ситуациях, описанных в этом разделе, и/или со следующими третьими лицами.\n\nНам может потребоваться предоставить вашу личную информацию в следующих ситуациях:\n–\tДеловые трансферы.Мы можем делиться или передавать вашу информацию в связи или во время переговоров о любом слиянии, продаже активов компании, финансировании или приобретении всего или части нашего бизнеса другой компании.\n–\tФилиалы.Мы можем передавать вашу информацию нашим аффилированным лицам, и в этом случае мы потребуем от этих аффилированных лиц соблюдения настоящего уведомления о конфиденциальности. К аффилированным лицам относятся наша материнская компания и любые дочерние компании, партнеры по совместным предприятиям или другие компании, которые мы контролируем или которые находятся под нашим общим контролем.\n–\tДеловые партнеры.Мы можем передавать вашу информацию нашим деловым партнерам, чтобы предлагать вам определенные продукты, услуги или рекламные акции.\n\n5. ПЕРЕДАЕТСЯ ЛИ ВАША ИНФОРМАЦИЯ НА МЕЖДУНАРОДНОМ УРОВНЕ?\n\nСуммируя:Мы можем передавать, хранить и обрабатывать вашу информацию в странах, отличных от вашей страны.\n\nНаши сервера находятся в России. Если вы получаете доступ к нашим Услугам из-за пределов России, имейте в виду, что ваша информация может передаваться, храниться и обрабатываться нами на наших объектах и теми третьими лицами, которым мы можем передавать вашу личную информацию (см. «КОГДА И С КОМУ»). ПЕРЕДАЕМ ЛИ МЫ ВАШУ ЛИЧНУЮ ИНФОРМАЦИЮ?» выше), в России и других странах.\n\nЕсли вы являетесь резидентом Европейской экономической зоны (ЕЭЗ) или Соединенного Королевства (Великобритания), то в этих странах не обязательно действуют законы о защите данных или другие аналогичные законы, столь же всеобъемлющие, как в вашей стране. Тем не менее, мы предпримем все необходимые меры для защиты вашей личной информации в соответствии с настоящим уведомлением о конфиденциальности и действующим законодательством.\n\nСтандартные договорные положения Европейской комиссии:\n\nМы приняли меры для защиты вашей личной информации, в том числе с помощью Стандартных договорных положений Европейской комиссии для передачи личной информации между компаниями нашей группы и между нами и нашими сторонними поставщиками. Эти пункты требуют, чтобы все получатели защищали всю обрабатываемую ими личную информацию, поступающую из ЕC или Великобритании, в соответствии с европейскими законами и правилами о защите данных.Наши стандартные договорные положения могут быть предоставлены по запросу.Мы внедрили аналогичные соответствующие меры безопасности с нашими сторонними поставщиками услуг и партнерами, и дополнительная информация может быть предоставлена по запросу.\n\n6. КАК ДОЛГО МЫ ХРАНИМ ВАШУ ИНФОРМАЦИЮ?\n\nСуммируя:Мы храним вашу информацию до тех пор, пока это необходимо для достижения целей, изложенных в этом уведомлении о конфиденциальности, если иное не требуется по закону.\n\nМы будем хранить вашу личную информацию только до тех пор, пока это необходимо для целей, изложенных в настоящем уведомлении о конфиденциальности, за исключением случаев, когда более длительный период хранения требуется или разрешен законом (например, налоговыми, бухгалтерскими или другими правовыми требованиями). Настоящее уведомление не требует от нас хранения вашей личной информации в течение более двенадцати (12) месяцев после начала периода простоя учетной записи пользователя.\n\nЕсли у нас нет постоянной законной деловой необходимости обрабатывать вашу личную информацию, мы либо удалим, либо анонимизируем такую информацию, либо, если это невозможно (например, из-за того, что ваша личная информация хранилась в архивах резервных копий), мы безопасно хранить вашу личную информацию и изолировать ее от дальнейшей обработки до тех пор, пока удаление не станет возможным.\n\n7. КАК МЫ ОБЕСПЕЧИВАЕМ БЕЗОПАСНОСТЬ ВАШЕЙ ИНФОРМАЦИИ?\n\nСуммируя:Мы стремимся защитить вашу личную информацию с помощью системы организационных и технических мер безопасности.\n\nМы внедрили соответствующие и разумные технические и организационные меры безопасности, предназначенные для защиты безопасности любой личной информации, которую мы обрабатываем. Однако, несмотря на наши меры безопасности и усилия по защите вашей информации, никакая электронная передача через Интернет или технологии хранения информации не могут быть гарантированы на 100%, поэтому мы не можем обещать или гарантировать, что хакеры, киберпреступники или другие неуполномоченные третьи лица не будут защищены. могут обойти нашу систему безопасности и ненадлежащим образом собирать, получать доступ, красть или изменять вашу информацию. Хотя мы делаем все возможное для защиты вашей личной информации, передача личной информации в наши Сервисы и из них осуществляется на ваш страх и риск. Вы должны получать доступ к Услугам только в безопасной среде.\n\n8. СОБИРАЕМ ЛИ МЫ ИНФОРМАЦИЮ О НЕСОВЕРШЕННОЛЕТНИХ?\n\nСуммируя:Мы сознательно не собираем данные и не продаем данные детям младше 18 лет.\n\nМы сознательно не запрашиваем данные у детей младше 18 лет и не продаем их. Используя Услуги, вы подтверждаете, что вам исполнилось 18 лет или что вы являетесь родителем или опекуном такого несовершеннолетнего и даете согласие на использование Услуг таким несовершеннолетним иждивенцем. Если мы узнаем, что была собрана личная информация от пользователей младше 18 лет, мы деактивируем учетную запись и примем разумные меры для незамедлительного удаления таких данных из наших записей. Если вам станет известно о каких-либо данных, которые мы могли получить от детей младше 18 лет, свяжитесь с нами по адресу app@tradefru.com .\n\n9. КАКОВЫ ВАШИ ПРАВА НА КОНФИДЕНЦИАЛЬНОСТЬ?\n\nСуммируя:В некоторых регионах, таких как Европейская экономическая зона (ЕЭЗ) и Великобритания (Великобритания), у вас есть права, которые позволяют вам иметь более широкий доступ к вашей личной информации и контролировать ее. Вы можете просмотреть, изменить или прекратить действие своей учетной записи в любое время.\n\nВ некоторых регионах (например, в ЕЭЗ и Великобритании) у вас есть определенные права в соответствии с применимыми законами о защите данных. Они могут включать право (i) запрашивать доступ и получать копию вашей личной информации, (ii) запрашивать исправление или удаление; (iii) ограничить обработку вашей личной информации; и (iv) если применимо, к переносимости данных. В определенных обстоятельствах вы также можете иметь право возражать против обработки вашей личной информации. Вы можете сделать такой запрос, связавшись с нами, используя контактную информацию, указанную в разделе «КАК ВЫ МОЖЕТЕ СВЯЗАТЬСЯ С НАМИ ПО ЭТОМУ УВЕДОМЛЕНИЮ?» ниже.\n\nМы рассмотрим любой запрос и примем меры в соответствии с применимыми законами о защите данных.\n\nЕсли вы находитесь в ЕЭЗ или Великобритании и считаете, что мы незаконно обрабатываем вашу личную информацию, вы также имеете право подать жалобу в Орган по защите данных государства-члена или Управление по защите данных Великобритании.\n\nЕсли вы находитесь в Швейцарии, вы можете связаться с Федеральным уполномоченным по защите данных и информации.\n\nОтзыв вашего согласия:Если мы полагаемся на ваше согласие на обработку вашей личной информации, вы имеете право отозвать свое согласие в любое время. Вы можете отозвать свое согласие в любое время, связавшись с нами, используя контактную информацию, указанную в разделе «КАК ВЫ МОЖЕТЕ СВЯЗАТЬСЯ С НАМИ ПО ЭТОМУ УВЕДОМЛЕНИЮ?» ниже.\n\nОднако обратите внимание, что это не повлияет на законность обработки до ее отзыва и не повлияет на обработку вашей личной информации, осуществляемую на законных основаниях обработки, кроме согласия.\n\nОтказ от маркетинговых и рекламных сообщений:Вы можете отказаться от подписки на наши маркетинговые и рекламные сообщения в любое время, нажав на ссылку отказа от подписки в электронных письмах, которые мы отправляем, или связавшись с нами, используя информацию, указанную в разделе «КАК ВЫ МОЖЕТЕ СВЯЗАТЬСЯ С НАМИ ПО ЭТОМУ УВЕДОМЛЕНИЮ?» ниже. После этого вы будете удалены из маркетинговых списков. Тем не менее, мы по-прежнему можем связываться с вами, например, чтобы отправлять вам сообщения, связанные с обслуживанием, которые необходимы для администрирования и использования вашей учетной записи, для ответа на запросы на обслуживание или для других целей, не связанных с маркетингом.\n\nИнформация Об Учетной Записи\n\nЕсли вы в любое время захотите просмотреть или изменить информацию в своей учетной записи или прекратить действие своей учетной записи, вы можете:\n–\tСвяжитесь с нами, используя предоставленную контактную информацию.\nПо вашему запросу на удаление вашей учетной записи мы деактивируем или удалим вашу учетную запись и информацию из наших активных баз данных. Тем не менее, мы можем хранить некоторую информацию в наших файлах для предотвращения мошенничества, устранения неполадок, помощи в любых расследованиях, обеспечения соблюдения наших юридических условий и/или соблюдения применимых правовых требований.\n\nЕсли у вас есть вопросы или комментарии о ваших правах на конфиденциальность, вы можете написать нам по адресу app@tradefru.com .\n\n10. КОНТРОЛЬ ДЛЯ НЕОТСЛЕЖИВАЕМЫХ ФУНКЦИЙ\n\nБольшинство веб-браузеров, а также некоторые мобильные операционные системы и мобильные приложения включают функцию или настройку «Не отслеживать» («DNT»), которую вы можете активировать, чтобы сигнализировать о том, что вы предпочитаете конфиденциальность, чтобы данные о ваших действиях в Интернете не отслеживались и не собирались. На данном этапе не разработан единый технологический стандарт для распознавания и реализации сигналов DNT. Таким образом, в настоящее время мы не реагируем на сигналы браузера DNT или любой другой механизм, который автоматически сообщает о вашем решении не отслеживаться в Интернете. Если будет принят стандарт онлайн-отслеживания, которому мы должны следовать в будущем, мы сообщим вам об этой практике в пересмотренной версии настоящего уведомления о конфиденциальности.\n\n11. ИМЕЮТ ЛИ ЖИТЕЛИ КАЛИФОРНИИ КОНКРЕТНЫЕ ПРАВА НА КОНФИДЕНЦИАЛЬНОСТЬ?\n\nСуммируя:Да, если вы являетесь жителем Калифорнии, вам предоставляются определенные права в отношении доступа к вашей личной информации.\n\nРаздел 1798.83 Гражданского кодекса Калифорнии, также известный как «Закон о сиянии», разрешает нашим пользователям, проживающим в Калифорнии, запрашивать и получать от нас раз в год и бесплатно информацию о категориях личной информации (если таковая имеется), которую мы раскрывается третьим лицам в целях прямого маркетинга, а также имена и адреса всех третьих лиц, которым мы передавали личную информацию в непосредственно предшествующем календарном году. Если вы являетесь жителем Калифорнии и хотели бы сделать такой запрос, отправьте нам свой запрос в письменной форме, используя контактную информацию, указанную ниже.\n\nЕсли вам меньше 18 лет, вы проживаете в Калифорнии и имеете зарегистрированную учетную запись в Сервисах, вы имеете право запросить удаление нежелательных данных, которые вы публично публикуете в Сервисах. Чтобы запросить удаление таких данных, свяжитесь с нами, используя контактную информацию, указанную ниже, и укажите адрес электронной почты, связанный с вашей учетной записью, и заявление о том, что вы проживаете в Калифорнии. Мы позаботимся о том, чтобы данные не отображались публично в Сервисах, но имейте в виду, что данные не могут быть полностью или полностью удалены из всех наших систем (например, из резервных копий и т. д.).\n\n12. ДЕЛАЕМ ЛИ МЫ ОБНОВЛЕНИЯ ДЛЯ ЭТОГО УВЕДОМЛЕНИЯ?\n\nСуммируя:Да, мы будем обновлять это уведомление по мере необходимости, чтобы соответствовать применимым законам.\n\nМы можем время от времени обновлять это уведомление о конфиденциальности. Обновленная версия будет отмечена обновленной датой «Пересмотрено», и обновленная версия вступит в силу, как только станет доступной. Если мы внесем существенные изменения в это уведомление о конфиденциальности, мы можем уведомить вас либо путем размещения уведомления о таких изменениях на видном месте, либо путем отправки вам уведомления напрямую. Мы рекомендуем вам регулярно просматривать это уведомление о конфиденциальности, чтобы быть в курсе того, как мы защищаем вашу информацию.\n\n13. КАК ВЫ МОЖЕТЕ СВЯЗАТЬСЯ С НАМИ ПО ЭТОМУ УВЕДОМЛЕНИЮ?\n\nЕсли у вас есть вопросы или комментарии по этому уведомлению, вы можете отправить нам электронное письмо по адресу app@tradefru.com или связаться с нами по почте по адресу:\n\nYOUREXPORT MANAGER IDARI DANISMANLIK NAKLIYE ITHALAT IHRACAT DIS TICARET VE SANAYI LIMITED SIRKETI\nDOGUYAKA MAH. TERMESSOS BUL. IS MERKEZI BLOK NO: 33 IC KAPI NO: 301                            МУРАТПАША/АНТАЛИЯ/ТУРЦИЯ\nТЕЛЕФОН: +905336200750\nEMAIL: APP@TRADEFRU.COM\n\n14. КАК ВЫ МОЖЕТЕ ПРОСМОТРЕТЬ, ОБНОВИТЬ ИЛИ УДАЛИТЬ ДАННЫЕ, КОТОРЫЕ МЫ СОБИРАЕМ ОТ ВАС?\n\nВ соответствии с действующим законодательством вашей страны вы можете иметь право запросить доступ к личной информации, которую мы получаем от вас, изменить эту информацию или удалить ее. Чтобы запросить просмотр, обновление или удаление вашей личной информации, свяжитесь с нами по электронной почте app@tradefru.com .\n',
      'en':
          'This privacy notice for YOUREXPORT MANAGER IDARI DANISMANLIK NAKLIYE ITHALAT IHRACAT DIS TICARET VE SANAYI LIMITED SIRKETI (\'Company\', \'we\', \'us\', or \'our\'), describes how and why we might collect, store, use, and/or share (\'process\') your information when you use our services (\'Services\'), such as when you:\n\tDownload and use our mobile application (FTC group), or any other application of ours that links to this privacy notice\n\tEngage with us in other related ways, including any sales, marketing, or events\nQuestions or concerns? Reading this privacy notice will help you understand your privacy rights and choices. If you do not agree with our policies and practices, please do not use our Services. If you still have any questions or concerns, please contact us at app@tradefru.com.\n\n\nSUMMARY OF KEY POINTS\n\nThis summary provides key points from our privacy notice.\n\nWhat personal information do we process? When you visit, use, or navigate our Services, we may process personal information depending on how you interact with YOUREXPORT MANAGER IDARI DANISMANLIK NAKLIYE ITHALAT IHRACAT DIS TICARET VE SANAYI LIMITED SIRKETI and the Services, the choices you make, and the products and features you use. Learn more about personal information you disclose to us.\n\nDo we process any sensitive personal information? We do not process sensitive personal information.\n\nDo we receive any information from third parties? We may receive information from public databases, marketing partners, social media platforms, and other outside sources. Learn more about information collected from other sources.\n\nHow do we process your information? We process your information to provide, improve, and administer our Services, communicate with you, for security and fraud prevention, and to comply with law. We may also process your information for other purposes with your consent. We process your information only when we have a valid legal reason to do so. Learn more about how we process your information.\n\nIn what situations and with which parties do we share personal information? We may share information in specific situations and with specific third parties. Learn more about when and with whom we share your personal information.\n\nHow do we keep your information safe? We have organisational and technical processes and procedures in place to protect your personal information. However, no electronic transmission over the internet or information storage technology can be guaranteed to be 100% secure, so we cannot promise or guarantee that hackers, cybercriminals, or other unauthorised third parties will not be able to defeat our security and improperly collect, access, steal, or modify your information. Learn more about how we keep your information safe.\n\nWhat are your rights? Depending on where you are located geographically, the applicable privacy law may mean you have certain rights regarding your personal information. Learn more about your privacy rights.\n\nHow do you exercise your rights? The easiest way to exercise your rights is by submitting a data subject access request, or by contacting us. We will consider and act upon any request in accordance with applicable data protection laws.\n\nWant to learn more about what YOUREXPORT MANAGER IDARI DANISMANLIK NAKLIYE ITHALAT IHRACAT DIS TICARET VE SANAYI LIMITED SIRKETI does with any information we collect? Review the privacy notice in full.\n\n\n1. WHAT INFORMATION DO WE COLLECT?\n\nPersonal information you disclose to us\n\nIn Short: We collect personal information that you provide to us.\n\nWe collect personal information that you voluntarily provide to us when you register on the Services, express an interest in obtaining information about us or our products and Services, when you participate in activities on the Services, or otherwise when you contact us.\n\nPersonal Information Provided by You. The personal information that we collect depends on the context of your interactions with us and the Services, the choices you make, and the products and features you use. The personal information we collect may include the following:\n\tnames\n\temail addresses\nSensitive Information. We do not process sensitive information.\n\nApplication Data. If you use our application(s), we also may collect the following information if you choose to provide us with access or permission:\n\tPush Notifications. We may request to send you push notifications regarding your account or certain features of the application(s). If you wish to opt out from receiving these types of communications, you may turn them off in your device\'s settings.\nThis information is primarily needed to maintain the security and operation of our application(s), for troubleshooting, and for our internal analytics and reporting purposes.\n\nAll personal information that you provide to us must be true, complete, and accurate, and you must notify us of any changes to such personal information.\n\nInformation automatically collected\n\nIn Short: Some information — such as your Internet Protocol (IP) address and/or browser and device characteristics — is collected automatically when you visit our Services.\n\nWe automatically collect certain information when you visit, use, or navigate the Services. This information does not reveal your specific identity (like your name or contact information) but may include device and usage information, such as your IP address, browser and device characteristics, operating system, language preferences, referring URLs, device name, country, location, information about how and when you use our Services, and other technical information. This information is primarily needed to maintain the security and operation of our Services, and for our internal analytics and reporting purposes.\n\nThe information we collect includes:\n\tLog and Usage Data. Log and usage data is service-related, diagnostic, usage, and performance information our servers automatically collect when you access or use our Services and which we record in log files. Depending on how you interact with us, this log data may include your IP address, device information, browser type, and settings and information about your activity in the Services (such as the date/time stamps associated with your usage, pages and files viewed, searches, and other actions you take such as which features you use), device event information (such as system activity, error reports (sometimes called \'crash dumps\'), and hardware settings).\n\tDevice Data. We collect device data such as information about your computer, phone, tablet, or other device you use to access the Services. Depending on the device used, this device data may include information such as your IP address (or proxy server), device and application identification numbers, location, browser type, hardware model, Internet service provider and/or mobile carrier, operating system, and system configuration information.\n\tLocation Data. We collect location data such as information about your device\'s location, which can be either precise or imprecise. How much information we collect depends on the type and settings of the device you use to access the Services. For example, we may use GPS and other technologies to collect geolocation data that tells us your current location (based on your IP address). You can opt out of allowing us to collect this information either by refusing access to the information or by disabling your Location setting on your device. However, if you choose to opt out, you may not be able to use certain aspects of the Services.\nInformation collected from other sources\n\nIn Short: We may collect limited data from public databases, marketing partners, and other outside sources.\n\nIn order to enhance our ability to provide relevant marketing, offers, and services to you and update our records, we may obtain information about you from other sources, such as public databases, joint marketing partners, affiliate programs, data providers, and from other third parties. This information includes mailing addresses, job titles, email addresses, phone numbers, intent data (or user behaviour data), Internet Protocol (IP) addresses, social media profiles, social media URLs, and custom profiles, for purposes of targeted advertising and event promotion.\n\n2. HOW DO WE PROCESS YOUR INFORMATION?\n\nIn Short: We process your information to provide, improve, and administer our Services, communicate with you, for security and fraud prevention, and to comply with law. We may also process your information for other purposes with your consent.\n\nWe process your personal information for a variety of reasons, depending on how you interact with our Services, including:\n\tTo facilitate account creation and authentication and otherwise manage user accounts. We may process your information so you can create and log in to your account, as well as keep your account in working order.\n\tTo deliver and facilitate delivery of services to the user. We may process your information to provide you with the requested service.\n\tTo send administrative information to you. We may process your information to send you details about our products and services, changes to our terms and policies, and other similar information.\n\tTo fulfil and manage your orders. We may process your information to fulfil and manage your orders, payments, returns, and exchanges made through the Services.\n\tTo request feedback. We may process your information when necessary to request feedback and to contact you about your use of our Services.\n\tTo send you marketing and promotional communications. We may process the personal information you send to us for our marketing purposes, if this is in accordance with your marketing preferences. You can opt out of our marketing emails at any time. For more information, see \'WHAT ARE YOUR PRIVACY RIGHTS?\' below.\n\tTo deliver targeted advertising to you. We may process your information to develop and display personalised content and advertising tailored to your interests, location, and more.\n\tTo save or protect an individual\'s vital interest. We may process your information when necessary to save or protect an individual’s vital interest, such as to prevent harm.\n\n3. WHAT LEGAL BASES DO WE RELY ON TO PROCESS YOUR INFORMATION?\n\nIn Short: We only process your personal information when we believe it is necessary and we have a valid legal reason (i.e. legal basis) to do so under applicable law, like with your consent, to comply with laws, to provide you with services to enter into or fulfil our contractual obligations, to protect your rights, or to fulfil our legitimate business interests.\n\nThe General Data Protection Regulation (GDPR) and UK GDPR require us to explain the valid legal bases we rely on in order to process your personal information. As such, we may rely on the following legal bases to process your personal information:\n\tConsent. We may process your information if you have given us permission (i.e.consent) to use your personal information for a specific purpose. You can withdraw your consent at any time. Learn more about withdrawing your consent.\n\tPerformance of a Contract. We may process your personal information when we believe it is necessary to fulfil our contractual obligations to you, including providing our Services or at your request prior to entering into a contract with you.\n\tLegitimate Interests. We may process your information when we believe it is reasonably necessary to achieve our legitimate business interests and those interests do not outweigh your interests and fundamental rights and freedoms. For example, we may process your personal information for some of the purposes described in order to:\n\tSend users information about special offers and discounts on our products and services\n\tDevelop and display personalised and relevant advertising content for our users\n\tUnderstand how our users use our products and services so we can improve user experience\n\tLegal Obligations. We may process your information where we believe it is necessary for compliance with our legal obligations, such as to cooperate with a law enforcement body or regulatory agency, exercise or defend our legal rights, or disclose your information as evidence in litigation in which we are involved.\n\n\tVital Interests. We may process your information where we believe it is necessary to protect your vital interests or the vital interests of a third party, such as situations involving potential threats to the safety of any person.\n\n4. WHEN AND WITH WHOM DO WE SHARE YOUR PERSONAL INFORMATION?\n\nIn Short: We may share information in specific situations described in this section and/or with the following third parties.\n\nWe may need to share your personal information in the following situations:\n\tBusiness Transfers. We may share or transfer your information in connection with, or during negotiations of, any merger, sale of company assets, financing, or acquisition of all or a portion of our business to another company.\n\tAffiliates. We may share your information with our affiliates, in which case we will require those affiliates to honour this privacy notice. Affiliates include our parent company and any subsidiaries, joint venture partners, or other companies that we control or that are under common control with us.\n\tBusiness Partners. We may share your information with our business partners to offer you certain products, services, or promotions.\n\n5. IS YOUR INFORMATION TRANSFERRED INTERNATIONALLY?\n\nIn Short: We may transfer, store, and process your information in countries other than your own.\n\nOur servers are located in Russia. If you are accessing our Services from outside Russia, please be aware that your information may be transferred to, stored, and processed by us in our facilities and by those third parties with whom we may share your personal information (see \'WHEN AND WITH WHOM DO WE SHARE YOUR PERSONAL INFORMATION?\' above), inRussia, and other countries.\n\nIf you are a resident in the European Economic Area (EEA) or United Kingdom (UK), then these countries may not necessarily have data protection laws or other similar laws as comprehensive as those in your country. However, we will take all necessary measures to protect your personal information in accordance with this privacy notice and applicable law.\n\nEuropean Commission\'s Standard Contractual Clauses:\n\nWe have implemented measures to protect your personal information, including by using the European Commission\'s Standard Contractual Clauses for transfers of personal information between our group companies and between us and our third-party providers. These clauses require all recipients to protect all personal information that they process originating from the EEA or UK in accordance with European data protection laws and regulations. Our Standard Contractual Clauses can be provided upon request. We have implemented similar appropriate safeguards with our third-party service providers and partners and further details can be provided upon request.\n\n6. HOW LONG DO WE KEEP YOUR INFORMATION?\n\nIn Short: We keep your information for as long as necessary to fulfil the purposes outlined in this privacy notice unless otherwise required by law.\n\nWe will only keep your personal information for as long as it is necessary for the purposes set out in this privacy notice, unless a longer retention period is required or permitted by law (such as tax, accounting, or other legal requirements). No purpose in this notice will require us keeping your personal information for longer than twelve (12) months past the start of the idle period of the user\'s account.\n\nWhen we have no ongoing legitimate business need to process your personal information, we will either delete or anonymise such information, or, if this is not possible (for example, because your personal information has been stored in backup archives), then we will securely store your personal information and isolate it from any further processing until deletion is possible.\n\n7. HOW DO WE KEEP YOUR INFORMATION SAFE?\n\nIn Short: We aim to protect your personal information through a system of organisational and technical security measures.\n\nWe have implemented appropriate and reasonable technical and organisational security measures designed to protect the security of any personal information we process. However, despite our safeguards and efforts to secure your information, no electronic transmission over the Internet or information storage technology can be guaranteed to be 100% secure, so we cannot promise or guarantee that hackers, cybercriminals, or other unauthorised third parties will not be able to defeat our security and improperly collect, access, steal, or modify your information. Although we will do our best to protect your personal information, transmission of personal information to and from our Services is at your own risk. You should only access the Services within a secure environment.\n\n8. DO WE COLLECT INFORMATION FROM MINORS?\n\nIn Short: We do not knowingly collect data from or market to children under 18 years of age.\n\nWe do not knowingly solicit data from or market to children under 18 years of age. By using the Services, you represent that you are at least 18 or that you are the parent or guardian of such a minor and consent to such minor dependent’s use of the Services. If we learn that personal information from users less than 18 years of age has been collected, we will deactivate the account and take reasonable measures to promptly delete such data from our records. If you become aware of any data we may have collected from children under age 18, please contact us at app@tradefru.com.\n\n9. WHAT ARE YOUR PRIVACY RIGHTS?\n\nIn Short: In some regions, such as the European Economic Area (EEA) and United Kingdom (UK), you have rights that allow you greater access to and control over your personal information. You may review, change, or terminate your account at any time.\n\nIn some regions (like the EEA and UK), you have certain rights under applicable data protection laws. These may include the right (i) to request access and obtain a copy of your personal information, (ii) to request rectification or erasure; (iii) to restrict the processing of your personal information; and (iv) if applicable, to data portability. In certain circumstances, you may also have the right to object to the processing of your personal information. You can make such a request by contacting us by using the contact details provided in the section \'HOW CAN YOU CONTACT US ABOUT THIS NOTICE?\' below.\n\nWe will consider and act upon any request in accordance with applicable data protection laws.\n \nIf you are located in the EEA or UK and you believe we are unlawfully processing your personal information, you also have the right to complain to your Member State data protection authorityor UK data protection authority.\n\nIf you are located in Switzerland, you may contact the Federal Data Protection and Information Commissioner.\n\nWithdrawing your consent: If we are relying on your consent to process your personal information, you have the right to withdraw your consent at any time. You can withdraw your consent at any time by contacting us by using the contact details provided in the section \'HOW CAN YOU CONTACT US ABOUT THIS NOTICE?\' below.\n\nHowever, please note that this will not affect the lawfulness of the processing before its withdrawal nor, will it affect the processing of your personal information conducted in reliance on lawful processing grounds other than consent.\n\nOpting out of marketing and promotional communications: You can unsubscribe from our marketing and promotional communications at any time by clicking on the unsubscribe link in the emails that we send, or by contacting us using the details provided in the section \'HOW CAN YOU CONTACT US ABOUT THIS NOTICE?\' below. You will then be removed from the marketing lists. However, we may still communicate with you — for example, to send you service-related messages that are necessary for the administration and use of your account, to respond to service requests, or for other non-marketing purposes.\n\nAccount Information\n\nIf you would at any time like to review or change the information in your account or terminate your account, you can:\n\tContact us using the contact information provided.\nUpon your request to terminate your account, we will deactivate or delete your account and information from our active databases. However, we may retain some information in our files to prevent fraud, troubleshoot problems, assist with any investigations, enforce our legal terms and/or comply with applicable legal requirements.\n\nIf you have questions or comments about your privacy rights, you may email us at app@tradefru.com.\n\n10. CONTROLS FOR DO-NOT-TRACK FEATURES\n\nMost web browsers and some mobile operating systems and mobile applications include a Do-Not-Track (\'DNT\') feature or setting you can activate to signal your privacy preference not to have data about your online browsing activities monitored and collected. At this stage no uniform technology standard for recognising and implementing DNT signals has been finalised. As such, we do not currently respond to DNT browser signals or any other mechanism that automatically communicates your choice not to be tracked online. If a standard for online tracking is adopted that we must follow in the future, we will inform you about that practice in a revised version of this privacy notice.\n\n11. DO CALIFORNIA RESIDENTS HAVE SPECIFIC PRIVACY RIGHTS?\n\nIn Short: Yes, if you are a resident of California, you are granted specific rights regarding access to your personal information.\n\nCalifornia Civil Code Section 1798.83, also known as the \'Shine The Light\' law, permits our users who are California residents to request and obtain from us, once a year and free of charge, information about categories of personal information (if any) we disclosed to third parties for direct marketing purposes and the names and addresses of all third parties with which we shared personal information in the immediately preceding calendar year. If you are a California resident and would like to make such a request, please submit your request in writing to us using the contact information provided below.\n\nIf you are under 18 years of age, reside in California, and have a registered account with Services, you have the right to request removal of unwanted data that you publicly post on the Services. To request removal of such data, please contact us using the contact information provided below and include the email address associated with your account and a statement that you reside in California. We will make sure the data is not publicly displayed on the Services, but please be aware that the data may not be completely or comprehensively removed from all our systems (e.g. backups, etc.).\n\n12. DO WE MAKE UPDATES TO THIS NOTICE?\n\nIn Short: Yes, we will update this notice as necessary to stay compliant with relevant laws.\n\nWe may update this privacy notice from time to time. The updated version will be indicated by an updated \'Revised\' date and the updated version will be effective as soon as it is accessible. If we make material changes to this privacy notice, we may notify you either by prominently posting a notice of such changes or by directly sending you a notification. We encourage you to review this privacy notice frequently to be informed of how we are protecting your information.\n\n13. HOW CAN YOU CONTACT US ABOUT THIS NOTICE?\n\nIf you have questions or comments about this notice, you may email us at app@tradefru.com or contact us by post at:\n\nYOUREXPORT MANAGER IDARI DANISMANLIK NAKLIYE ITHALAT IHRACAT DIS TICARET VE SANAYI LIMITED SIRKETI\nDOGUYAKA MAH. TERMESSOS BUL. IS MERKEZI BLOK NO: 33 IC KAPI NO: 301                            MURATPASA/ANTALYA/TURKEY \n\n14. HOW CAN YOU REVIEW, UPDATE, OR DELETE THE DATA WE COLLECT FROM YOU?\n\nBased on the applicable laws of your country, you may have the right to request access to the personal information we collect from you, change that information, or delete it. To request to review, update, or delete your personal information, please contact us via email app@tradefru.com.\n',
      'tr':
          'This privacy notice for YOUREXPORT MANAGER IDARI DANISMANLIK NAKLIYE ITHALAT IHRACAT DIS TICARET VE SANAYI LIMITED SIRKETI (\'Company\', \'we\', \'us\', or \'our\'), describes how and why we might collect, store, use, and/or share (\'process\') your information when you use our services (\'Services\'), such as when you:\n\tDownload and use our mobile application (FTC group), or any other application of ours that links to this privacy notice\n\tEngage with us in other related ways, including any sales, marketing, or events\nQuestions or concerns? Reading this privacy notice will help you understand your privacy rights and choices. If you do not agree with our policies and practices, please do not use our Services. If you still have any questions or concerns, please contact us at app@tradefru.com.\n\n\nSUMMARY OF KEY POINTS\n\nThis summary provides key points from our privacy notice.\n\nWhat personal information do we process? When you visit, use, or navigate our Services, we may process personal information depending on how you interact with YOUREXPORT MANAGER IDARI DANISMANLIK NAKLIYE ITHALAT IHRACAT DIS TICARET VE SANAYI LIMITED SIRKETI and the Services, the choices you make, and the products and features you use. Learn more about personal information you disclose to us.\n\nDo we process any sensitive personal information? We do not process sensitive personal information.\n\nDo we receive any information from third parties? We may receive information from public databases, marketing partners, social media platforms, and other outside sources. Learn more about information collected from other sources.\n\nHow do we process your information? We process your information to provide, improve, and administer our Services, communicate with you, for security and fraud prevention, and to comply with law. We may also process your information for other purposes with your consent. We process your information only when we have a valid legal reason to do so. Learn more about how we process your information.\n\nIn what situations and with which parties do we share personal information? We may share information in specific situations and with specific third parties. Learn more about when and with whom we share your personal information.\n\nHow do we keep your information safe? We have organisational and technical processes and procedures in place to protect your personal information. However, no electronic transmission over the internet or information storage technology can be guaranteed to be 100% secure, so we cannot promise or guarantee that hackers, cybercriminals, or other unauthorised third parties will not be able to defeat our security and improperly collect, access, steal, or modify your information. Learn more about how we keep your information safe.\n\nWhat are your rights? Depending on where you are located geographically, the applicable privacy law may mean you have certain rights regarding your personal information. Learn more about your privacy rights.\n\nHow do you exercise your rights? The easiest way to exercise your rights is by submitting a data subject access request, or by contacting us. We will consider and act upon any request in accordance with applicable data protection laws.\n\nWant to learn more about what YOUREXPORT MANAGER IDARI DANISMANLIK NAKLIYE ITHALAT IHRACAT DIS TICARET VE SANAYI LIMITED SIRKETI does with any information we collect? Review the privacy notice in full.\n\n\n1. WHAT INFORMATION DO WE COLLECT?\n\nPersonal information you disclose to us\n\nIn Short: We collect personal information that you provide to us.\n\nWe collect personal information that you voluntarily provide to us when you register on the Services, express an interest in obtaining information about us or our products and Services, when you participate in activities on the Services, or otherwise when you contact us.\n\nPersonal Information Provided by You. The personal information that we collect depends on the context of your interactions with us and the Services, the choices you make, and the products and features you use. The personal information we collect may include the following:\n\tnames\n\temail addresses\nSensitive Information. We do not process sensitive information.\n\nApplication Data. If you use our application(s), we also may collect the following information if you choose to provide us with access or permission:\n\tPush Notifications. We may request to send you push notifications regarding your account or certain features of the application(s). If you wish to opt out from receiving these types of communications, you may turn them off in your device\'s settings.\nThis information is primarily needed to maintain the security and operation of our application(s), for troubleshooting, and for our internal analytics and reporting purposes.\n\nAll personal information that you provide to us must be true, complete, and accurate, and you must notify us of any changes to such personal information.\n\nInformation automatically collected\n\nIn Short: Some information — such as your Internet Protocol (IP) address and/or browser and device characteristics — is collected automatically when you visit our Services.\n\nWe automatically collect certain information when you visit, use, or navigate the Services. This information does not reveal your specific identity (like your name or contact information) but may include device and usage information, such as your IP address, browser and device characteristics, operating system, language preferences, referring URLs, device name, country, location, information about how and when you use our Services, and other technical information. This information is primarily needed to maintain the security and operation of our Services, and for our internal analytics and reporting purposes.\n\nThe information we collect includes:\n\tLog and Usage Data. Log and usage data is service-related, diagnostic, usage, and performance information our servers automatically collect when you access or use our Services and which we record in log files. Depending on how you interact with us, this log data may include your IP address, device information, browser type, and settings and information about your activity in the Services (such as the date/time stamps associated with your usage, pages and files viewed, searches, and other actions you take such as which features you use), device event information (such as system activity, error reports (sometimes called \'crash dumps\'), and hardware settings).\n\tDevice Data. We collect device data such as information about your computer, phone, tablet, or other device you use to access the Services. Depending on the device used, this device data may include information such as your IP address (or proxy server), device and application identification numbers, location, browser type, hardware model, Internet service provider and/or mobile carrier, operating system, and system configuration information.\n\tLocation Data. We collect location data such as information about your device\'s location, which can be either precise or imprecise. How much information we collect depends on the type and settings of the device you use to access the Services. For example, we may use GPS and other technologies to collect geolocation data that tells us your current location (based on your IP address). You can opt out of allowing us to collect this information either by refusing access to the information or by disabling your Location setting on your device. However, if you choose to opt out, you may not be able to use certain aspects of the Services.\nInformation collected from other sources\n\nIn Short: We may collect limited data from public databases, marketing partners, and other outside sources.\n\nIn order to enhance our ability to provide relevant marketing, offers, and services to you and update our records, we may obtain information about you from other sources, such as public databases, joint marketing partners, affiliate programs, data providers, and from other third parties. This information includes mailing addresses, job titles, email addresses, phone numbers, intent data (or user behaviour data), Internet Protocol (IP) addresses, social media profiles, social media URLs, and custom profiles, for purposes of targeted advertising and event promotion.\n\n2. HOW DO WE PROCESS YOUR INFORMATION?\n\nIn Short: We process your information to provide, improve, and administer our Services, communicate with you, for security and fraud prevention, and to comply with law. We may also process your information for other purposes with your consent.\n\nWe process your personal information for a variety of reasons, depending on how you interact with our Services, including:\n\tTo facilitate account creation and authentication and otherwise manage user accounts. We may process your information so you can create and log in to your account, as well as keep your account in working order.\n\tTo deliver and facilitate delivery of services to the user. We may process your information to provide you with the requested service.\n\tTo send administrative information to you. We may process your information to send you details about our products and services, changes to our terms and policies, and other similar information.\n\tTo fulfil and manage your orders. We may process your information to fulfil and manage your orders, payments, returns, and exchanges made through the Services.\n\tTo request feedback. We may process your information when necessary to request feedback and to contact you about your use of our Services.\n\tTo send you marketing and promotional communications. We may process the personal information you send to us for our marketing purposes, if this is in accordance with your marketing preferences. You can opt out of our marketing emails at any time. For more information, see \'WHAT ARE YOUR PRIVACY RIGHTS?\' below.\n\tTo deliver targeted advertising to you. We may process your information to develop and display personalised content and advertising tailored to your interests, location, and more.\n\tTo save or protect an individual\'s vital interest. We may process your information when necessary to save or protect an individual’s vital interest, such as to prevent harm.\n\n3. WHAT LEGAL BASES DO WE RELY ON TO PROCESS YOUR INFORMATION?\n\nIn Short: We only process your personal information when we believe it is necessary and we have a valid legal reason (i.e. legal basis) to do so under applicable law, like with your consent, to comply with laws, to provide you with services to enter into or fulfil our contractual obligations, to protect your rights, or to fulfil our legitimate business interests.\n\nThe General Data Protection Regulation (GDPR) and UK GDPR require us to explain the valid legal bases we rely on in order to process your personal information. As such, we may rely on the following legal bases to process your personal information:\n\tConsent. We may process your information if you have given us permission (i.e.consent) to use your personal information for a specific purpose. You can withdraw your consent at any time. Learn more about withdrawing your consent.\n\tPerformance of a Contract. We may process your personal information when we believe it is necessary to fulfil our contractual obligations to you, including providing our Services or at your request prior to entering into a contract with you.\n\tLegitimate Interests. We may process your information when we believe it is reasonably necessary to achieve our legitimate business interests and those interests do not outweigh your interests and fundamental rights and freedoms. For example, we may process your personal information for some of the purposes described in order to:\n\tSend users information about special offers and discounts on our products and services\n\tDevelop and display personalised and relevant advertising content for our users\n\tUnderstand how our users use our products and services so we can improve user experience\n\tLegal Obligations. We may process your information where we believe it is necessary for compliance with our legal obligations, such as to cooperate with a law enforcement body or regulatory agency, exercise or defend our legal rights, or disclose your information as evidence in litigation in which we are involved.\n\n\tVital Interests. We may process your information where we believe it is necessary to protect your vital interests or the vital interests of a third party, such as situations involving potential threats to the safety of any person.\n\n4. WHEN AND WITH WHOM DO WE SHARE YOUR PERSONAL INFORMATION?\n\nIn Short: We may share information in specific situations described in this section and/or with the following third parties.\n\nWe may need to share your personal information in the following situations:\n\tBusiness Transfers. We may share or transfer your information in connection with, or during negotiations of, any merger, sale of company assets, financing, or acquisition of all or a portion of our business to another company.\n\tAffiliates. We may share your information with our affiliates, in which case we will require those affiliates to honour this privacy notice. Affiliates include our parent company and any subsidiaries, joint venture partners, or other companies that we control or that are under common control with us.\n\tBusiness Partners. We may share your information with our business partners to offer you certain products, services, or promotions.\n\n5. IS YOUR INFORMATION TRANSFERRED INTERNATIONALLY?\n\nIn Short: We may transfer, store, and process your information in countries other than your own.\n\nOur servers are located in Russia. If you are accessing our Services from outside Russia, please be aware that your information may be transferred to, stored, and processed by us in our facilities and by those third parties with whom we may share your personal information (see \'WHEN AND WITH WHOM DO WE SHARE YOUR PERSONAL INFORMATION?\' above), inRussia, and other countries.\n\nIf you are a resident in the European Economic Area (EEA) or United Kingdom (UK), then these countries may not necessarily have data protection laws or other similar laws as comprehensive as those in your country. However, we will take all necessary measures to protect your personal information in accordance with this privacy notice and applicable law.\n\nEuropean Commission\'s Standard Contractual Clauses:\n\nWe have implemented measures to protect your personal information, including by using the European Commission\'s Standard Contractual Clauses for transfers of personal information between our group companies and between us and our third-party providers. These clauses require all recipients to protect all personal information that they process originating from the EEA or UK in accordance with European data protection laws and regulations. Our Standard Contractual Clauses can be provided upon request. We have implemented similar appropriate safeguards with our third-party service providers and partners and further details can be provided upon request.\n\n6. HOW LONG DO WE KEEP YOUR INFORMATION?\n\nIn Short: We keep your information for as long as necessary to fulfil the purposes outlined in this privacy notice unless otherwise required by law.\n\nWe will only keep your personal information for as long as it is necessary for the purposes set out in this privacy notice, unless a longer retention period is required or permitted by law (such as tax, accounting, or other legal requirements). No purpose in this notice will require us keeping your personal information for longer than twelve (12) months past the start of the idle period of the user\'s account.\n\nWhen we have no ongoing legitimate business need to process your personal information, we will either delete or anonymise such information, or, if this is not possible (for example, because your personal information has been stored in backup archives), then we will securely store your personal information and isolate it from any further processing until deletion is possible.\n\n7. HOW DO WE KEEP YOUR INFORMATION SAFE?\n\nIn Short: We aim to protect your personal information through a system of organisational and technical security measures.\n\nWe have implemented appropriate and reasonable technical and organisational security measures designed to protect the security of any personal information we process. However, despite our safeguards and efforts to secure your information, no electronic transmission over the Internet or information storage technology can be guaranteed to be 100% secure, so we cannot promise or guarantee that hackers, cybercriminals, or other unauthorised third parties will not be able to defeat our security and improperly collect, access, steal, or modify your information. Although we will do our best to protect your personal information, transmission of personal information to and from our Services is at your own risk. You should only access the Services within a secure environment.\n\n8. DO WE COLLECT INFORMATION FROM MINORS?\n\nIn Short: We do not knowingly collect data from or market to children under 18 years of age.\n\nWe do not knowingly solicit data from or market to children under 18 years of age. By using the Services, you represent that you are at least 18 or that you are the parent or guardian of such a minor and consent to such minor dependent’s use of the Services. If we learn that personal information from users less than 18 years of age has been collected, we will deactivate the account and take reasonable measures to promptly delete such data from our records. If you become aware of any data we may have collected from children under age 18, please contact us at app@tradefru.com.\n\n9. WHAT ARE YOUR PRIVACY RIGHTS?\n\nIn Short: In some regions, such as the European Economic Area (EEA) and United Kingdom (UK), you have rights that allow you greater access to and control over your personal information. You may review, change, or terminate your account at any time.\n\nIn some regions (like the EEA and UK), you have certain rights under applicable data protection laws. These may include the right (i) to request access and obtain a copy of your personal information, (ii) to request rectification or erasure; (iii) to restrict the processing of your personal information; and (iv) if applicable, to data portability. In certain circumstances, you may also have the right to object to the processing of your personal information. You can make such a request by contacting us by using the contact details provided in the section \'HOW CAN YOU CONTACT US ABOUT THIS NOTICE?\' below.\n\nWe will consider and act upon any request in accordance with applicable data protection laws.\n \nIf you are located in the EEA or UK and you believe we are unlawfully processing your personal information, you also have the right to complain to your Member State data protection authorityor UK data protection authority.\n\nIf you are located in Switzerland, you may contact the Federal Data Protection and Information Commissioner.\n\nWithdrawing your consent: If we are relying on your consent to process your personal information, you have the right to withdraw your consent at any time. You can withdraw your consent at any time by contacting us by using the contact details provided in the section \'HOW CAN YOU CONTACT US ABOUT THIS NOTICE?\' below.\n\nHowever, please note that this will not affect the lawfulness of the processing before its withdrawal nor, will it affect the processing of your personal information conducted in reliance on lawful processing grounds other than consent.\n\nOpting out of marketing and promotional communications: You can unsubscribe from our marketing and promotional communications at any time by clicking on the unsubscribe link in the emails that we send, or by contacting us using the details provided in the section \'HOW CAN YOU CONTACT US ABOUT THIS NOTICE?\' below. You will then be removed from the marketing lists. However, we may still communicate with you — for example, to send you service-related messages that are necessary for the administration and use of your account, to respond to service requests, or for other non-marketing purposes.\n\nAccount Information\n\nIf you would at any time like to review or change the information in your account or terminate your account, you can:\n\tContact us using the contact information provided.\nUpon your request to terminate your account, we will deactivate or delete your account and information from our active databases. However, we may retain some information in our files to prevent fraud, troubleshoot problems, assist with any investigations, enforce our legal terms and/or comply with applicable legal requirements.\n\nIf you have questions or comments about your privacy rights, you may email us at app@tradefru.com.\n\n10. CONTROLS FOR DO-NOT-TRACK FEATURES\n\nMost web browsers and some mobile operating systems and mobile applications include a Do-Not-Track (\'DNT\') feature or setting you can activate to signal your privacy preference not to have data about your online browsing activities monitored and collected. At this stage no uniform technology standard for recognising and implementing DNT signals has been finalised. As such, we do not currently respond to DNT browser signals or any other mechanism that automatically communicates your choice not to be tracked online. If a standard for online tracking is adopted that we must follow in the future, we will inform you about that practice in a revised version of this privacy notice.\n\n11. DO CALIFORNIA RESIDENTS HAVE SPECIFIC PRIVACY RIGHTS?\n\nIn Short: Yes, if you are a resident of California, you are granted specific rights regarding access to your personal information.\n\nCalifornia Civil Code Section 1798.83, also known as the \'Shine The Light\' law, permits our users who are California residents to request and obtain from us, once a year and free of charge, information about categories of personal information (if any) we disclosed to third parties for direct marketing purposes and the names and addresses of all third parties with which we shared personal information in the immediately preceding calendar year. If you are a California resident and would like to make such a request, please submit your request in writing to us using the contact information provided below.\n\nIf you are under 18 years of age, reside in California, and have a registered account with Services, you have the right to request removal of unwanted data that you publicly post on the Services. To request removal of such data, please contact us using the contact information provided below and include the email address associated with your account and a statement that you reside in California. We will make sure the data is not publicly displayed on the Services, but please be aware that the data may not be completely or comprehensively removed from all our systems (e.g. backups, etc.).\n\n12. DO WE MAKE UPDATES TO THIS NOTICE?\n\nIn Short: Yes, we will update this notice as necessary to stay compliant with relevant laws.\n\nWe may update this privacy notice from time to time. The updated version will be indicated by an updated \'Revised\' date and the updated version will be effective as soon as it is accessible. If we make material changes to this privacy notice, we may notify you either by prominently posting a notice of such changes or by directly sending you a notification. We encourage you to review this privacy notice frequently to be informed of how we are protecting your information.\n\n13. HOW CAN YOU CONTACT US ABOUT THIS NOTICE?\n\nIf you have questions or comments about this notice, you may email us at app@tradefru.com or contact us by post at:\n\nYOUREXPORT MANAGER IDARI DANISMANLIK NAKLIYE ITHALAT IHRACAT DIS TICARET VE SANAYI LIMITED SIRKETI\nDOGUYAKA MAH. TERMESSOS BUL. IS MERKEZI BLOK NO: 33 IC KAPI NO: 301                            MURATPASA/ANTALYA/TURKEY \n\n14. HOW CAN YOU REVIEW, UPDATE, OR DELETE THE DATA WE COLLECT FROM YOU?\n\nBased on the applicable laws of your country, you may have the right to request access to the personal information we collect from you, change that information, or delete it. To request to review, update, or delete your personal information, please contact us via email app@tradefru.com.\n',
    },
    'wvvimnvl': {
      'ru': 'Home',
      'en': 'Home',
      'tr': 'Ev',
    },
  },
  // usingRulesPage
  {
    'a8141rtv': {
      'ru': 'О приложении',
      'en': 'About',
      'tr': 'Hakkında',
    },
    '5p6my0cm': {
      'ru': 'Правила пользования',
      'en': 'Terms of use',
      'tr': 'Terms of use',
    },
    'cy66xa5t': {
      'ru':
          'YOUREXPORT MANAGER IDARI DANISMANLIK NAKLIYE ITHALAT IHRACAT DIS TICARET VE SANAYI LIMITED SIRKETI (\"Компания\", \"мы\", \"нас\" или \"наш\"), компания, зарегистрированная в Турции по адресу DOGUYAKA MAH. TERMESSOS BUL. IS MERKEZI BLOK NO: 33 IC KAPI NO: 301 МУРАТПАША/АНТАЛИЯ/ТУРЦИЯ. Наш номер налогоплательщика 9820905455.\n \nМы управляем мобильным приложением FTC group («Приложение»), а также любыми другими сопутствующими продуктами и услугами, которые ссылаются или ссылаются на эти юридические условия («Юридические условия») (совместно именуемые «Сервисы»).\n\nВы можете связаться с нами по телефону +905336200750, по электронной почте app@tradefru.com или по почте на адрес DOGUYAKA MAH. TERMESSOS BUL. IS MERKEZI BLOK NO: 33 IC KAPI NO: 301 МУРАТПАША/АНТАЛИЯ/ТУРЦИЯ.\n\nНастоящие Юридические условия представляют собой юридически обязывающее соглашение, заключенное между вами лично или от имени юридического лица («вы»), YOUREXPORT MANAGER IDARI DANISMANLIK NAKLIYE ITHALAT IHRACAT DIS TICARET VE SANAYI LIMITED SIRKETI, касающиеся вашего доступа к Услугам и их использования. Вы соглашаетесь с тем, что, получая доступ к Услугам, вы прочитали, поняли и согласились соблюдать все эти Юридические условия. ЕСЛИ ВЫ НЕ СОГЛАСНЫ СО ВСЕМИ ЭТИМИ ЮРИДИЧЕСКИМИ УСЛОВИЯМИ, ТО ВАМ ПРЯМО ЗАПРЕЩАЕТСЯ ИСПОЛЬЗОВАТЬ УСЛУГИ, И ВЫ ДОЛЖНЫ НЕМЕДЛЕННО ПРЕКРАТИТЬ ИСПОЛЬЗОВАНИЕ.\n\nДополнительные положения и условия или документы, которые могут время от времени публиковаться в Сервисах, настоящим прямо включены в настоящий документ посредством ссылки. Мы оставляем за собой право по собственному усмотрению время от времени вносить изменения или дополнения в настоящие Юридические условия. Мы будем уведомлять вас о любых изменениях, обновляя дату «Последнее обновление» настоящих Юридических условий, и вы отказываетесь от любого права на получение специального уведомления о каждом таком изменении. Вы обязаны периодически просматривать эти Юридические условия, чтобы быть в курсе обновлений. Вы будете подвергаться изменениям в любых пересмотренных Юридических условиях, и будет считаться, что вы их уведомили и приняли, если продолжите использовать Услуги после даты публикации таких пересмотренных Юридических условий.\n\nВсе пользователи, которые являются несовершеннолетними в юрисдикции, в которой они проживают (как правило, в возрасте до 18 лет), должны иметь разрешение и находиться под непосредственным контролем своих родителей или опекунов для использования Услуг. Если вы несовершеннолетний, ваш родитель или опекун должен прочитать и принять настоящие Юридические условия до того, как вы начнете пользоваться Услугами.\n\nМы рекомендуем вам распечатать копию этих Юридических условий для вашего архива.\n\n\n1. НАШИ УСЛУГИ\n\nИнформация, предоставляемая при использовании Услуг, не предназначена для распространения или использования каким-либо физическим или юридическим лицом в любой юрисдикции или стране, где такое распространение или использование противоречило бы закону или нормативным актам, или которое налагало бы на нас какие-либо требования о регистрации в такой юрисдикции или страна. Соответственно, те лица, которые выбирают доступ к Услугам из других мест, делают это по собственной инициативе и несут единоличную ответственность за соблюдение местного законодательства, если и в той мере, в какой это применимо к местному законодательству.\n\n2. ПРАВА ИНТЕЛЛЕКТУАЛЬНОЙ СОБСТВЕННОСТИ\n\nНаша интеллектуальная собственность\n\nМы являемся владельцем или лицензиатом всех прав на интеллектуальную собственность в отношении наших Услуг, включая весь исходный код, базы данных, функциональные возможности, программное обеспечение, дизайн веб-сайтов, аудио, видео, текст, фотографии и графику в Услугах (совместно именуемые «Контент»). ), а также содержащиеся в них товарные знаки, знаки обслуживания и логотипы («Знаки»).\n\nНаш Контент и Знаки защищены законами об авторском праве и товарных знаках (а также различными другими правами на интеллектуальную собственность и законами о недобросовестной конкуренции) и договорами в США и во всем мире.\n\nКонтент и Знаки предоставляются в Услугах или через них «КАК ЕСТЬ» для вашего личного, некоммерческого использования или только для внутренних деловых целей.\n\nВаше использование наших Сервисов\n\nПри условии соблюдения вами настоящих Юридических условий, включая раздел «ЗАПРЕЩЕННЫЕ ДЕЙСТВИЯ» ниже, мы предоставляем вам неисключительную, непередаваемую, отзывную лицензию на:\n–\tполучить доступ к Услугам\n–\tзагружать или распечатывать копию любой части Контента, к которому вы надлежащим образом получили доступ.\nисключительно для вашего личного, некоммерческого использования или внутренних деловых целей.\n\nЗа исключением случаев, указанных в этом разделе или в другом месте наших Юридических условий, никакая часть Услуг, а также Контент или Знаки не могут быть скопированы, воспроизведены, агрегированы, переизданы, загружены, опубликованы, публично показаны, закодированы, переведены, переданы, распространены, проданы. , лицензированы или иным образом используются в любых коммерческих целях без нашего явного предварительного письменного разрешения.\n\nЕсли вы хотите каким-либо образом использовать Услуги, Контент или Знаки, кроме указанных в этом разделе или в другом месте наших Юридических условий, направьте свой запрос по адресу: app@tradefru.com . Если мы когда-либо предоставим вам разрешение на публикацию, воспроизведение или публичную демонстрацию какой-либо части наших Услуг или Контента, вы должны указать нас как владельцев или лицензиаров Услуг, Контента или Знаков и убедиться, что любое уведомление об авторских правах или правах собственности появляется или отображается при публикации, воспроизведении или отображении нашего Контента.\n\nМы оставляем за собой все права, не предоставленные вам явным образом в отношении Услуг, Контента и Знаков.\n\nЛюбое нарушение этих Прав на интеллектуальную собственность будет представлять собой существенное нарушение наших Юридических условий, и ваше право на использование наших Услуг будет немедленно прекращено.\n\nВаши материалы\n\nПожалуйста, просмотрите этот раздел и \'ЗАПРЕЩЕННАЯ ДЕЯТЕЛЬНОСТЬ\' перед использованием наших Сервисов, чтобы понять (а) права, которые вы нам даете, и (б) обязательства, которые вы несете, когда публикуете или загружаете любой контент через Сервисы.\n\nМатериалы:Направляя нам напрямую любой вопрос, комментарий, предложение, идею, отзыв или другую информацию об Услугах («Материалы»), вы соглашаетесь передать нам все права на интеллектуальную собственность в таких Материалах. Вы соглашаетесь с тем, что мы будем владеть этим Представлением и иметь право на его неограниченное использование и распространение в любых законных целях, коммерческих или иных, без уведомления или компенсации вам.\n\nВы несете ответственность за то, что публикуете или загружаете:Отправляя нам Материалы через любую часть Сервисов, вы:\n–\tподтвердите, что вы прочитали и согласны с нашими «ЗАПРЕЩЕНЫМИ ДЕЙСТВИЯМИ» и не будете публиковать, отправлять, публиковать, загружать или передавать через Сервисы какие-либо Материалы, которые являются незаконными, оскорбительными, ненавистническими, вредными, клеветническими, непристойными, запугивающими, оскорбительными, дискриминационными. , угрожающие любому лицу или группе лиц, откровенно сексуального характера, ложные, неточные, вводящие в заблуждение или вводящие в заблуждение;\n–\tв той степени, в которой это разрешено применимым законодательством, отказываться от любых и всех моральных прав на любое такое Представление;\n–\tгарантировать, что любые такие Представления являются исходными для вас или что у вас есть необходимые права и лицензии для подачи таких Представлений и что у вас есть все полномочия предоставить нам вышеупомянутые права в отношении ваших Представлений; и\n–\tгарантирует и заверяет, что ваши Материалы не являются конфиденциальной информацией.\nВы несете единоличную ответственность за свои Материалы и прямо соглашаетесь возместить нам любые убытки, которые мы можем понести из-за нарушения вами (а) настоящего раздела, (б) любых прав интеллектуальной собственности третьих лиц или (в) применимого законодательства.\n\n3. ПРЕДСТАВЛЕНИЯ ПОЛЬЗОВАТЕЛЯ\n\nИспользуя Услуги, вы заявляете и гарантируете, что: (1) вся регистрационная информация, которую вы отправляете, будет достоверной, точной, актуальной и полной; (2) вы будете поддерживать точность такой информации и своевременно обновлять такую регистрационную информацию по мере необходимости; (3) вы обладаете дееспособностью и соглашаетесь соблюдать настоящие Юридические условия; (4) вы не являетесь несовершеннолетним в юрисдикции, в которой вы проживаете, или, если вы несовершеннолетний, вы получили разрешение родителей на использование Сервисов; (5) вы не будете получать доступ к Услугам с помощью автоматизированных или нечеловеческих средств, будь то с помощью бота, скрипта или иным образом; (6) вы не будете использовать Услуги для каких-либо незаконных или несанкционированных целей; и (7) использование вами Услуг не будет нарушать какие-либо применимые законы или правила.\n\nЕсли вы предоставляете какую-либо информацию, которая является ложной, неточной, устаревшей или неполной, мы имеем право приостановить или прекратить действие вашей учетной записи и отказать в любом текущем или будущем использовании Услуг (или любой их части).\n\n4. РЕГИСТРАЦИЯ ПОЛЬЗОВАТЕЛЯ\n\nДля использования Сервисов может потребоваться регистрация. Вы соглашаетесь хранить свой пароль в тайне и несете ответственность за любое использование вашей учетной записи и пароля. Мы оставляем за собой право удалить, вернуть или изменить выбранное вами имя пользователя, если мы по нашему собственному усмотрению определим, что такое имя пользователя является неуместным, непристойным или иным образом нежелательным.\n\n5. ЗАПРЕЩЕННАЯ ДЕЯТЕЛЬНОСТЬ\n\nВы не можете получать доступ к Услугам или использовать их для каких-либо целей, кроме тех, для которых мы предоставляем Услуги. Услуги нельзя использовать в связи с какими-либо коммерческими мероприятиями, за исключением тех, которые специально одобрены или одобрены нами.\n\nКак пользователь Сервисов, вы соглашаетесь не:\n–\tСистематически извлекать данные или другой контент из Сервисов для создания или компиляции, прямо или косвенно, коллекции, компиляции, базы данных или каталога без нашего письменного разрешения.\n–\tОбманывать, обманывать или вводить в заблуждение нас и других пользователей, особенно в любых попытках узнать конфиденциальную информацию об учетной записи, такую как пароли пользователей.\n–\tОбходить, отключать или иным образом вмешиваться в функции Услуг, связанные с безопасностью, включая функции, которые предотвращают или ограничивают использование или копирование любого Контента или налагают ограничения на использование Услуг и/или Контента, содержащегося в них.\n–\tПорочить, очернять или иным образом наносить ущерб, по нашему мнению, нам и/или Услугам.\n–\tИспользовать любую информацию, полученную из Сервисов, с целью беспокоить, оскорблять или причинять вред другому лицу.\n–\tНенадлежащим образом использовать наши службы поддержки или отправлять ложные сообщения о злоупотреблениях или неправомерных действиях.\n–\tИспользовать Услуги способом, несовместимым с применимыми законами или правилами.\n–\tУчаствовать в несанкционированном кадрировании или размещении ссылок на Сервисы.\n–\tЗагружать или передавать (или пытаться загружать или передавать) вирусы, троянские кони или другие материалы, включая чрезмерное использование заглавных букв и рассылку спама (непрерывное размещение повторяющегося текста), которые мешают бесперебойному использованию и использованию Услуг любой стороной или модифицирует, ухудшает, нарушает, изменяет или препятствует использованию, возможностям, функциям, работе или обслуживанию Услуг.\n–\tУчаствовать в любом автоматизированном использовании системы, например, использовать скрипты для отправки комментариев или сообщений или использовать какие-либо инструменты для сбора и извлечения данных, роботов или аналогичные инструменты сбора и извлечения данных.\n–\tУдалить уведомление об авторских правах или других правах собственности из любого Контента.\n–\tПопытаться выдать себя за другого пользователя или человека или использовать имя пользователя другого пользователя.\n–\tЗагружать или передавать (или пытаться загружать или передавать) любые материалы, которые действуют как пассивный или активный механизм сбора или передачи информации, включая, помимо прочего, форматы обмена чистой графикой («gif»), пиксели 1×1, веб-жучки, файлы cookie. , или другие подобные устройства (иногда называемые «шпионскими программами», «механизмами пассивного сбора» или «pcms»).\n–\tМешать, нарушать или создавать чрезмерную нагрузку на Сервисы или сети или сервисы, связанные с Сервисами.\n–\tПреследовать, раздражать, запугивать или угрожать любому из наших сотрудников или агентов, участвующих в предоставлении вам какой-либо части Услуг.\n–\tПытаться обойти любые меры Сервисов, предназначенные для предотвращения или ограничения доступа к Сервисам или любой части Сервисов.\n–\tКопировать или адаптировать программное обеспечение Сервисов, включая, помимо прочего, Flash, PHP, HTML, JavaScript или другой код.\n–\tЗа исключением случаев, разрешенных применимым законодательством, расшифровывать, декомпилировать, дизассемблировать или перепроектировать любое программное обеспечение, составляющее или каким-либо образом составляющее часть Услуг.\n–\tЗа исключением случаев, когда это может быть результатом использования стандартной поисковой системы или интернет-браузера, использования, запуска, разработки или распространения любой автоматизированной системы, включая, помимо прочего, любого паука, робота, мошенническую утилиту, парсер или автономный ридер, который получает доступ к Услугам, или использовать или запускать любой несанкционированный скрипт или другое программное обеспечение.\n–\tИспользуйте агента по закупкам или агента по закупкам для совершения покупок в Сервисах.\n–\tЛюбое несанкционированное использование Услуг, включая сбор имен пользователей и/или адресов электронной почты пользователей с помощью электронных или других средств с целью отправки нежелательной электронной почты или создания учетных записей пользователей с помощью автоматических средств или под ложным предлогом.\n–\tИспользовать Услуги в рамках любых усилий по конкуренции с нами или иным образом использовать Услуги и/или Контент для любого коммерческого предприятия или деятельности, приносящей доход.\n–\tПродать или иным образом передать свой профиль.\n–\tИспользовать Сервисы для рекламы или предложения продажи товаров и услуг.\n\n6. ПОЛЬЗОВАТЕЛЬСКИЕ ВКЛАДЫ\n\nСервисы не предлагают пользователям отправлять или публиковать контент. Мы можем предоставить вам возможность создавать, отправлять, публиковать, отображать, передавать, исполнять, публиковать, распространять или транслировать контент и материалы для нас или в Сервисах, включая, помимо прочего, текст, записи, видео, аудио, фотографии. , графика, комментарии, предложения или личная информация или другие материалы (совместно именуемые «Вклады»). Вклады могут просматриваться другими пользователями Услуг и через сторонние веб-сайты. Таким образом, любые материалы, которые вы передаете, могут рассматриваться в соответствии с Политикой конфиденциальности Сервисов. Когда вы создаете или делаете доступными какие-либо Вклады, вы тем самым заявляете и гарантируете, что:\n–\tСоздание, распространение, передача, публичный показ или исполнение, а также доступ, загрузка или копирование ваших Вкладов не нарушают и не будут нарушать права собственности, включая, помимо прочего, авторские права, патенты, товарные знаки, коммерческую тайну или неимущественные права любой третьей стороны.\n–\tВы являетесь создателем и владельцем или имеете необходимые лицензии, права, согласия, разрешения и разрешения на использование и разрешение нам, Сервисам и другим пользователям Сервисов использовать ваши Вклады любым способом, предусмотренным Сервисами и настоящими Условиями. Юридические термины.\n–\tУ вас есть письменное согласие, освобождение и/или разрешение каждого и каждого идентифицируемого физического лица в ваших Вкладах на использование имени или изображения каждого такого идентифицируемого физического лица для включения и использования ваших Вкладов любым способом, предусмотренным Услуги и настоящие Юридические условия.\n–\tВаши вклады не являются ложными, неточными или вводящими в заблуждение.\n–\tВаши Вклады не являются нежелательной или несанкционированной рекламой, рекламными материалами, пирамидами, письмами счастья, спамом, массовыми рассылками или другими формами навязывания.\n–\tВаши Вклады не являются непристойными, непристойными, похотливыми, грязными, насильственными, оскорбительными, клеветническими, клеветническими или иным образом нежелательными (как определено нами).\n–\tВаши материалы не высмеивают, не издеваются, не унижают, не запугивают и не оскорбляют кого-либо.\n–\tВаши Вклады не используются для беспокойства или угроз (в юридическом смысле этих терминов) любому другому лицу, а также для пропаганды насилия в отношении определенного лица или класса людей.\n–\tВаши Вклады не нарушают какие-либо применимые законы, постановления или правила.\n–\tВаши Вклады не нарушают права на неприкосновенность частной жизни или публичность какой-либо третьей стороны.\n–\tВаши Вклады не нарушают какой-либо применимый закон о детской порнографии или иным образом предназначены для защиты здоровья или благополучия несовершеннолетних.\n–\tВаши материалы не содержат оскорбительных комментариев, связанных с расой, национальным происхождением, полом, сексуальными предпочтениями или физическими недостатками.\n–\tВаши Вклады не нарушают иным образом и не содержат ссылок на материалы, которые нарушают какие-либо положения настоящих Юридических условий или любых применимых законов или нормативных актов.\nЛюбое использование Услуг в нарушение вышеизложенного нарушает настоящие Юридические условия и может привести, среди прочего, к прекращению или приостановлению ваших прав на использование Услуг.\n\n7. ЛИЦЕНЗИЯ НА ВКЛАД\n\nВы и Сервисы соглашаетесь с тем, что мы можем получать доступ, хранить, обрабатывать и использовать любую информацию и личные данные, которые вы предоставляете, в соответствии с условиями Политики конфиденциальности и вашим выбором (включая настройки).\n\nОтправляя предложения или другие отзывы об Услугах, вы соглашаетесь с тем, что мы можем использовать и делиться такими отзывами в любых целях без компенсации вам.\n\nМы не заявляем о праве собственности на ваши вклады. Вы сохраняете полное право собственности на все свои Вклады и любые права интеллектуальной собственности или другие права собственности, связанные с вашими Вкладами. Мы не несем ответственности за любые заявления или представления в ваших Вкладах, предоставленных вами в любой области Услуг. Вы несете единоличную ответственность за свои Вклады в Услуги и прямо соглашаетесь освободить нас от любой ответственности и воздерживаться от любых юридических действий против нас в отношении ваших Вкладов.\n\n8. ЛИЦЕНЗИЯ НА МОБИЛЬНОЕ ПРИЛОЖЕНИЕ\n\nИспользовать лицензию\n\nЕсли вы получаете доступ к Услугам через Приложение, мы предоставляем вам отзывное, неисключительное, непередаваемое, ограниченное право на установку и использование Приложения на беспроводных электронных устройствах, принадлежащих вам или контролируемых вами, а также на доступ и использование Приложения на таких устройств строго в соответствии с условиями настоящей лицензии на мобильное приложение, содержащейся в настоящих Юридических условиях. Вы не должны: (1) за исключением случаев, разрешенных применимым законодательством, декомпилировать, реконструировать, дизассемблировать, пытаться получить исходный код или расшифровать Приложение; (2) выполнять какие-либо модификации, адаптации, улучшения, усовершенствования, переводы или производные работы на основе Приложения; (3) нарушать любые применимые законы, правила или положения в связи с вашим доступом к Приложению или его использованием; (4) удалить, изменить, или скрывать любое уведомление о праве собственности (включая любое уведомление об авторских правах или товарных знаках), размещенное нами или лицензиарами Приложения; (5) использовать Приложение для получения дохода, коммерческого предприятия или других целей, для которых оно не предназначено и не предназначено; (6) сделать Приложение доступным через сеть или другую среду, разрешающую доступ или использование несколькими устройствами или пользователями одновременно; (7) использовать Приложение для создания продукта, услуги или программного обеспечения, которое прямо или косвенно конкурирует с Приложением или каким-либо образом заменяет его; (8) использовать Приложение для отправки автоматических запросов на любой веб-сайт или для отправки любой нежелательной коммерческой электронной почты; или (9) использовать любую конфиденциальную информацию или любой из наших интерфейсов или другую нашу интеллектуальную собственность при проектировании, разработке, производстве, лицензировании или распространении любых приложений, аксессуаров,\n\nУстройства Apple и Android\n\nСледующие условия применяются, когда вы используете Приложение, полученное из Apple Store или Google Play (каждый из которых является «Распространителем приложений»), для доступа к Услугам: (1) лицензия, предоставленная вам для нашего Приложения, ограничена непередаваемой лицензией. использовать приложение на устройстве, использующем операционные системы Apple iOS или Android, в зависимости от обстоятельств, и в соответствии с правилами использования, изложенными в соответствующих условиях обслуживания распространителя приложений; (2) мы несем ответственность за предоставление любых услуг по обслуживанию и поддержке в отношении Приложения, как указано в положениях и условиях этой лицензии на мобильное приложение, содержащихся в настоящих Юридических условиях, или в соответствии с иными требованиями применимого законодательства, и вы признаете, что каждый Дистрибьютор приложений не имеет никаких обязательств по предоставлению каких-либо услуг по обслуживанию и поддержке в отношении Приложения; (3) в случае любого несоответствия Приложения какой-либо применимой гарантии вы можете уведомить об этом соответствующего Распространителя Приложения, и Распространитель Приложения, в соответствии со своими условиями и политиками, может возместить уплаченную цену покупки, если таковая имеется. для Приложения и в максимальной степени, разрешенной применимым законодательством, у Дистрибьютора Приложения не будет никаких других гарантийных обязательств в отношении Приложения; (4) вы заявляете и гарантируете, что (i) вы не находитесь в стране, на которую распространяется эмбарго правительства США, или которая была определена правительством США как страна, «поддерживающая террористов», и (ii) вы не внесены в любой список запрещенных или ограниченных сторон правительства США; (5) вы должны соблюдать применимые условия сторонних соглашений при использовании Приложения, например, если у вас есть приложение VoIP, тогда вы не должны нарушать их соглашение о предоставлении услуг беспроводной передачи данных при использовании Приложения; и (6) вы признаете и соглашаетесь с тем, что Дистрибьюторы приложений являются сторонними бенефициарами положений и условий этой лицензии на мобильное приложение, содержащихся в настоящих Юридических условиях, и что каждый Дистрибьютор приложений будет иметь право (и будет считаться, что принял право) применять положения и условия этой лицензии на мобильное приложение, содержащиеся в настоящих Юридических условиях, против вас как стороннего бенефициара.\n\n9. УПРАВЛЕНИЕ УСЛУГАМИ\n\nМы оставляем за собой право, но не обязательство: (1) контролировать Сервисы на предмет нарушений настоящих Юридических условий; (2) принять соответствующие юридические меры против любого, кто по нашему собственному усмотрению нарушает закон или настоящие Юридические условия, включая, помимо прочего, сообщение о таком пользователе в правоохранительные органы; (3) по нашему собственному усмотрению и без ограничений отказывать, ограничивать доступ, ограничивать доступность или отключать (насколько это технологически возможно) любые ваши Вклады или любую их часть; (4) по нашему собственному усмотрению и без ограничений, уведомления или ответственности удалить из Сервисов или иным образом отключить все файлы и контент, которые имеют чрезмерный размер или каким-либо образом обременяют наши системы;\n\n10. ПОЛИТИКА КОНФИДЕНЦИАЛЬНОСТИ\n\nМы заботимся о конфиденциальности и безопасности данных. Пожалуйста, ознакомьтесь с нашей Политикой конфиденциальности на странице приложения. Используя Услуги, вы соглашаетесь соблюдать нашу Политику конфиденциальности, которая включена в настоящие Юридические условия. Обратите внимание, что Службы размещаются в Турции и России. Если вы получаете доступ к Услугам из любого другого региона мира с законами или другими требованиями, регулирующими сбор, использование или раскрытие персональных данных, которые отличаются от применимых законов в Турции и России, то, продолжая использовать Услуги, вы передаете свои данные в Турцию и Россию, и вы прямо соглашаетесь на передачу и обработку ваших данных в Турцию и Россию.\n\n11. СРОК И ПРЕКРАЩЕНИЕ\n\nНастоящие Юридические условия остаются в полной силе, пока вы пользуетесь Услугами. НЕ ОГРАНИЧИВАЯ ЛЮБЫХ ДРУГИХ ПОЛОЖЕНИЙ НАСТОЯЩИХ ЮРИДИЧЕСКИХ УСЛОВИЙ, МЫ ОСТАВЛЯЕМ ЗА СОБОЙ ПРАВО ПО НАШЕМУ УСМОТРЕНИЮ И БЕЗ УВЕДОМЛЕНИЯ ИЛИ ОТВЕТСТВЕННОСТИ ОТКАЗАТЬ В ДОСТУПЕ К УСЛУГАМ И ИСПОЛЬЗОВАНИИ ИХ (ВКЛЮЧАЯ БЛОКИРОВКУ ОПРЕДЕЛЕННЫХ IP-АДРЕСОВ) ЛЮБОМУ ЛИЦУ ПО ЛЮБОЙ ПРИЧИНЕ ИЛИ ДЛЯ БЕЗ ПРИЧИН, ВКЛЮЧАЯ, ПОМИМО ПРОЧЕГО, НАРУШЕНИЕ КАКИХ-ЛИБО ЗАЯВЛЕНИЙ, ГАРАНТИЙ ИЛИ СОГЛАШЕНИЙ, СОДЕРЖАЩИХСЯ В НАСТОЯЩИХ ЮРИДИЧЕСКИХ УСЛОВИЯХ ИЛИ КАКИХ-ЛИБО ПРИМЕНИМЫХ ЗАКОНАХ ИЛИ НОРМАХ. МЫ МОЖЕМ ПРЕКРАТИТЬ ВАШЕ ИСПОЛЬЗОВАНИЕ УСЛУГ ИЛИ УЧАСТИЕ ИЛИ УДАЛИТЬ ВАШУ УЧЕТНУЮ ЗАПИСЬ И ЛЮБОЙ КОНТЕНТ ИЛИ ИНФОРМАЦИЮ, КОТОРУЮ ВЫ РАЗМЕСТИЛИ В ЛЮБОЕ ВРЕМЯ БЕЗ ПРЕДУПРЕЖДЕНИЯ, ПО НАШЕМУ УСМОТРЕНИЮ.\n\nЕсли мы прекращаем или приостанавливаем действие вашей учетной записи по какой-либо причине, вам запрещается регистрировать и создавать новую учетную запись под своим именем, вымышленным или заимствованным именем или именем любого третьего лица, даже если вы можете действовать от имени третьего лица. вечеринка. Помимо закрытия или приостановки действия вашей учетной записи, мы оставляем за собой право предпринять соответствующие юридические действия, в том числе, помимо прочего, добиться возмещения ущерба по гражданским, уголовным и судебным запретам.\n\n12. ИЗМЕНЕНИЯ И ПЕРЕРЫВЫ\n\nМы оставляем за собой право изменять, модифицировать или удалять содержимое Услуг в любое время и по любой причине по нашему собственному усмотрению без предварительного уведомления. Однако мы не обязаны обновлять какую-либо информацию о наших Сервисах. Мы не несем ответственности перед вами или какой-либо третьей стороной за любые модификации, изменение цен, приостановку или прекращение предоставления Услуг.\n\nМы не можем гарантировать, что Услуги будут доступны в любое время. У нас могут возникнуть проблемы с оборудованием, программным обеспечением или другие проблемы или необходимость проведения технического обслуживания, связанного с Услугами, что приводит к перебоям, задержкам или ошибкам. Мы оставляем за собой право изменять, пересматривать, обновлять, приостанавливать, прекращать или иным образом модифицировать Услуги в любое время и по любой причине без предварительного уведомления. Вы соглашаетесь с тем, что мы не несем никакой ответственности за любые убытки, ущерб или неудобства, вызванные вашей невозможностью получить доступ к Услугам или использовать их во время любого простоя или прекращения предоставления Услуг. Ничто в настоящих Юридических условиях не будет истолковано как обязывающее нас поддерживать и поддерживать Услуги или предоставлять какие-либо исправления, обновления или выпуски в связи с ними.\n\n13. ПРИМЕНИМОЕ ЗАКОНОДАТЕЛЬСТВО\n\nНастоящие Юридические условия регулируются и определяются в соответствии с законодательством Турции. YOUREXPORT MANAGER IDARI DANISMANLIK NAKLIYE ITHALAT IHRACAT DIS TICARET VE SANAYI LIMITED SIRKETI и вы безоговорочно соглашаетесь с тем, что суды Турции обладают исключительной юрисдикцией для разрешения любых споров, которые могут возникнуть в связи с настоящими Юридическими условиями.\n\n14. РАЗРЕШЕНИЕ СПОРОВ\n\nНеформальные переговоры\n\nЧтобы ускорить разрешение и контролировать стоимость любого спора, разногласия или претензии, связанной с настоящими Юридическими условиями (каждый из которых именуется «Спор» и вместе — «Споры»), инициированных вами или нами (по отдельности «Сторона» и вместе, «Стороны»), Стороны соглашаются сначала попытаться урегулировать любой Споры (за исключением Споров, прямо указанных ниже) в неофициальном порядке в течение как минимум тридцати (30) дней до начала арбитража. Такие неофициальные переговоры начинаются после письменного уведомления одной Стороны другой Стороны.\n\nОбязательный арбитраж\n\nЛюбой спор, возникающий в связи с настоящими Юридическими условиями или в связи с ними, включая любые вопросы, касающиеся их существования, действительности или прекращения, должен быть передан на рассмотрение и окончательно разрешен Международным коммерческим арбитражным судом при Европейской арбитражной палате (Бельгия, Брюссель, авеню Луиз). , 146) по Регламенту настоящего МКАС, который в результате ссылки на него считается частью настоящего пункта. Количество арбитров должно быть три (3). Местом нахождения, или юридическим местом, или арбитражем является Москва, Россия. Язык разбирательства должен быть английский. Применимым правом настоящих Юридических условий является материальное право России.\n\nОграничения\n\nСтороны соглашаются, что любой арбитраж должен быть ограничен спором между Сторонами в индивидуальном порядке. В полной мере, разрешенной законом, (a) арбитражное разбирательство не может быть объединено с каким-либо другим разбирательством; (b) нет права или полномочий для арбитражного разбирательства любого Спора на основе группового иска или использования процедур группового иска; и (c) нет никаких прав или полномочий для возбуждения любого Спора в предполагаемом представительном качестве от имени широкой общественности или любых других лиц.\n\nИсключения для неофициальных переговоров и арбитража\n\nСтороны соглашаются, что следующие Споры не подпадают под действие вышеуказанных положений, касающихся неформальных переговоров, обязательных для арбитража: (a) любые Споры, направленные на обеспечение соблюдения или защиту или относительно действительности любых прав интеллектуальной собственности Стороны; (b) любые Споры, связанные с утверждениями о краже, пиратстве, вторжении в частную жизнь или несанкционированном использовании или возникающие в связи с ними; и (c) любой иск о судебном запрете. Если это положение будет признано незаконным или не имеющим исковой силы, то ни одна из Сторон не выберет для арбитражного разбирательства какой-либо спор, подпадающий под действие той части этого положения, которая будет признана незаконной или неисполнимой, и такой спор будет решаться судом компетентной юрисдикции в рамках судов, перечисленных для юрисдикции, указанной выше, и Стороны соглашаются подчиняться персональной юрисдикции этого суда.\n\n15. ПОПРАВКИ\n\nИнформация об Услугах может содержать типографские ошибки, неточности или упущения, включая описания, цены, доступность и различную другую информацию. Мы оставляем за собой право исправлять любые ошибки, неточности или упущения, а также изменять или обновлять информацию об Услугах в любое время без предварительного уведомления.\n\n16. ОТКАЗ ОТ ОТВЕТСТВЕННОСТИ\n\nУСЛУГИ ПРЕДОСТАВЛЯЮТСЯ НА УСЛОВИЯХ «КАК ЕСТЬ» И «ПО МЕРЕ ДОСТУПНОСТИ». ВЫ СОГЛАШАЕТЕСЬ С ТЕМ, ЧТО ВЫ ИСПОЛЬЗУЕТЕ УСЛУГИ НА СВОЙ РИСК. В МАКСИМАЛЬНОЙ СТЕПЕНИ, РАЗРЕШЕННОЙ ЗАКОНОМ, МЫ ОТКАЗЫВАЕМСЯ ОТ ВСЕХ ГАРАНТИЙ, ЯВНЫХ ИЛИ ПОДРАЗУМЕВАЕМЫХ, В СВЯЗИ С УСЛУГАМИ И ВАШИМ ИСПОЛЬЗОВАНИЕМ, ВКЛЮЧАЯ, ПОМИМО ПРОЧЕГО, ПОДРАЗУМЕВАЕМЫЕ ГАРАНТИИ КОММЕРЧЕСКОЙ ПРИГОДНОСТИ, ПРИГОДНОСТИ ДЛЯ ОПРЕДЕЛЕННОЙ ЦЕЛИ И НЕНАРУШЕНИЯ ПРАВ. МЫ НЕ ДАЕМ НИКАКИХ ГАРАНТИЙ ИЛИ ЗАЯВЛЕНИЙ В ОТНОШЕНИИ ТОЧНОСТИ ИЛИ ПОЛНОТЫ СОДЕРЖИМОГО УСЛУГ ИЛИ СОДЕРЖИМОГО ЛЮБЫХ ВЕБ-САЙТОВ ИЛИ МОБИЛЬНЫХ ПРИЛОЖЕНИЙ, СВЯЗАННЫХ С УСЛУГАМИ, И МЫ НЕ ПРИНИМАЕМ НИКАКОЙ ОТВЕТСТВЕННОСТИ ЗА ЛЮБЫЕ (1) ОШИБКИ, ОШИБКИ ИЛИ НЕТОЧНОСТЬ АКЦИИ СОДЕРЖАНИЯ И МАТЕРИАЛОВ, (2) ЛИЧНЫХ ТРАВМ ИЛИ УЩЕРБА ИМУЩЕСТВА ЛЮБОГО ПРИРОДА В РЕЗУЛЬТАТЕ ВАШЕГО ДОСТУПА К УСЛУГАМ И ИСПОЛЬЗОВАНИЯ УСЛУГ, (3) ЛЮБОЙ НЕСАНКЦИОНИРОВАННЫЙ ДОСТУП ИЛИ ИСПОЛЬЗОВАНИЕ НАШИХ ЗАЩИЩЕННЫХ СЕРВЕРОВ И/ИЛИ ЛЮБОЙ И ВСЕЙ ЛИЧНОЙ ИНФОРМАЦИИ И/ИЛИ ФИНАНСОВОЙ ИНФОРМАЦИИ, ХРАНЯЩЕЙСЯ НА НИХ, (4) ЛЮБОЕ ПРЕРЫВАНИЕ ИЛИ ПРЕРЫВАНИЕ ПЕРЕДАЧИ В УСЛУГИ ИЛИ ИЗ СЛУЖБ, (5) ЛЮБЫЕ ОШИБКИ, ВИРУСЫ, ТРОЯНСКИЕ КОНИ И Т.П., КОТОРЫЕ МОГУТ ПЕРЕДАВАТЬСЯ ЛЮБОЙ ТРЕТЬЕЙ СТОРОНОЙ ИЛИ ЧЕРЕЗ СЛУЖБЫ, И/ИЛИ (6) КАКИЕ-ЛИБО ОШИБКИ ИЛИ УПУЩЕНИЯ В ЛЮБОМ СОДЕРЖИМОМ И МАТЕРИАЛАХ, ИЛИ ЗА ЛЮБЫЕ ПОТЕРИ ИЛИ УЩЕРБ ЛЮБОГО РОДА, ПОНЕСЕННЫЕ В РЕЗУЛЬТАТЕ ОБ ИСПОЛЬЗОВАНИИ ЛЮБОГО КОНТЕНТА, РАЗМЕЩЕННОГО, ПЕРЕДАВАЕМОГО ИЛИ ИНЫМ ОБРАЗОМ ДОСТУПНЫМ ЧЕРЕЗ СЛУЖБЫ. МЫ НЕ ГАРАНТИРУЕМ, НЕ ПОДТВЕРЖДАЕМ, НЕ ГАРАНТИРУЕМ И НЕ ПРИНИМАЕМ ОТВЕТСТВЕННОСТЬ ЗА ЛЮБОЙ ПРОДУКТ ИЛИ УСЛУГУ, РЕКЛАМИРУЕМУЮ ИЛИ ПРЕДЛАГАЕМУЮ ТРЕТЬЕЙ СТОРОНОЙ ЧЕРЕЗ УСЛУГИ, ЛЮБОЙ ВЕБ-САЙТ С ГИПЕРССЫЛКАМИ, ИЛИ ЛЮБОЙ ВЕБ-САЙТ ИЛИ МОБИЛЬНОЕ ПРИЛОЖЕНИЕ, ПРЕДСТАВЛЕННОЕ В ЛЮБОМ БАННЕРЕ ИЛИ ДРУГОЙ РЕКЛАМЕ. , И МЫ НЕ БУДЕМ СТОРОНОЙ И КАКИМ-ЛИБО ОБРАЗОМ НЕСЕМ ОТВЕТСТВЕННОСТЬ ЗА МОНИТОРИНГ ЛЮБОЙ СДЕЛКИ МЕЖДУ ВАМИ И ЛЮБЫМИ СТОРОННИМИ ПОСТАВЩИКАМИ ПРОДУКТОВ ИЛИ УСЛУГ. ТАКЖЕ ПРИ ПОКУПКЕ ПРОДУКТА ИЛИ УСЛУГИ ЧЕРЕЗ ЛЮБОЙ НОСИТЕЛЬ ИЛИ В ЛЮБОЙ СРЕДЕ ВЫ ДОЛЖНЫ ИСПОЛЬЗОВАТЬ САМОЕ ЛУЧШЕЕ СУЖДЕНИЕ И ПРОЯВЛЯТЬ ОСТОРОЖНОСТЬ, ГДЕ НЕОБХОДИМО.\n\n17. ОГРАНИЧЕНИЕ ОТВЕТСТВЕННОСТИ\n\nНИ ПРИ КАКИХ ОБСТОЯТЕЛЬСТВАХ МЫ ИЛИ НАШИ ДИРЕКТОРЫ, СОТРУДНИКИ ИЛИ АГЕНТЫ НЕ НЕСУТ ОТВЕТСТВЕННОСТИ ПЕРЕД ВАС ИЛИ ЛЮБОЙ ТРЕТЬЕЙ ЛИЦОЙ ЗА ЛЮБОЙ ПРЯМОЙ, КОСВЕННЫЙ, ПОСЛЕДУЮЩИЙ, ПРИМЕРНЫЙ, СЛУЧАЙНЫЙ, ОСОБЫЙ ИЛИ ШТРАФНЫЕ УБЫТКИ, ВКЛЮЧАЯ УПУЩЕННУЮ ПРИБЫЛЬ, УПУЩЕННЫЙ ДОХОД, ПОТЕРЮ ДАННЫХ, ИЛИ ДРУГИЕ УЩЕРБЫ, ВОЗНИКШИЕ В РЕЗУЛЬТАТЕ ИСПОЛЬЗОВАНИЯ ВАМИ УСЛУГ, ДАЖЕ ЕСЛИ НАМ БЫЛО ИЗВЕСТНО О ВОЗМОЖНОСТИ ТАКИХ УЩЕРБОВ.\n\n18. КОМПЕНСАЦИЯ\n\nВы соглашаетесь защищать, возмещать ущерб и ограждать нас, включая наши дочерние компании, филиалы и всех наших соответствующих должностных лиц, агентов, партнеров и сотрудников, от любых убытков, ущерба, ответственности, претензий или требований, включая разумных адвокатов. сборы и расходы, понесенные любой третьей стороной из-за или в результате: (1) использования Услуг; (2) нарушение настоящих Юридических условий; (3) любое нарушение ваших заявлений и гарантий, изложенных в настоящих Юридических условиях; (4) нарушение вами прав третьих лиц, включая, помимо прочего, права интеллектуальной собственности; или (5) любое явное вредоносное действие по отношению к любому другому пользователю Сервисов, с которым вы подключились через Сервисы. Несмотря на вышеизложенное, мы оставляем за собой право за ваш счет взять на себя исключительную защиту и контроль над любым вопросом, по которому вы должны возместить нам ущерб, и вы соглашаетесь сотрудничать за свой счет с нашей защитой таких претензий. Мы приложим разумные усилия, чтобы уведомить вас о любом таком требовании, действии или судебном разбирательстве, на которое распространяется данное возмещение убытков, как только нам станет известно об этом.\n\n19. ПОЛЬЗОВАТЕЛЬСКИЕ ДАННЫЕ\n\nМы будем хранить определенные данные, которые вы передаете Сервисам с целью управления их работой, а также данные, касающиеся использования вами Сервисов. Хотя мы регулярно выполняем резервное копирование данных, вы несете единоличную ответственность за все данные, которые вы передаете или которые относятся к любой деятельности, которую вы предприняли с использованием Сервисов. Вы соглашаетесь с тем, что мы не несем ответственности перед вами за любую потерю или повреждение любых таких данных, и настоящим вы отказываетесь от любого права предъявлять нам иски, вытекающие из такой потери или повреждения таких данных.\n\n20. ЭЛЕКТРОННЫЕ СООБЩЕНИЯ, СДЕЛКИ И ПОДПИСИ\n\nПосещение Сервисов, отправка нам электронных писем и заполнение онлайн-форм представляют собой электронные сообщения. Вы даете согласие на получение электронных сообщений и соглашаетесь с тем, что все соглашения, уведомления, раскрытия информации и другие сообщения, которые мы предоставляем вам в электронном виде, по электронной почте и в Сервисах, удовлетворяют любым юридическим требованиям, согласно которым такие сообщения должны быть в письменной форме. НАСТОЯЩИМ ВЫ СОГЛАШАЕТЕСЬ НА ИСПОЛЬЗОВАНИЕ ЭЛЕКТРОННЫХ ПОДПИСЕЙ, КОНТРАКТОВ, ПРИКАЗОВ И ДРУГИХ ЗАПИСЕЙ, А ТАКЖЕ НА ЭЛЕКТРОННУЮ ДОСТАВКУ УВЕДОМЛЕНИЙ, ПОЛИТИК И ЗАПИСЕЙ О СДЕЛКАХ, ИНИЦИИРОВАННЫХ ИЛИ ЗАВЕРШЕННЫХ НАМИ ИЛИ ЧЕРЕЗ УСЛУГИ. Настоящим вы отказываетесь от любых прав или требований в соответствии с любыми законами, постановлениями, правилами, постановлениями или другими законами в любой юрисдикции, которые требуют оригинальной подписи или доставки или хранения неэлектронных записей,\n\n21. РАЗНОЕ\n\nНастоящие Юридические условия и любые политики или правила работы, опубликованные нами в Сервисах или в отношении Сервисов, представляют собой полное соглашение и понимание между вами и нами. Наша неспособность реализовать или обеспечить соблюдение какого-либо права или положения настоящих Юридических условий не означает отказ от такого права или положения. Настоящие Юридические условия действуют в максимально возможной степени, разрешенной законом. Мы можем передать любые или все наши права и обязанности другим лицам в любое время. Мы не несем ответственности за любые убытки, ущерб, задержку или бездействие, вызванные любой причиной, находящейся вне нашего разумного контроля. Если какое-либо положение или часть положения настоящих Юридических условий будет признано незаконным, недействительным или не имеющим исковой силы, это положение или часть положения считается отделимым от настоящих Юридических условий и не влияет на действительность и применимость любых остальных положений. Между вами и нами в результате настоящих Юридических условий или использования Услуг не возникает никаких совместных предприятий, партнерских, трудовых или агентских отношений. Вы соглашаетесь с тем, что настоящие Юридические условия не будут истолкованы против нас в силу их составления. Настоящим вы отказываетесь от любых средств защиты, которые могут у вас быть на основании электронной формы настоящих Юридических условий и отсутствия подписи сторон для выполнения этих Юридических условий. Вы соглашаетесь с тем, что настоящие Юридические условия не будут истолкованы против нас в силу их составления. Настоящим вы отказываетесь от любых средств защиты, которые могут у вас быть на основании электронной формы настоящих Юридических условий и отсутствия подписи сторон для выполнения этих Юридических условий. Вы соглашаетесь с тем, что настоящие Юридические условия не будут истолкованы против нас в силу их составления. Настоящим вы отказываетесь от любых средств защиты, которые могут у вас быть на основании электронной формы настоящих Юридических условий и отсутствия подписи сторон для выполнения этих Юридических условий.\n\n22. СВЯЖИТЕСЬ С НАМИ\n\nЧтобы разрешить жалобу в отношении Услуг или получить дополнительную информацию об использовании Услуг, свяжитесь с нами по адресу:\n\nYOUREXPORT MANAGER IDARI DANISMANLIK NAKLIYE ITHALAT IHRACAT DIS TICARET VE SANAYI LIMITED SIRKETI\nDOGUYAKA MAH. TERMESSOS BUL. IS MERKEZI BLOK NO: 33 IC KAPI NO: 301                            МУРАТПАША/АНТАЛИЯ/ТУРЦИЯ\nТЕЛЕФОН: +905336200750\nEMAIL: APP@TRADEFRU.COM\n',
      'en':
          'We are YOUREXPORT MANAGER IDARI DANISMANLIK NAKLIYE ITHALAT IHRACAT DIS TICARET VE SANAYI LIMITED SIRKETI (\'Company\', \'we\', \'us\', or \'our\'), a company registered in Turkey at DOGUYAKA MAH. TERMESSOS BUL. IS MERKEZI BLOK NO: 33 IC KAPI NO: 301 MURATPASA/ANTALYA/TURKEY. Our VAT number is 9820905455.\n\nWe operate the mobile application FTC group (the \'App\'), as well as any other related products and services that refer or link to these legal terms (the \'Legal Terms\') (collectively, the \'Services\').\n\nYou can contact us by phone at +905336200750, email at app@tradefru.com, or by mail to at DOGUYAKA MAH. TERMESSOS BUL. IS MERKEZI BLOK NO: 33 IC KAPI NO: 301 MURATPASA/ANTALYA/TURKEY.\n\nThese Legal Terms constitute a legally binding agreement made between you, whether personally or on behalf of an entity (\'you\'), and YOUREXPORT MANAGER IDARI DANISMANLIK NAKLIYE ITHALAT IHRACAT DIS TICARET VE SANAYI LIMITED SIRKETI, concerning your access to and use of the Services. You agree that by accessing the Services, you have read, understood, and agreed to be bound by all of these Legal Terms. IF YOU DO NOT AGREE WITH ALL OF THESE LEGAL TERMS, THEN YOU ARE EXPRESSLY PROHIBITED FROM USING THE SERVICES AND YOU MUST DISCONTINUE USE IMMEDIATELY.\n\nSupplemental terms and conditions or documents that may be posted on the Services from time to time are hereby expressly incorporated herein by reference. We reserve the right, in our sole discretion, to make changes or modifications to these Legal Terms from time to time. We will alert you about any changes by updating the \'Last updated\' date of these Legal Terms, and you waive any right to receive specific notice of each such change. It is your responsibility to periodically review these Legal Terms to stay informed of updates. You will be subject to, and will be deemed to have been made aware of and to have accepted, the changes in any revised Legal Terms by your continued use of the Services after the date such revised Legal Terms are posted.\n\nAll users who are minors in the jurisdiction in which they reside (generally under the age of 18) must have the permission of, and be directly supervised by, their parent or guardian to use the Services. If you are a minor, you must have your parent or guardian read and agree to these Legal Terms prior to you using the Services.\n\nWe recommend that you print a copy of these Legal Terms for your records.\n\n\n1. OUR SERVICES\n\nThe information provided when using the Services is not intended for distribution to or use by any person or entity in any jurisdiction or country where such distribution or use would be contrary to law or regulation or which would subject us to any registration requirement within such jurisdiction or country. Accordingly, those persons who choose to access the Services from other locations do so on their own initiative and are solely responsible for compliance with local laws, if and to the extent local laws are applicable.\n\n2. INTELLECTUAL PROPERTY RIGHTS\n\nOur intellectual property\n\nWe are the owner or the licensee of all intellectual property rights in our Services, including all source code, databases, functionality, software, website designs, audio, video, text, photographs, and graphics in the Services (collectively, the \'Content\'), as well as the trademarks, service marks, and logos contained therein (the \'Marks\').\n\nOur Content and Marks are protected by copyright and trademark laws (and various other intellectual property rights and unfair competition laws) and treaties in the United States and around the world.\n\nThe Content and Marks are provided in or through the Services \'AS IS\' for your personal, non-commercial use or internal business purpose only.\n\nYour use of our Services\n\nSubject to your compliance with these Legal Terms, including the \'PROHIBITED ACTIVITIES\' section below, we grant you a non-exclusive, non-transferable, revocable licence to:\n\taccess the Services\n\tdownload or print a copy of any portion of the Content to which you have properly gained access.\nsolely for your personal, non-commercial use or internal business purpose.\n\nExcept as set out in this section or elsewhere in our Legal Terms, no part of the Services and no Content or Marks may be copied, reproduced, aggregated, republished, uploaded, posted, publicly displayed, encoded, translated, transmitted, distributed, sold, licensed, or otherwise exploited for any commercial purpose whatsoever, without our express prior written permission.\n\nIf you wish to make any use of the Services, Content, or Marks other than as set out in this section or elsewhere in our Legal Terms, please address your request to: app@tradefru.com. If we ever grant you the permission to post, reproduce, or publicly display any part of our Services or Content, you must identify us as the owners or licensors of the Services, Content, or Marks and ensure that any copyright or proprietary notice appears or is visible on posting, reproducing, or displaying our Content.\n\nWe reserve all rights not expressly granted to you in and to the Services, Content, and Marks.\n\nAny breach of these Intellectual Property Rights will constitute a material breach of our Legal Terms and your right to use our Services will terminate immediately.\n\nYour submissions\n\nPlease review this section and the \'PROHIBITED ACTIVITIES\' section carefully prior to using our Services to understand the (a) rights you give us and (b) obligations you have when you post or upload any content through the Services.\n\nSubmissions: By directly sending us any question, comment, suggestion, idea, feedback, or other information about the Services (\'Submissions\'), you agree to assign to us all intellectual property rights in such Submission. You agree that we shall own this Submission and be entitled to its unrestricted use and dissemination for any lawful purpose, commercial or otherwise, without acknowledgment or compensation to you.\n\nYou are responsible for what you post or upload: By sending us Submissions through any part of the Services you:\n\tconfirm that you have read and agree with our \'PROHIBITED ACTIVITIES\' and will not post, send, publish, upload, or transmit through the Services any Submission that is illegal, harassing, hateful, harmful, defamatory, obscene, bullying, abusive, discriminatory, threatening to any person or group, sexually explicit, false, inaccurate, deceitful, or misleading;\n\tto the extent permissible by applicable law, waive any and all moral rights to any such Submission;\n\twarrant that any such Submission are original to you or that you have the necessary rights and licences to submit such Submissions and that you have full authority to grant us the above-mentioned rights in relation to your Submissions; and\n\twarrant and represent that your Submissions do not constitute confidential information.\nYou are solely responsible for your Submissionsand you expressly agree to reimburse us for any and all losses that we may suffer because of your breach of (a) this section, (b) any third party’s intellectual property rights, or (c) applicable law.\n\n3. USER REPRESENTATIONS\n\nBy using the Services, you represent and warrant that: (1) all registration information you submit will be true, accurate, current, and complete; (2) you will maintain the accuracy of such information and promptly update such registration information as necessary; (3) you have the legal capacity and you agree to comply with these Legal Terms; (4) you are not a minor in the jurisdiction in which you reside, or if a minor, you have received parental permission to use the Services; (5) you will not access the Services through automated or non-human means, whether through a bot, script or otherwise; (6) you will not use the Services for any illegal or unauthorised purpose; and (7) your use of the Services will not violate any applicable law or regulation.\n\nIf you provide any information that is untrue, inaccurate, not current, or incomplete, we have the right to suspend or terminate your account and refuse any and all current or future use of the Services (or any portion thereof).\n\n4. USER REGISTRATION\n\nYou may be required to register to use the Services. You agree to keep your password confidential and will be responsible for all use of your account and password. We reserve the right to remove, reclaim, or change a username you select if we determine, in our sole discretion, that such username is inappropriate, obscene, or otherwise objectionable.\n\n5. PROHIBITED ACTIVITIES\n\nYou may not access or use the Services for any purpose other than that for which we make the Services available. The Services may not be used in connection with any commercial endeavoursexcept those that are specifically endorsed or approved by us.\n\nAs a user of the Services, you agree not to:\n\tSystematically retrieve data or other content from the Services to create or compile, directly or indirectly, a collection, compilation, database, or directory without written permission from us.\n\tTrick, defraud, or mislead us and other users, especially in any attempt to learn sensitive account information such as user passwords.\n\tCircumvent, disable, or otherwise interfere with security-related features of the Services, including features that prevent or restrict the use or copying of any Content or enforce limitations on the use of the Services and/or the Content contained therein.\n\tDisparage, tarnish, or otherwise harm, in our opinion, us and/or the Services.\n\tUse any information obtained from the Services in order to harass, abuse, or harm another person.\n\tMake improper use of our support services or submit false reports of abuse or misconduct.\n\tUse the Services in a manner inconsistent with any applicable laws or regulations.\n\tEngage in unauthorised framing of or linking to the Services.\n\tUpload or transmit (or attempt to upload or to transmit) viruses, Trojan horses, or other material, including excessive use of capital letters and spamming (continuous posting of repetitive text), that interferes with any party’s uninterrupted use and enjoyment of the Services or modifies, impairs, disrupts, alters, or interferes with the use, features, functions, operation, or maintenance of the Services.\n\tEngage in any automated use of the system, such as using scripts to send comments or messages, or using any data mining, robots, or similar data gathering and extraction tools.\n\tDelete the copyright or other proprietary rights notice from any Content.\n\tAttempt to impersonate another user or person or use the username of another user.\n\tUpload or transmit (or attempt to upload or to transmit) any material that acts as a passive or active information collection or transmission mechanism, including without limitation, clear graphics interchange formats (\'gifs\'), 1×1 pixels, web bugs, cookies, or other similar devices (sometimes referred to as \'spyware\' or \'passive collection mechanisms\' or \'pcms\').\n\tInterfere with, disrupt, or create an undue burden on the Services or the networks or services connected to the Services.\n\tHarass, annoy, intimidate, or threaten any of our employees or agents engaged in providing any portion of the Services to you.\n\tAttempt to bypass any measures of the Services designed to prevent or restrict access to the Services, or any portion of the Services.\n\tCopy or adapt the Services\' software, including but not limited to Flash, PHP, HTML, JavaScript, or other code.\n\tExcept as permitted by applicable law, decipher, decompile, disassemble, or reverse engineer any of the software comprising or in any way making up a part of the Services.\n\tExcept as may be the result of standard search engine or Internet browser usage, use, launch, develop, or distribute any automated system, including without limitation, any spider, robot, cheat utility, scraper, or offline reader that accesses the Services, or use or launch any unauthorised script or other software.\n\tUse a buying agent or purchasing agent to make purchases on the Services.\n\tMake any unauthorised use of the Services, including collecting usernames and/or email addresses of users by electronic or other means for the purpose of sending unsolicited email, or creating user accounts by automated means or under false pretences.\n\tUse the Services as part of any effort to compete with us or otherwise use the Services and/or the Content for any revenue-generating endeavour or commercial enterprise.\n\tSell or otherwise transfer your profile.\n\tUse the Services to advertise or offer to sell goods and services.\n\n6. USER GENERATED CONTRIBUTIONS\n\nThe Services does not offer users to submit or post content. We may provide you with the opportunity to create, submit, post, display, transmit, perform, publish, distribute, or broadcast content and materials to us or on the Services, including but not limited to text, writings, video, audio, photographs, graphics, comments, suggestions, or personal information or other material (collectively, \'Contributions\'). Contributions may be viewable by other users of the Services and through third-party websites. As such, any Contributions you transmit may be treated in accordance with the Services\' Privacy Policy. When you create or make available any Contributions, you thereby represent and warrant that:\n\tThe creation, distribution, transmission, public display, or performance, and the accessing, downloading, or copying of your Contributions do not and will not infringe the proprietary rights, including but not limited to the copyright, patent, trademark, trade secret, or moral rights of any third party.\n\tYou are the creator and owner of or have the necessary licences, rights, consents, releases, and permissions to use and to authorise us, the Services, and other users of the Services to use your Contributions in any manner contemplated by the Services and these Legal Terms.\n\tYou have the written consent, release, and/or permission of each and every identifiable individual person in your Contributions to use the name or likeness of each and every such identifiable individual person to enable inclusion and use of your Contributions in any manner contemplated by the Services and these Legal Terms.\n\tYour Contributions are not false, inaccurate, or misleading.\n\tYour Contributions are not unsolicited or unauthorised advertising, promotional materials, pyramid schemes, chain letters, spam, mass mailings, or other forms of solicitation.\n\tYour Contributions are not obscene, lewd, lascivious, filthy, violent, harassing, libellous, slanderous, or otherwise objectionable (as determined by us).\n\tYour Contributions do not ridicule, mock, disparage, intimidate, or abuse anyone.\n\tYour Contributions are not used to harass or threaten (in the legal sense of those terms) any other person and to promote violence against a specific person or class of people.\n\tYour Contributions do not violate any applicable law, regulation, or rule.\n\tYour Contributions do not violate the privacy or publicity rights of any third party.\n\tYour Contributions do not violate any applicable law concerning child pornography, or otherwise intended to protect the health or well-being of minors.\n\tYour Contributions do not include any offensive comments that are connected to race, national origin, gender, sexual preference, or physical handicap.\n\tYour Contributions do not otherwise violate, or link to material that violates, any provision of these Legal Terms, or any applicable law or regulation.\nAny use of the Services in violation of the foregoing violates these Legal Terms and may result in, among other things, termination or suspension of your rights to use the Services.\n\n7. CONTRIBUTION LICENCE\n\nYou and Services agree that we may access, store, process, and use any information and personal data that you provide following the terms of the Privacy Policy and your choices (including settings).\n\nBy submitting suggestions or other feedback regarding the Services, you agree that we can use and share such feedback for any purpose without compensation to you.\n\nWe do not assert any ownership over your Contributions. You retain full ownership of all of your Contributions and any intellectual property rights or other proprietary rights associated with your Contributions. We are not liable for any statements or representations in your Contributions provided by you in any area on the Services. You are solely responsible for your Contributions to the Services and you expressly agree to exonerate us from any and all responsibility and to refrain from any legal action against us regarding your Contributions.\n\n8. MOBILE APPLICATION LICENCE\n\nUse Licence\n\nIf you access the Services via the App, then we grant you a revocable, non-exclusive, non-transferable, limited right to install and use the App on wireless electronic devices owned or controlled by you, and to access and use the App on such devices strictly in accordance with the terms and conditions of this mobile application licence contained in these Legal Terms. You shall not: (1) except as permitted by applicable law, decompile, reverse engineer, disassemble, attempt to derive the source code of, or decrypt the App; (2) make any modification, adaptation, improvement, enhancement, translation, or derivative work from the App; (3) violate any applicable laws, rules, or regulations in connection with your access or use of the App; (4) remove, alter, or obscure any proprietary notice (including any notice of copyright or trademark) posted by us or the licensors of the App; (5) use the App for any revenue-generating endeavour, commercial enterprise, or other purpose for which it is not designed or intended; (6) make the App available over a network or other environment permitting access or use by multiple devices or users at the same time; (7) use the App for creating a product, service, or software that is, directly or indirectly, competitive with or in any way a substitute for the App; (8) use the App to send automated queries to any website or to send any unsolicited commercial email; or (9) use any proprietary information or any of our interfaces or our other intellectual property in the design, development, manufacture, licensing, or distribution of any applications, accessories, or devices for use with the App.\n\nApple and Android Devices\n\nThe following terms apply when you use the App obtained from either the Apple Store or Google Play (each an \'App Distributor\') to access the Services: (1) the licence granted to you for our App is limited to a non-transferable licence to use the application on a device that utilises the Apple iOS or Android operating systems, as applicable, and in accordance with the usage rules set forth in the applicable App Distributor’s terms of service; (2) we are responsible for providing any maintenance and support services with respect to the App as specified in the terms and conditions of this mobile application licence contained in these Legal Terms or as otherwise required under applicable law, and you acknowledge that each App Distributor has no obligation whatsoever to furnish any maintenance and support services with respect to the App; (3) in the event of any failure of the App to conform to any applicable warranty, you may notify the applicable App Distributor, and the App Distributor, in accordance with its terms and policies, may refund the purchase price, if any, paid for the App, and to the maximum extent permitted by applicable law, the App Distributor will have no other warranty obligation whatsoever with respect to the App; (4) you represent and warrant that (i) you are not located in a country that is subject to a US government embargo, or that has been designated by the US government as a \'terrorist supporting\' country and (ii) you are not listed on any US government list of prohibited or restricted parties; (5) you must comply with applicable third-party terms of agreement when using the App, e.g. if you have a VoIP application, then you must not be in violation of their wireless data service agreement when using the App; and (6) you acknowledge and agree that the App Distributors are third-party beneficiaries of the terms and conditions in this mobile application licencecontained in these Legal Terms, and that each App Distributor will have the right (and will be deemed to have accepted the right) to enforce the terms and conditions in this mobile application licence contained in these Legal Terms against you as a third-party beneficiary thereof.\n\n9. SERVICES MANAGEMENT\n\nWe reserve the right, but not the obligation, to: (1) monitor the Services for violations of these Legal Terms; (2) take appropriate legal action against anyone who, in our sole discretion, violates the law or these Legal Terms, including without limitation, reporting such user to law enforcement authorities; (3) in our sole discretion and without limitation, refuse, restrict access to, limit the availability of, or disable (to the extent technologically feasible) any of your Contributions or any portion thereof; (4) in our sole discretion and without limitation, notice, or liability, to remove from the Services or otherwise disable all files and content that are excessive in size or are in any way burdensome to our systems; and (5) otherwise manage the Services in a manner designed to protect our rights and property and to facilitate the proper functioning of the Services.\n\n10. PRIVACY POLICY\n\nWe care about data privacy and security. Please review our Privacy Policy in the application page. By using the Services, you agree to be bound by our Privacy Policy, which is incorporated into these Legal Terms. Please be advised the Services are hosted in Turkey and Russia. If you access the Services from any other region of the world with laws or other requirements governing personal data collection, use, or disclosure that differ from applicable laws in Turkey and Russia, then through your continued use of the Services, you are transferring your data to Turkey and Russia, and you expressly consent to have your data transferred to and processed in Turkey and Russia.\n\n11. TERM AND TERMINATION\n\nThese Legal Terms shall remain in full force and effect while you use the Services. WITHOUT LIMITING ANY OTHER PROVISION OF THESE LEGAL TERMS, WE RESERVE THE RIGHT TO, IN OUR SOLE DISCRETION AND WITHOUT NOTICE OR LIABILITY, DENY ACCESS TO AND USE OF THE SERVICES (INCLUDING BLOCKING CERTAIN IP ADDRESSES), TO ANY PERSON FOR ANY REASON OR FOR NO REASON, INCLUDING WITHOUT LIMITATION FOR BREACH OF ANY REPRESENTATION, WARRANTY, OR COVENANT CONTAINED IN THESE LEGAL TERMS OR OF ANY APPLICABLE LAW OR REGULATION. WE MAY TERMINATE YOUR USE OR PARTICIPATION IN THE SERVICES OR DELETE YOUR ACCOUNT AND ANY CONTENT OR INFORMATION THAT YOU POSTED AT ANY TIME, WITHOUT WARNING, IN OUR SOLE DISCRETION.\n\nIf we terminate or suspend your account for any reason, you are prohibited from registering and creating a new account under your name, a fake or borrowed name, or the name of any third party, even if you may be acting on behalf of the third party. In addition to terminating or suspending your account, we reserve the right to take appropriate legal action, including without limitation pursuing civil, criminal, and injunctive redress.\n\n12. MODIFICATIONS AND INTERRUPTIONS\n\nWe reserve the right to change, modify, or remove the contents of the Services at any time or for any reason at our sole discretion without notice. However, we have no obligation to update any information on our Services. We will not be liable to you or any third party for any modification, price change, suspension, or discontinuance of the Services.\n\nWe cannot guarantee the Services will be available at all times. We may experience hardware, software, or other problems or need to perform maintenance related to the Services, resulting in interruptions, delays, or errors. We reserve the right to change, revise, update, suspend, discontinue, or otherwise modify the Services at any time or for any reason without notice to you. You agree that we have no liability whatsoever for any loss, damage, or inconvenience caused by your inability to access or use the Services during any downtime or discontinuance of the Services. Nothing in these Legal Terms will be construed to obligate us to maintain and support the Services or to supply any corrections, updates, or releases in connection therewith.\n\n13. GOVERNING LAW\n\nThese Legal Terms shall be governed by and defined following the laws of Turkey. YOUREXPORT MANAGER IDARI DANISMANLIK NAKLIYE ITHALAT IHRACAT DIS TICARET VE SANAYI LIMITED SIRKETI and yourself irrevocably consent that the courts of Turkey shall have exclusive jurisdiction to resolve any dispute which may arise in connection with these Legal Terms.\n\n14. DISPUTE RESOLUTION\n\nInformal Negotiations\n\nTo expedite resolution and control the cost of any dispute, controversy, or claim related to these Legal Terms (each a \'Dispute\' and collectively, the \'Disputes\') brought by either you or us (individually, a \'Party\' and collectively, the \'Parties\'), the Parties agree to first attempt to negotiate any Dispute (except those Disputes expressly provided below) informally for at least thirty (30) days before initiating arbitration. Such informal negotiations commence upon written notice from one Party to the other Party.\n\nBinding Arbitration\n\nAny dispute arising out of or in connection with these Legal Terms, including any question regarding its existence, validity, or termination, shall be referred to and finally resolved by the International Commercial Arbitration Court under the European Arbitration Chamber (Belgium, Brussels, Avenue Louise, 146) according to the Rules of this ICAC, which, as a result of referring to it, is considered as the part of this clause. The number of arbitrators shall be three (3). The seat, or legal place, or arbitration shall be Moscow, Russia. The language of the proceedings shall be English. The governing law of these Legal Terms shall be substantive law of Russia.\n\nRestrictions\n\nThe Parties agree that any arbitration shall be limited to the Dispute between the Parties individually. To the full extent permitted by law, (a) no arbitration shall be joined with any other proceeding; (b) there is no right or authority for any Dispute to be arbitrated on a class-action basis or to utilise class action procedures; and (c) there is no right or authority for any Dispute to be brought in a purported representative capacity on behalf of the general public or any other persons.\n\nExceptions to Informal Negotiations and Arbitration\n\nThe Parties agree that the following Disputes are not subject to the above provisions concerning informal negotiations binding arbitration: (a) any Disputes seeking to enforce or protect, or concerning the validity of, any of the intellectual property rights of a Party; (b) any Dispute related to, or arising from, allegations of theft, piracy, invasion of privacy, or unauthorised use; and (c) any claim for injunctive relief. If this provision is found to be illegal or unenforceable, then neither Party will elect to arbitrate any Dispute falling within that portion of this provision found to be illegal or unenforceable and such Dispute shall be decided by a court of competent jurisdiction within the courts listed for jurisdiction above, and the Parties agree to submit to the personal jurisdiction of that court.\n\n15. CORRECTIONS\n\nThere may be information on the Services that contains typographical errors, inaccuracies, or omissions, including descriptions, pricing, availability, and various other information. We reserve the right to correct any errors, inaccuracies, or omissions and to change or update the information on the Services at any time, without prior notice.\n\n16. DISCLAIMER\n\nTHE SERVICES ARE PROVIDED ON AN AS-IS AND AS-AVAILABLE BASIS. YOU AGREE THAT YOUR USE OF THE SERVICES WILL BE AT YOUR SOLE RISK. TO THE FULLEST EXTENT PERMITTED BY LAW, WE DISCLAIM ALL WARRANTIES, EXPRESS OR IMPLIED, IN CONNECTION WITH THE SERVICES AND YOUR USE THEREOF, INCLUDING, WITHOUT LIMITATION, THE IMPLIED WARRANTIES OF MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE, AND NON-INFRINGEMENT. WE MAKE NO WARRANTIES OR REPRESENTATIONS ABOUT THE ACCURACY OR COMPLETENESS OF THE SERVICES\' CONTENT OR THE CONTENT OF ANY WEBSITES OR MOBILE APPLICATIONS LINKED TO THE SERVICES AND WE WILL ASSUME NO LIABILITY OR RESPONSIBILITY FOR ANY (1) ERRORS, MISTAKES, OR INACCURACIES OF CONTENT AND MATERIALS, (2) PERSONAL INJURY OR PROPERTY DAMAGE, OF ANY NATURE WHATSOEVER, RESULTING FROM YOUR ACCESS TO AND USE OF THE SERVICES, (3) ANY UNAUTHORISED ACCESS TO OR USE OF OUR SECURE SERVERS AND/OR ANY AND ALL PERSONAL INFORMATION AND/OR FINANCIAL INFORMATION STORED THEREIN, (4) ANY INTERRUPTION OR CESSATION OF TRANSMISSION TO OR FROM THE SERVICES, (5) ANY BUGS, VIRUSES, TROJAN HORSES, OR THE LIKE WHICH MAY BE TRANSMITTED TO OR THROUGH THE SERVICES BY ANY THIRD PARTY, AND/OR (6) ANY ERRORS OR OMISSIONS IN ANY CONTENT AND MATERIALS OR FOR ANY LOSS OR DAMAGE OF ANY KIND INCURRED AS A RESULT OF THE USE OF ANY CONTENT POSTED, TRANSMITTED, OR OTHERWISE MADE AVAILABLE VIA THE SERVICES. WE DO NOT WARRANT, ENDORSE, GUARANTEE, OR ASSUME RESPONSIBILITY FOR ANY PRODUCT OR SERVICE ADVERTISED OR OFFERED BY A THIRD PARTY THROUGH THE SERVICES, ANY HYPERLINKED WEBSITE, OR ANY WEBSITE OR MOBILE APPLICATION FEATURED IN ANY BANNER OR OTHER ADVERTISING, AND WE WILL NOT BE A PARTY TO OR IN ANY WAY BE RESPONSIBLE FOR MONITORING ANY TRANSACTION BETWEEN YOU AND ANY THIRD-PARTY PROVIDERS OF PRODUCTS OR SERVICES. AS WITH THE PURCHASE OF A PRODUCT OR SERVICE THROUGH ANY MEDIUM OR IN ANY ENVIRONMENT, YOU SHOULD USE YOUR BEST JUDGEMENT AND EXERCISE CAUTION WHERE APPROPRIATE.\n\n17. LIMITATIONS OF LIABILITY\n\nIN NO EVENT WILL WE OR OUR DIRECTORS, EMPLOYEES, OR AGENTS BE LIABLE TO YOU OR ANY THIRD PARTY FOR ANY DIRECT, INDIRECT, CONSEQUENTIAL, EXEMPLARY, INCIDENTAL, SPECIAL, OR PUNITIVE DAMAGES, INCLUDING LOST PROFIT, LOST REVENUE, LOSS OF DATA, OR OTHER DAMAGES ARISING FROM YOUR USE OF THE SERVICES, EVEN IF WE HAVE BEEN ADVISED OF THE POSSIBILITY OF SUCH DAMAGES.\n\n18. INDEMNIFICATION\n\nYou agree to defend, indemnify, and hold us harmless, including our subsidiaries, affiliates, and all of our respective officers, agents, partners, and employees, from and against any loss, damage, liability, claim, or demand, including reasonable attorneys’ fees and expenses, made by any third party due to or arising out of: (1) use of the Services; (2) breach of these Legal Terms; (3) any breach of your representations and warranties set forth in these Legal Terms; (4) your violation of the rights of a third party, including but not limited to intellectual property rights; or (5) any overt harmful act toward any other user of the Services with whom you connected via the Services. Notwithstanding the foregoing, we reserve the right, at your expense, to assume the exclusive defence and control of any matter for which you are required to indemnify us, and you agree to cooperate, at your expense, with our defence of such claims. We will use reasonable efforts to notify you of any such claim, action, or proceeding which is subject to this indemnification upon becoming aware of it.\n\n19. USER DATA\n\nWe will maintain certain data that you transmit to the Services for the purpose of managing the performance of the Services, as well as data relating to your use of the Services. Although we perform regular routine backups of data, you are solely responsible for all data that you transmit or that relates to any activity you have undertaken using the Services. You agree that we shall have no liability to you for any loss or corruption of any such data, and you hereby waive any right of action against us arising from any such loss or corruption of such data.\n\n20. ELECTRONIC COMMUNICATIONS, TRANSACTIONS, AND SIGNATURES\n\nVisiting the Services, sending us emails, and completing online forms constitute electronic communications. You consent to receive electronic communications, and you agree that all agreements, notices, disclosures, and other communications we provide to you electronically, via email and on the Services, satisfy any legal requirement that such communication be in writing. YOU HEREBY AGREE TO THE USE OF ELECTRONIC SIGNATURES, CONTRACTS, ORDERS, AND OTHER RECORDS, AND TO ELECTRONIC DELIVERY OF NOTICES, POLICIES, AND RECORDS OF TRANSACTIONS INITIATED OR COMPLETED BY US OR VIA THE SERVICES. You hereby waive any rights or requirements under any statutes, regulations, rules, ordinances, or other laws in any jurisdiction which require an original signature or delivery or retention of non-electronic records, or to payments or the granting of credits by any means other than electronic means.\n\n21. MISCELLANEOUS\n\nThese Legal Terms and any policies or operating rules posted by us on the Services or in respect to the Services constitute the entire agreement and understanding between you and us. Our failure to exercise or enforce any right or provision of these Legal Terms shall not operate as a waiver of such right or provision. These Legal Terms operate to the fullest extent permissible by law. We may assign any or all of our rights and obligations to others at any time. We shall not be responsible or liable for any loss, damage, delay, or failure to act caused by any cause beyond our reasonable control. If any provision or part of a provision of these Legal Terms is determined to be unlawful, void, or unenforceable, that provision or part of the provision is deemed severable from these Legal Terms and does not affect the validity and enforceability of any remaining provisions. There is no joint venture, partnership, employment or agency relationship created between you and us as a result of these Legal Terms or use of the Services. You agree that these Legal Terms will not be construed against us by virtue of having drafted them. You hereby waive any and all defences you may have based on the electronic form of these Legal Terms and the lack of signing by the parties hereto to execute these Legal Terms.\n\n22. CONTACT US\n\nIn order to resolve a complaint regarding the Services or to receive further information regarding use of the Services, please contact us at:\n\nYOUREXPORT MANAGER IDARI DANISMANLIK NAKLIYE ITHALAT IHRACAT DIS TICARET VE SANAYI LIMITED SIRKETI\nDOGUYAKA MAH. TERMESSOS BUL. IS MERKEZI BLOK NO: 33 IC KAPI NO: 301                            MURATPASA/ANTALYA/TURKEY \nPHONE: +905336200750\nEMAIL: APP@TRADEFRU.COM\n',
      'tr':
          'We are YOUREXPORT MANAGER IDARI DANISMANLIK NAKLIYE ITHALAT IHRACAT DIS TICARET VE SANAYI LIMITED SIRKETI (\'Company\', \'we\', \'us\', or \'our\'), a company registered in Turkey at DOGUYAKA MAH. TERMESSOS BUL. IS MERKEZI BLOK NO: 33 IC KAPI NO: 301 MURATPASA/ANTALYA/TURKEY. Our VAT number is 9820905455.\n\nWe operate the mobile application FTC group (the \'App\'), as well as any other related products and services that refer or link to these legal terms (the \'Legal Terms\') (collectively, the \'Services\').\n\nYou can contact us by phone at +905336200750, email at app@tradefru.com, or by mail to at DOGUYAKA MAH. TERMESSOS BUL. IS MERKEZI BLOK NO: 33 IC KAPI NO: 301 MURATPASA/ANTALYA/TURKEY.\n\nThese Legal Terms constitute a legally binding agreement made between you, whether personally or on behalf of an entity (\'you\'), and YOUREXPORT MANAGER IDARI DANISMANLIK NAKLIYE ITHALAT IHRACAT DIS TICARET VE SANAYI LIMITED SIRKETI, concerning your access to and use of the Services. You agree that by accessing the Services, you have read, understood, and agreed to be bound by all of these Legal Terms. IF YOU DO NOT AGREE WITH ALL OF THESE LEGAL TERMS, THEN YOU ARE EXPRESSLY PROHIBITED FROM USING THE SERVICES AND YOU MUST DISCONTINUE USE IMMEDIATELY.\n\nSupplemental terms and conditions or documents that may be posted on the Services from time to time are hereby expressly incorporated herein by reference. We reserve the right, in our sole discretion, to make changes or modifications to these Legal Terms from time to time. We will alert you about any changes by updating the \'Last updated\' date of these Legal Terms, and you waive any right to receive specific notice of each such change. It is your responsibility to periodically review these Legal Terms to stay informed of updates. You will be subject to, and will be deemed to have been made aware of and to have accepted, the changes in any revised Legal Terms by your continued use of the Services after the date such revised Legal Terms are posted.\n\nAll users who are minors in the jurisdiction in which they reside (generally under the age of 18) must have the permission of, and be directly supervised by, their parent or guardian to use the Services. If you are a minor, you must have your parent or guardian read and agree to these Legal Terms prior to you using the Services.\n\nWe recommend that you print a copy of these Legal Terms for your records.\n\n\n1. OUR SERVICES\n\nThe information provided when using the Services is not intended for distribution to or use by any person or entity in any jurisdiction or country where such distribution or use would be contrary to law or regulation or which would subject us to any registration requirement within such jurisdiction or country. Accordingly, those persons who choose to access the Services from other locations do so on their own initiative and are solely responsible for compliance with local laws, if and to the extent local laws are applicable.\n\n2. INTELLECTUAL PROPERTY RIGHTS\n\nOur intellectual property\n\nWe are the owner or the licensee of all intellectual property rights in our Services, including all source code, databases, functionality, software, website designs, audio, video, text, photographs, and graphics in the Services (collectively, the \'Content\'), as well as the trademarks, service marks, and logos contained therein (the \'Marks\').\n\nOur Content and Marks are protected by copyright and trademark laws (and various other intellectual property rights and unfair competition laws) and treaties in the United States and around the world.\n\nThe Content and Marks are provided in or through the Services \'AS IS\' for your personal, non-commercial use or internal business purpose only.\n\nYour use of our Services\n\nSubject to your compliance with these Legal Terms, including the \'PROHIBITED ACTIVITIES\' section below, we grant you a non-exclusive, non-transferable, revocable licence to:\n\taccess the Services\n\tdownload or print a copy of any portion of the Content to which you have properly gained access.\nsolely for your personal, non-commercial use or internal business purpose.\n\nExcept as set out in this section or elsewhere in our Legal Terms, no part of the Services and no Content or Marks may be copied, reproduced, aggregated, republished, uploaded, posted, publicly displayed, encoded, translated, transmitted, distributed, sold, licensed, or otherwise exploited for any commercial purpose whatsoever, without our express prior written permission.\n\nIf you wish to make any use of the Services, Content, or Marks other than as set out in this section or elsewhere in our Legal Terms, please address your request to: app@tradefru.com. If we ever grant you the permission to post, reproduce, or publicly display any part of our Services or Content, you must identify us as the owners or licensors of the Services, Content, or Marks and ensure that any copyright or proprietary notice appears or is visible on posting, reproducing, or displaying our Content.\n\nWe reserve all rights not expressly granted to you in and to the Services, Content, and Marks.\n\nAny breach of these Intellectual Property Rights will constitute a material breach of our Legal Terms and your right to use our Services will terminate immediately.\n\nYour submissions\n\nPlease review this section and the \'PROHIBITED ACTIVITIES\' section carefully prior to using our Services to understand the (a) rights you give us and (b) obligations you have when you post or upload any content through the Services.\n\nSubmissions: By directly sending us any question, comment, suggestion, idea, feedback, or other information about the Services (\'Submissions\'), you agree to assign to us all intellectual property rights in such Submission. You agree that we shall own this Submission and be entitled to its unrestricted use and dissemination for any lawful purpose, commercial or otherwise, without acknowledgment or compensation to you.\n\nYou are responsible for what you post or upload: By sending us Submissions through any part of the Services you:\n\tconfirm that you have read and agree with our \'PROHIBITED ACTIVITIES\' and will not post, send, publish, upload, or transmit through the Services any Submission that is illegal, harassing, hateful, harmful, defamatory, obscene, bullying, abusive, discriminatory, threatening to any person or group, sexually explicit, false, inaccurate, deceitful, or misleading;\n\tto the extent permissible by applicable law, waive any and all moral rights to any such Submission;\n\twarrant that any such Submission are original to you or that you have the necessary rights and licences to submit such Submissions and that you have full authority to grant us the above-mentioned rights in relation to your Submissions; and\n\twarrant and represent that your Submissions do not constitute confidential information.\nYou are solely responsible for your Submissionsand you expressly agree to reimburse us for any and all losses that we may suffer because of your breach of (a) this section, (b) any third party’s intellectual property rights, or (c) applicable law.\n\n3. USER REPRESENTATIONS\n\nBy using the Services, you represent and warrant that: (1) all registration information you submit will be true, accurate, current, and complete; (2) you will maintain the accuracy of such information and promptly update such registration information as necessary; (3) you have the legal capacity and you agree to comply with these Legal Terms; (4) you are not a minor in the jurisdiction in which you reside, or if a minor, you have received parental permission to use the Services; (5) you will not access the Services through automated or non-human means, whether through a bot, script or otherwise; (6) you will not use the Services for any illegal or unauthorised purpose; and (7) your use of the Services will not violate any applicable law or regulation.\n\nIf you provide any information that is untrue, inaccurate, not current, or incomplete, we have the right to suspend or terminate your account and refuse any and all current or future use of the Services (or any portion thereof).\n\n4. USER REGISTRATION\n\nYou may be required to register to use the Services. You agree to keep your password confidential and will be responsible for all use of your account and password. We reserve the right to remove, reclaim, or change a username you select if we determine, in our sole discretion, that such username is inappropriate, obscene, or otherwise objectionable.\n\n5. PROHIBITED ACTIVITIES\n\nYou may not access or use the Services for any purpose other than that for which we make the Services available. The Services may not be used in connection with any commercial endeavoursexcept those that are specifically endorsed or approved by us.\n\nAs a user of the Services, you agree not to:\n\tSystematically retrieve data or other content from the Services to create or compile, directly or indirectly, a collection, compilation, database, or directory without written permission from us.\n\tTrick, defraud, or mislead us and other users, especially in any attempt to learn sensitive account information such as user passwords.\n\tCircumvent, disable, or otherwise interfere with security-related features of the Services, including features that prevent or restrict the use or copying of any Content or enforce limitations on the use of the Services and/or the Content contained therein.\n\tDisparage, tarnish, or otherwise harm, in our opinion, us and/or the Services.\n\tUse any information obtained from the Services in order to harass, abuse, or harm another person.\n\tMake improper use of our support services or submit false reports of abuse or misconduct.\n\tUse the Services in a manner inconsistent with any applicable laws or regulations.\n\tEngage in unauthorised framing of or linking to the Services.\n\tUpload or transmit (or attempt to upload or to transmit) viruses, Trojan horses, or other material, including excessive use of capital letters and spamming (continuous posting of repetitive text), that interferes with any party’s uninterrupted use and enjoyment of the Services or modifies, impairs, disrupts, alters, or interferes with the use, features, functions, operation, or maintenance of the Services.\n\tEngage in any automated use of the system, such as using scripts to send comments or messages, or using any data mining, robots, or similar data gathering and extraction tools.\n\tDelete the copyright or other proprietary rights notice from any Content.\n\tAttempt to impersonate another user or person or use the username of another user.\n\tUpload or transmit (or attempt to upload or to transmit) any material that acts as a passive or active information collection or transmission mechanism, including without limitation, clear graphics interchange formats (\'gifs\'), 1×1 pixels, web bugs, cookies, or other similar devices (sometimes referred to as \'spyware\' or \'passive collection mechanisms\' or \'pcms\').\n\tInterfere with, disrupt, or create an undue burden on the Services or the networks or services connected to the Services.\n\tHarass, annoy, intimidate, or threaten any of our employees or agents engaged in providing any portion of the Services to you.\n\tAttempt to bypass any measures of the Services designed to prevent or restrict access to the Services, or any portion of the Services.\n\tCopy or adapt the Services\' software, including but not limited to Flash, PHP, HTML, JavaScript, or other code.\n\tExcept as permitted by applicable law, decipher, decompile, disassemble, or reverse engineer any of the software comprising or in any way making up a part of the Services.\n\tExcept as may be the result of standard search engine or Internet browser usage, use, launch, develop, or distribute any automated system, including without limitation, any spider, robot, cheat utility, scraper, or offline reader that accesses the Services, or use or launch any unauthorised script or other software.\n\tUse a buying agent or purchasing agent to make purchases on the Services.\n\tMake any unauthorised use of the Services, including collecting usernames and/or email addresses of users by electronic or other means for the purpose of sending unsolicited email, or creating user accounts by automated means or under false pretences.\n\tUse the Services as part of any effort to compete with us or otherwise use the Services and/or the Content for any revenue-generating endeavour or commercial enterprise.\n\tSell or otherwise transfer your profile.\n\tUse the Services to advertise or offer to sell goods and services.\n\n6. USER GENERATED CONTRIBUTIONS\n\nThe Services does not offer users to submit or post content. We may provide you with the opportunity to create, submit, post, display, transmit, perform, publish, distribute, or broadcast content and materials to us or on the Services, including but not limited to text, writings, video, audio, photographs, graphics, comments, suggestions, or personal information or other material (collectively, \'Contributions\'). Contributions may be viewable by other users of the Services and through third-party websites. As such, any Contributions you transmit may be treated in accordance with the Services\' Privacy Policy. When you create or make available any Contributions, you thereby represent and warrant that:\n\tThe creation, distribution, transmission, public display, or performance, and the accessing, downloading, or copying of your Contributions do not and will not infringe the proprietary rights, including but not limited to the copyright, patent, trademark, trade secret, or moral rights of any third party.\n\tYou are the creator and owner of or have the necessary licences, rights, consents, releases, and permissions to use and to authorise us, the Services, and other users of the Services to use your Contributions in any manner contemplated by the Services and these Legal Terms.\n\tYou have the written consent, release, and/or permission of each and every identifiable individual person in your Contributions to use the name or likeness of each and every such identifiable individual person to enable inclusion and use of your Contributions in any manner contemplated by the Services and these Legal Terms.\n\tYour Contributions are not false, inaccurate, or misleading.\n\tYour Contributions are not unsolicited or unauthorised advertising, promotional materials, pyramid schemes, chain letters, spam, mass mailings, or other forms of solicitation.\n\tYour Contributions are not obscene, lewd, lascivious, filthy, violent, harassing, libellous, slanderous, or otherwise objectionable (as determined by us).\n\tYour Contributions do not ridicule, mock, disparage, intimidate, or abuse anyone.\n\tYour Contributions are not used to harass or threaten (in the legal sense of those terms) any other person and to promote violence against a specific person or class of people.\n\tYour Contributions do not violate any applicable law, regulation, or rule.\n\tYour Contributions do not violate the privacy or publicity rights of any third party.\n\tYour Contributions do not violate any applicable law concerning child pornography, or otherwise intended to protect the health or well-being of minors.\n\tYour Contributions do not include any offensive comments that are connected to race, national origin, gender, sexual preference, or physical handicap.\n\tYour Contributions do not otherwise violate, or link to material that violates, any provision of these Legal Terms, or any applicable law or regulation.\nAny use of the Services in violation of the foregoing violates these Legal Terms and may result in, among other things, termination or suspension of your rights to use the Services.\n\n7. CONTRIBUTION LICENCE\n\nYou and Services agree that we may access, store, process, and use any information and personal data that you provide following the terms of the Privacy Policy and your choices (including settings).\n\nBy submitting suggestions or other feedback regarding the Services, you agree that we can use and share such feedback for any purpose without compensation to you.\n\nWe do not assert any ownership over your Contributions. You retain full ownership of all of your Contributions and any intellectual property rights or other proprietary rights associated with your Contributions. We are not liable for any statements or representations in your Contributions provided by you in any area on the Services. You are solely responsible for your Contributions to the Services and you expressly agree to exonerate us from any and all responsibility and to refrain from any legal action against us regarding your Contributions.\n\n8. MOBILE APPLICATION LICENCE\n\nUse Licence\n\nIf you access the Services via the App, then we grant you a revocable, non-exclusive, non-transferable, limited right to install and use the App on wireless electronic devices owned or controlled by you, and to access and use the App on such devices strictly in accordance with the terms and conditions of this mobile application licence contained in these Legal Terms. You shall not: (1) except as permitted by applicable law, decompile, reverse engineer, disassemble, attempt to derive the source code of, or decrypt the App; (2) make any modification, adaptation, improvement, enhancement, translation, or derivative work from the App; (3) violate any applicable laws, rules, or regulations in connection with your access or use of the App; (4) remove, alter, or obscure any proprietary notice (including any notice of copyright or trademark) posted by us or the licensors of the App; (5) use the App for any revenue-generating endeavour, commercial enterprise, or other purpose for which it is not designed or intended; (6) make the App available over a network or other environment permitting access or use by multiple devices or users at the same time; (7) use the App for creating a product, service, or software that is, directly or indirectly, competitive with or in any way a substitute for the App; (8) use the App to send automated queries to any website or to send any unsolicited commercial email; or (9) use any proprietary information or any of our interfaces or our other intellectual property in the design, development, manufacture, licensing, or distribution of any applications, accessories, or devices for use with the App.\n\nApple and Android Devices\n\nThe following terms apply when you use the App obtained from either the Apple Store or Google Play (each an \'App Distributor\') to access the Services: (1) the licence granted to you for our App is limited to a non-transferable licence to use the application on a device that utilises the Apple iOS or Android operating systems, as applicable, and in accordance with the usage rules set forth in the applicable App Distributor’s terms of service; (2) we are responsible for providing any maintenance and support services with respect to the App as specified in the terms and conditions of this mobile application licence contained in these Legal Terms or as otherwise required under applicable law, and you acknowledge that each App Distributor has no obligation whatsoever to furnish any maintenance and support services with respect to the App; (3) in the event of any failure of the App to conform to any applicable warranty, you may notify the applicable App Distributor, and the App Distributor, in accordance with its terms and policies, may refund the purchase price, if any, paid for the App, and to the maximum extent permitted by applicable law, the App Distributor will have no other warranty obligation whatsoever with respect to the App; (4) you represent and warrant that (i) you are not located in a country that is subject to a US government embargo, or that has been designated by the US government as a \'terrorist supporting\' country and (ii) you are not listed on any US government list of prohibited or restricted parties; (5) you must comply with applicable third-party terms of agreement when using the App, e.g. if you have a VoIP application, then you must not be in violation of their wireless data service agreement when using the App; and (6) you acknowledge and agree that the App Distributors are third-party beneficiaries of the terms and conditions in this mobile application licencecontained in these Legal Terms, and that each App Distributor will have the right (and will be deemed to have accepted the right) to enforce the terms and conditions in this mobile application licence contained in these Legal Terms against you as a third-party beneficiary thereof.\n\n9. SERVICES MANAGEMENT\n\nWe reserve the right, but not the obligation, to: (1) monitor the Services for violations of these Legal Terms; (2) take appropriate legal action against anyone who, in our sole discretion, violates the law or these Legal Terms, including without limitation, reporting such user to law enforcement authorities; (3) in our sole discretion and without limitation, refuse, restrict access to, limit the availability of, or disable (to the extent technologically feasible) any of your Contributions or any portion thereof; (4) in our sole discretion and without limitation, notice, or liability, to remove from the Services or otherwise disable all files and content that are excessive in size or are in any way burdensome to our systems; and (5) otherwise manage the Services in a manner designed to protect our rights and property and to facilitate the proper functioning of the Services.\n\n10. PRIVACY POLICY\n\nWe care about data privacy and security. Please review our Privacy Policy in the application page. By using the Services, you agree to be bound by our Privacy Policy, which is incorporated into these Legal Terms. Please be advised the Services are hosted in Turkey and Russia. If you access the Services from any other region of the world with laws or other requirements governing personal data collection, use, or disclosure that differ from applicable laws in Turkey and Russia, then through your continued use of the Services, you are transferring your data to Turkey and Russia, and you expressly consent to have your data transferred to and processed in Turkey and Russia.\n\n11. TERM AND TERMINATION\n\nThese Legal Terms shall remain in full force and effect while you use the Services. WITHOUT LIMITING ANY OTHER PROVISION OF THESE LEGAL TERMS, WE RESERVE THE RIGHT TO, IN OUR SOLE DISCRETION AND WITHOUT NOTICE OR LIABILITY, DENY ACCESS TO AND USE OF THE SERVICES (INCLUDING BLOCKING CERTAIN IP ADDRESSES), TO ANY PERSON FOR ANY REASON OR FOR NO REASON, INCLUDING WITHOUT LIMITATION FOR BREACH OF ANY REPRESENTATION, WARRANTY, OR COVENANT CONTAINED IN THESE LEGAL TERMS OR OF ANY APPLICABLE LAW OR REGULATION. WE MAY TERMINATE YOUR USE OR PARTICIPATION IN THE SERVICES OR DELETE YOUR ACCOUNT AND ANY CONTENT OR INFORMATION THAT YOU POSTED AT ANY TIME, WITHOUT WARNING, IN OUR SOLE DISCRETION.\n\nIf we terminate or suspend your account for any reason, you are prohibited from registering and creating a new account under your name, a fake or borrowed name, or the name of any third party, even if you may be acting on behalf of the third party. In addition to terminating or suspending your account, we reserve the right to take appropriate legal action, including without limitation pursuing civil, criminal, and injunctive redress.\n\n12. MODIFICATIONS AND INTERRUPTIONS\n\nWe reserve the right to change, modify, or remove the contents of the Services at any time or for any reason at our sole discretion without notice. However, we have no obligation to update any information on our Services. We will not be liable to you or any third party for any modification, price change, suspension, or discontinuance of the Services.\n\nWe cannot guarantee the Services will be available at all times. We may experience hardware, software, or other problems or need to perform maintenance related to the Services, resulting in interruptions, delays, or errors. We reserve the right to change, revise, update, suspend, discontinue, or otherwise modify the Services at any time or for any reason without notice to you. You agree that we have no liability whatsoever for any loss, damage, or inconvenience caused by your inability to access or use the Services during any downtime or discontinuance of the Services. Nothing in these Legal Terms will be construed to obligate us to maintain and support the Services or to supply any corrections, updates, or releases in connection therewith.\n\n13. GOVERNING LAW\n\nThese Legal Terms shall be governed by and defined following the laws of Turkey. YOUREXPORT MANAGER IDARI DANISMANLIK NAKLIYE ITHALAT IHRACAT DIS TICARET VE SANAYI LIMITED SIRKETI and yourself irrevocably consent that the courts of Turkey shall have exclusive jurisdiction to resolve any dispute which may arise in connection with these Legal Terms.\n\n14. DISPUTE RESOLUTION\n\nInformal Negotiations\n\nTo expedite resolution and control the cost of any dispute, controversy, or claim related to these Legal Terms (each a \'Dispute\' and collectively, the \'Disputes\') brought by either you or us (individually, a \'Party\' and collectively, the \'Parties\'), the Parties agree to first attempt to negotiate any Dispute (except those Disputes expressly provided below) informally for at least thirty (30) days before initiating arbitration. Such informal negotiations commence upon written notice from one Party to the other Party.\n\nBinding Arbitration\n\nAny dispute arising out of or in connection with these Legal Terms, including any question regarding its existence, validity, or termination, shall be referred to and finally resolved by the International Commercial Arbitration Court under the European Arbitration Chamber (Belgium, Brussels, Avenue Louise, 146) according to the Rules of this ICAC, which, as a result of referring to it, is considered as the part of this clause. The number of arbitrators shall be three (3). The seat, or legal place, or arbitration shall be Moscow, Russia. The language of the proceedings shall be English. The governing law of these Legal Terms shall be substantive law of Russia.\n\nRestrictions\n\nThe Parties agree that any arbitration shall be limited to the Dispute between the Parties individually. To the full extent permitted by law, (a) no arbitration shall be joined with any other proceeding; (b) there is no right or authority for any Dispute to be arbitrated on a class-action basis or to utilise class action procedures; and (c) there is no right or authority for any Dispute to be brought in a purported representative capacity on behalf of the general public or any other persons.\n\nExceptions to Informal Negotiations and Arbitration\n\nThe Parties agree that the following Disputes are not subject to the above provisions concerning informal negotiations binding arbitration: (a) any Disputes seeking to enforce or protect, or concerning the validity of, any of the intellectual property rights of a Party; (b) any Dispute related to, or arising from, allegations of theft, piracy, invasion of privacy, or unauthorised use; and (c) any claim for injunctive relief. If this provision is found to be illegal or unenforceable, then neither Party will elect to arbitrate any Dispute falling within that portion of this provision found to be illegal or unenforceable and such Dispute shall be decided by a court of competent jurisdiction within the courts listed for jurisdiction above, and the Parties agree to submit to the personal jurisdiction of that court.\n\n15. CORRECTIONS\n\nThere may be information on the Services that contains typographical errors, inaccuracies, or omissions, including descriptions, pricing, availability, and various other information. We reserve the right to correct any errors, inaccuracies, or omissions and to change or update the information on the Services at any time, without prior notice.\n\n16. DISCLAIMER\n\nTHE SERVICES ARE PROVIDED ON AN AS-IS AND AS-AVAILABLE BASIS. YOU AGREE THAT YOUR USE OF THE SERVICES WILL BE AT YOUR SOLE RISK. TO THE FULLEST EXTENT PERMITTED BY LAW, WE DISCLAIM ALL WARRANTIES, EXPRESS OR IMPLIED, IN CONNECTION WITH THE SERVICES AND YOUR USE THEREOF, INCLUDING, WITHOUT LIMITATION, THE IMPLIED WARRANTIES OF MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE, AND NON-INFRINGEMENT. WE MAKE NO WARRANTIES OR REPRESENTATIONS ABOUT THE ACCURACY OR COMPLETENESS OF THE SERVICES\' CONTENT OR THE CONTENT OF ANY WEBSITES OR MOBILE APPLICATIONS LINKED TO THE SERVICES AND WE WILL ASSUME NO LIABILITY OR RESPONSIBILITY FOR ANY (1) ERRORS, MISTAKES, OR INACCURACIES OF CONTENT AND MATERIALS, (2) PERSONAL INJURY OR PROPERTY DAMAGE, OF ANY NATURE WHATSOEVER, RESULTING FROM YOUR ACCESS TO AND USE OF THE SERVICES, (3) ANY UNAUTHORISED ACCESS TO OR USE OF OUR SECURE SERVERS AND/OR ANY AND ALL PERSONAL INFORMATION AND/OR FINANCIAL INFORMATION STORED THEREIN, (4) ANY INTERRUPTION OR CESSATION OF TRANSMISSION TO OR FROM THE SERVICES, (5) ANY BUGS, VIRUSES, TROJAN HORSES, OR THE LIKE WHICH MAY BE TRANSMITTED TO OR THROUGH THE SERVICES BY ANY THIRD PARTY, AND/OR (6) ANY ERRORS OR OMISSIONS IN ANY CONTENT AND MATERIALS OR FOR ANY LOSS OR DAMAGE OF ANY KIND INCURRED AS A RESULT OF THE USE OF ANY CONTENT POSTED, TRANSMITTED, OR OTHERWISE MADE AVAILABLE VIA THE SERVICES. WE DO NOT WARRANT, ENDORSE, GUARANTEE, OR ASSUME RESPONSIBILITY FOR ANY PRODUCT OR SERVICE ADVERTISED OR OFFERED BY A THIRD PARTY THROUGH THE SERVICES, ANY HYPERLINKED WEBSITE, OR ANY WEBSITE OR MOBILE APPLICATION FEATURED IN ANY BANNER OR OTHER ADVERTISING, AND WE WILL NOT BE A PARTY TO OR IN ANY WAY BE RESPONSIBLE FOR MONITORING ANY TRANSACTION BETWEEN YOU AND ANY THIRD-PARTY PROVIDERS OF PRODUCTS OR SERVICES. AS WITH THE PURCHASE OF A PRODUCT OR SERVICE THROUGH ANY MEDIUM OR IN ANY ENVIRONMENT, YOU SHOULD USE YOUR BEST JUDGEMENT AND EXERCISE CAUTION WHERE APPROPRIATE.\n\n17. LIMITATIONS OF LIABILITY\n\nIN NO EVENT WILL WE OR OUR DIRECTORS, EMPLOYEES, OR AGENTS BE LIABLE TO YOU OR ANY THIRD PARTY FOR ANY DIRECT, INDIRECT, CONSEQUENTIAL, EXEMPLARY, INCIDENTAL, SPECIAL, OR PUNITIVE DAMAGES, INCLUDING LOST PROFIT, LOST REVENUE, LOSS OF DATA, OR OTHER DAMAGES ARISING FROM YOUR USE OF THE SERVICES, EVEN IF WE HAVE BEEN ADVISED OF THE POSSIBILITY OF SUCH DAMAGES.\n\n18. INDEMNIFICATION\n\nYou agree to defend, indemnify, and hold us harmless, including our subsidiaries, affiliates, and all of our respective officers, agents, partners, and employees, from and against any loss, damage, liability, claim, or demand, including reasonable attorneys’ fees and expenses, made by any third party due to or arising out of: (1) use of the Services; (2) breach of these Legal Terms; (3) any breach of your representations and warranties set forth in these Legal Terms; (4) your violation of the rights of a third party, including but not limited to intellectual property rights; or (5) any overt harmful act toward any other user of the Services with whom you connected via the Services. Notwithstanding the foregoing, we reserve the right, at your expense, to assume the exclusive defence and control of any matter for which you are required to indemnify us, and you agree to cooperate, at your expense, with our defence of such claims. We will use reasonable efforts to notify you of any such claim, action, or proceeding which is subject to this indemnification upon becoming aware of it.\n\n19. USER DATA\n\nWe will maintain certain data that you transmit to the Services for the purpose of managing the performance of the Services, as well as data relating to your use of the Services. Although we perform regular routine backups of data, you are solely responsible for all data that you transmit or that relates to any activity you have undertaken using the Services. You agree that we shall have no liability to you for any loss or corruption of any such data, and you hereby waive any right of action against us arising from any such loss or corruption of such data.\n\n20. ELECTRONIC COMMUNICATIONS, TRANSACTIONS, AND SIGNATURES\n\nVisiting the Services, sending us emails, and completing online forms constitute electronic communications. You consent to receive electronic communications, and you agree that all agreements, notices, disclosures, and other communications we provide to you electronically, via email and on the Services, satisfy any legal requirement that such communication be in writing. YOU HEREBY AGREE TO THE USE OF ELECTRONIC SIGNATURES, CONTRACTS, ORDERS, AND OTHER RECORDS, AND TO ELECTRONIC DELIVERY OF NOTICES, POLICIES, AND RECORDS OF TRANSACTIONS INITIATED OR COMPLETED BY US OR VIA THE SERVICES. You hereby waive any rights or requirements under any statutes, regulations, rules, ordinances, or other laws in any jurisdiction which require an original signature or delivery or retention of non-electronic records, or to payments or the granting of credits by any means other than electronic means.\n\n21. MISCELLANEOUS\n\nThese Legal Terms and any policies or operating rules posted by us on the Services or in respect to the Services constitute the entire agreement and understanding between you and us. Our failure to exercise or enforce any right or provision of these Legal Terms shall not operate as a waiver of such right or provision. These Legal Terms operate to the fullest extent permissible by law. We may assign any or all of our rights and obligations to others at any time. We shall not be responsible or liable for any loss, damage, delay, or failure to act caused by any cause beyond our reasonable control. If any provision or part of a provision of these Legal Terms is determined to be unlawful, void, or unenforceable, that provision or part of the provision is deemed severable from these Legal Terms and does not affect the validity and enforceability of any remaining provisions. There is no joint venture, partnership, employment or agency relationship created between you and us as a result of these Legal Terms or use of the Services. You agree that these Legal Terms will not be construed against us by virtue of having drafted them. You hereby waive any and all defences you may have based on the electronic form of these Legal Terms and the lack of signing by the parties hereto to execute these Legal Terms.\n\n22. CONTACT US\n\nIn order to resolve a complaint regarding the Services or to receive further information regarding use of the Services, please contact us at:\n\nYOUREXPORT MANAGER IDARI DANISMANLIK NAKLIYE ITHALAT IHRACAT DIS TICARET VE SANAYI LIMITED SIRKETI\nDOGUYAKA MAH. TERMESSOS BUL. IS MERKEZI BLOK NO: 33 IC KAPI NO: 301                            MURATPASA/ANTALYA/TURKEY \nPHONE: +905336200750\nEMAIL: APP@TRADEFRU.COM\n',
    },
    'rbosd0il': {
      'ru': 'Home',
      'en': '',
      'tr': '',
    },
  },
  // infoDeveloperPage
  {
    'lj0bl451': {
      'ru': 'О приложении',
      'en': 'About the app',
      'tr': 'uygulama hakkında',
    },
    '7fcea9y9': {
      'ru': 'Сведения о разработчике',
      'en': 'Developer Details',
      'tr': 'Geliştirici Ayrıntıları',
    },
    '1dxtx999': {
      'ru':
          '1. Общие положения\nНастоящая политика обработки персональных данных составлена в соответствии с требованиями Федерального закона от 27.07.2006. №152-ФЗ «О персональных данных» (далее - Закон о персональных данных) и определяет порядок обработки персональных данных и меры по обеспечению безопасности персональных данных, предпринимаемые Погодин Никита Алексеевич (далее – Оператор).1.1. Оператор ставит своей важнейшей целью и условием осуществления своей деятельности соблюдение прав и свобод человека и гражданина при обработке его персональных данных, в том числе защиты прав на неприкосновенность частной жизни, личную и семейную тайну.1.2. Настоящая политика Оператора в отношении обработки персональных данных (далее – Политика) применяется ко всей информации, которую Оператор может получить о посетителях веб-сайта http://tradefru.com/.2. Основные понятия, используемые в Политике2.1. Автоматизированная обработка персональных данных – обработка персональных данных с помощью средств вычислительной техники.',
      'en':
          '1. General Provisions This personal data processing policy has been drawn up in accordance with the requirements of the Federal Law of 27.07.2006. No. 152-FZ “On Personal Data” (hereinafter referred to as the Law on Personal Data) and determines the procedure for processing personal data and measures to ensure the security of personal data taken by Nikita Alekseevich Pogodin (hereinafter referred to as the Operator). 1.1. The operator sets as its most important goal and condition for the implementation of its activities the observance of the rights and freedoms of a person and a citizen in the processing of his personal data, including the protection of the rights to privacy, personal and family secrets. 1.2. This Operator\'s policy regarding the processing of personal data (hereinafter referred to as the Policy) applies to all information that the Operator can receive about visitors to the website http://tradefru.com/.2. Basic concepts used in the Policy2.1. Automated processing of personal data - processing of personal data using computer technology.',
      'tr':
          '1. Genel Hükümler İşbu kişisel veri işleme politikası, 27.07.2006 tarihli Federal Yasa gereklerine uygun olarak hazırlanmıştır. No. 152-FZ “Kişisel Veriler Üzerine” (bundan sonra Kişisel Veriler Yasası olarak anılacaktır) ve kişisel verilerin işlenmesi prosedürünü ve Nikita Alekseevich Pogodin (bundan sonra Operatör olarak anılacaktır) tarafından alınan kişisel verilerin güvenliğini sağlamak için önlemleri belirler. ) 1.1. Operatör, faaliyetlerinin uygulanması için en önemli hedef ve koşulu, mahremiyet, kişisel ve aile sırları haklarının korunması da dahil olmak üzere kişisel verilerinin işlenmesinde bir kişinin ve bir vatandaşın hak ve özgürlüklerine uyulmasını belirler. 1.2. Bu Operatörün kişisel verilerin işlenmesine ilişkin politikası (bundan böyle Politika olarak anılacaktır), Operatörün http://tradefru.com/.2 web sitesini ziyaret edenler hakkında alabileceği tüm bilgiler için geçerlidir. Policy2.1\'de kullanılan temel kavramlar. Kişisel verilerin otomatik işlenmesi - kişisel verilerin bilgisayar teknolojisi kullanılarak işlenmesi.',
    },
    'pqf9tk3u': {
      'ru': 'Home',
      'en': 'Home',
      'tr': 'Ev',
    },
  },
  // orderStatusSeaArchieve
  {
    '0m5w6l3m': {
      'ru': 'Данные заказа',
      'en': 'Order data',
      'tr': 'Teslimat ayrıntıları',
    },
    'oso5yomk': {
      'ru': 'Статус заказа',
      'en': 'Order status',
      'tr': 'Teslimat durumu',
    },
    '3zqh8y46': {
      'ru': 'Номер партии',
      'en': 'Batch number',
      'tr': 'Parti numarası',
    },
    'pgol51m7': {
      'ru': 'Наименование судна',
      'en': 'Vessel name',
      'tr': 'Gemi adı',
    },
    'b4g2xw5h': {
      'ru': 'Торговая марка',
      'en': 'Trademark',
      'tr': 'TM',
    },
    'p5mdghb7': {
      'ru': 'Наименование товара',
      'en': 'Name of product',
      'tr': 'Ürün adı',
    },
    'jkg7ayyr': {
      'ru': 'Прибытие судна',
      'en': 'Ship arrival',
      'tr': 'Geminin varışı',
    },
    'us4i0by8': {
      'ru': 'Карантин',
      'en': 'Quarantine',
      'tr': 'Karantina kontrol',
    },
    'mn433dy1': {
      'ru': 'Пропечатка',
      'en': 'Proprint',
      'tr': 'Karantina izni',
    },
    'iubpjn6k': {
      'ru': 'Подача декларации',
      'en': 'Filing a declaration',
      'tr': 'Beyanname açılışı',
    },
    '87g5dics': {
      'ru': 'Выпуск декларации',
      'en': 'Release of the declaration',
      'tr': 'Beyanname kapanışı',
    },
    'xau8fpsl': {
      'ru': 'Отъезд к клиенту',
      'en': 'Departure to the client',
      'tr': 'Müşteriye gidiş',
    },
    'me7pc3gn': {
      'ru': 'Home',
      'en': 'Home',
      'tr': 'Ev',
    },
  },
  // ConfirmMailValidation
  {
    't9xea5su': {
      'ru': 'Назад',
      'en': 'Back',
      'tr': 'Geri',
    },
    'se1v5lbm': {
      'ru': 'Подтверждение',
      'en': 'Confirmation',
      'tr': 'Onay',
    },
    'mlf1zf9x': {
      'ru': 'Мы отправим вам на почту код подтверждения',
      'en': 'Follow the link in the email to confirm your email. Then sign in',
      'tr': 'E-postayı onaylamak için e-postadaki bağlantıyı takip edin',
    },
    'nh5xm405': {
      'ru': 'Отправить код',
      'en': 'To come in',
      'tr': 'Tekrar gönder',
    },
    'b0m4fo5s': {
      'ru': 'Проверьте папку со спамом, если не получили код',
      'en': 'Check your spam folder if you didn\'t receive the code',
      'tr': 'Kodu almadıysanız spam klasörünü kontrol edin',
    },
    'kit2ic6h': {
      'ru': 'Home',
      'en': 'Home',
      'tr': 'Ev',
    },
  },
  // ConfirmMailValidation1
  {
    'bovnas1c': {
      'ru': 'Назад',
      'en': 'Back',
      'tr': 'Geri',
    },
    '8z845z1f': {
      'ru': 'Вставьте код, который пришел на вашу почту сюда',
      'en': 'Follow the link in the email to confirm your email.',
      'tr': 'E-postayı onaylamak için e-postadaki bağlantıyı takip edin',
    },
    'k5rkhlio': {
      'ru': 'Отправить еще раз',
      'en': 'Send again',
      'tr': 'Tekrar gönderin',
    },
    'nw6enqi9': {
      'ru': 'Проверьте папку со спамом, если не получили код',
      'en': 'Check your spam folder if you didn\'t receive the code',
      'tr': 'Kodu almadıysanız spam klasörünü kontrol edin',
    },
    'seogchzf': {
      'ru': 'Home',
      'en': 'Home',
      'tr': 'Ev',
    },
  },
  // ConfirmMailValidation2
  {
    '9mfrts35': {
      'ru': 'Назад',
      'en': 'Back',
      'tr': 'Geri',
    },
    'gx5o4fci': {
      'ru': 'Успешно',
      'en': 'Successfully',
      'tr': 'Başarıyla',
    },
    'jf7ipckc': {
      'ru': 'Поздравляем! Регистрация завершена',
      'en': 'Congratulations! Registration completed',
      'tr': 'Tebrikler! Kayıt tamamlandı',
    },
    'iia4wh8j': {
      'ru': 'Войти',
      'en': 'To come in',
      'tr': 'Giriş yap',
    },
    's3hlbxq5': {
      'ru': 'Home',
      'en': 'Home',
      'tr': 'Ev',
    },
  },
  // orderStatusSeaArchieveLand
  {
    'es6al3qz': {
      'ru': 'Данные заказа',
      'en': 'Order data',
      'tr': 'Sipariş verisi',
    },
    'd1jxpuxe': {
      'ru': 'Статус заказа',
      'en': 'Order status',
      'tr': 'Sipariş durumu',
    },
    '2zldc66f': {
      'ru': 'Номер партии',
      'en': 'Batch number',
      'tr': 'Parti numarası',
    },
    'x89844e1': {
      'ru': 'Номер автомобиля',
      'en': 'Vehicle number',
      'tr': 'Araç plakası',
    },
    'yrdha54a': {
      'ru': 'Торговая марка',
      'en': 'Trademark',
      'tr': 'TM',
    },
    'vbriflqq': {
      'ru': 'Наименование товара',
      'en': 'Name of product',
      'tr': 'Ürün adı',
    },
    'zffp1fzt': {
      'ru': 'Пересечение границы РФ',
      'en': 'Crossing the border of the Russian Federation',
      'tr': 'Sınırı geçti',
    },
    '42u7lcke': {
      'ru': 'Заезд на терминал',
      'en': 'Arrival at the terminal',
      'tr': 'İç gümrüğe varış',
    },
    '9au5z5gy': {
      'ru': 'Фитосанитарный контроль',
      'en': 'Phytosanitary control',
      'tr': 'Karantina kontrol ',
    },
    'nx3a0m94': {
      'ru': 'Подача декларации',
      'en': 'Filing a declaration',
      'tr': 'Beyanname açılışı',
    },
    'n6etivwc': {
      'ru': 'Выпуск декларации',
      'en': 'Release of the declaration',
      'tr': 'Beyanname kapanışı',
    },
    '0ov55jep': {
      'ru': 'Home',
      'en': 'Home',
      'tr': 'Ev',
    },
  },
  // changeLanguagePage
  {
    'jjq8wkil': {
      'ru': 'Настройки',
      'en': 'Settings',
      'tr': 'Ayarlar',
    },
    'v3zufl1v': {
      'ru': 'Язык приложения',
      'en': 'Application Language',
      'tr': 'Uygulama dili',
    },
    'yowemo7g': {
      'ru': 'Русский',
      'en': 'Russian',
      'tr': 'Rusça',
    },
    '4e7qrwvc': {
      'ru': 'Türkçe',
      'en': 'Turkish',
      'tr': 'Türkçe',
    },
    '5x3k3ekl': {
      'ru': 'English',
      'en': 'English',
      'tr': 'İngilizce',
    },
    '13te1b9t': {
      'ru': 'Home',
      'en': 'Home',
      'tr': 'Ev',
    },
  },
  // OnBoarding
  {
    'okv3u3dm': {
      'ru': 'Home',
      'en': 'Home',
      'tr': 'Ev',
    },
  },
  // ExitAcc
  {
    '7lb6knq7': {
      'ru': 'Вы уверены, что хотите выйти из аккаунта?',
      'en': 'Are you sure you want to log out of your account?',
      'tr': 'Hesabınızdan çıkış yapmak istediğinizden emin misiniz?',
    },
    'w15b8aps': {
      'ru': 'Выйти',
      'en': 'Log out',
      'tr': 'Dışarı çıkmak',
    },
    'ad42v6i2': {
      'ru': 'Отменить',
      'en': 'Cancel',
      'tr': 'İptal etmek',
    },
  },
  // ResendMailPageCopy
  {
    'w5170qlq': {
      'ru': 'Вы уверены, что хотите выйти из аккаунта?',
      'en': 'Are you sure you want to log out of your account?',
      'tr': 'Çıkış yapmak istediğinizden emin misiniz?',
    },
    '9xzdptvr': {
      'ru': 'Выйти',
      'en': 'Go out',
      'tr': 'Çıkış yap',
    },
    'uhmchb0j': {
      'ru': 'Отменить',
      'en': 'Cancel',
      'tr': 'İptal',
    },
  },
  // NoInternet
  {
    '26wpgs5o': {
      'ru': 'Нет подключения к сети',
      'en': 'No network connection',
      'tr': 'Ağ bağlantısı yok',
    },
    'y6b3fww6': {
      'ru': 'Пожалуйста, проверьте соединение и попробуйте еще раз',
      'en': 'Please check your connection and try again',
      'tr': 'Lütfen bağlantınızı kontrol edin ve tekrar deneyin',
    },
    'ot6mpis6': {
      'ru': 'Обновить',
      'en': 'Refresh',
      'tr': 'Yenile',
    },
  },
  // noArchieveOrders
  {
    'fyjfimiv': {
      'ru': 'Архивные заказы отсутствуют',
      'en': 'No archived orders',
      'tr': 'Teslimat bilgisi yükleniyor',
    },
  },
  // noActiveOrders
  {
    '1s8x8ezv': {
      'ru': 'Активные заказы отсутствуют',
      'en': 'No active orders',
      'tr': 'Aktif teslimat yok',
    },
  },
  // ResendMailPageCopyCopy
  {
    'uk4pxpre': {
      'ru': 'Вы уверены, что хотите удалить аккаунт?',
      'en': 'Are you sure you want to delete your account?',
      'tr': 'Hesabınızı silmek istediğinizden emin misiniz?',
    },
    'svazz2ch': {
      'ru': 'Да',
      'en': 'Yes',
      'tr': 'Evet',
    },
    '89fcbkml': {
      'ru': 'Отменить',
      'en': 'Cancel',
      'tr': 'İptal etmek',
    },
  },
  // expandable
  {
    'vygi30vo': {
      'ru': 'Количество ящиков',
      'en': 'Number of boxes',
      'tr': 'Kasa sayısı',
    },
    'e40dqig7': {
      'ru': 'Количество паллет',
      'en': 'Number of pallets',
      'tr': 'Palet sayısı',
    },
  },
  // ordersStatusSeaArchiveLandExpandable
  {
    'g131zpu1': {
      'ru': 'Количество ящиков',
      'en': 'Number of boxes',
      'tr': 'Kasa sayısı',
    },
    'zrvo6wzf': {
      'ru': 'Количество паллет',
      'en': 'Number of pallets',
      'tr': 'Palet sayısı',
    },
  },
  // statusPageLandExpandable
  {
    'w0rwmotv': {
      'ru': 'Количество ящиков',
      'en': 'Number of boxes',
      'tr': 'Kasa sayısı',
    },
    'swfc0x7t': {
      'ru': 'Количество паллет',
      'en': 'Number of pallets',
      'tr': 'Palet sayısı',
    },
  },
  // seaArchiveExpandable
  {
    'hmfm3qsf': {
      'ru': 'Количество ящиков',
      'en': 'Number of boxes',
      'tr': 'Kasa sayısı',
    },
    'vmf033jv': {
      'ru': 'Hello World',
      'en': 'Hello World',
      'tr': '',
    },
    '8agn1xqu': {
      'ru': 'Количество паллет',
      'en': 'Number of pallets',
      'tr': 'Palet sayısı',
    },
    'fk4je8fj': {
      'ru': 'Hello World',
      'en': 'Hello World',
      'tr': '',
    },
  },
  // Miscellaneous
  {
    'e50175wt': {
      'ru': 'Это необходимо для получения уведомлений о заказах',
      'en': 'It needs to get notifications about users order status',
      'tr': 'Kullanıcıların sipariş durumu hakkında bildirim alması gerekiyor',
    },
    '9t0amkjj': {
      'ru': 'Ошибка',
      'en': 'Error',
      'tr': 'Hata',
    },
    '3jqxc2vr': {
      'ru': 'Отправлено письмо на почту для восстановления пароля',
      'en': 'An email has been sent to reset your password',
      'tr': 'Parolanızı sıfırlamak için bir e-posta gönderildi',
    },
    'itm71a3b': {
      'ru': 'Требуется почта',
      'en': 'Mail Required',
      'tr': 'Posta Gerekli',
    },
    '04y2ydfp': {
      'ru': 'Номер телефона обязателен и должен начинаться с +.',
      'en': 'The phone number is required and must begin with a +.',
      'tr': 'Telefon numarası gereklidir ve + ile başlamalıdır.',
    },
    'kmr8t1bl': {
      'ru': 'Пароли не совпадают',
      'en': 'Password mismatch',
      'tr': 'Şifre eşleşmiyor',
    },
    'vjhg2lf3': {
      'ru': 'Введите код подтверждения из СМС',
      'en': 'Enter confirmation code from SMS',
      'tr': 'SMS\'den gelen onay kodunu girin',
    },
    '7fbioym4': {
      'ru':
          'Слишком много времени прошло с момента последнего входа в систему. Войдите еще раз, прежде чем удалять свою учетную запись.',
      'en':
          'Too much time has passed since the last login. Sign in again before deleting your account.',
      'tr':
          'Son girişten bu yana çok fazla zaman geçti. Hesabınızı silmeden önce tekrar oturum açın.',
    },
    '85e0rpi9': {
      'ru':
          'Слишком много времени прошло с момента последнего входа в систему. Войдите еще раз, прежде чем обновлять адрес электронной почты.',
      'en':
          'Too much time has passed since the last login. Sign in again before updating your email address.',
      'tr':
          'Son girişten bu yana çok fazla zaman geçti. E-posta adresinizi güncellemeden önce tekrar oturum açın.',
    },
    'nv6dbqub': {
      'ru': 'Письмо с подтверждением изменения электронной почты отправлено!',
      'en': 'Email Change Confirmation Email Sent!',
      'tr': 'E-posta Değişiklik Onay E-postası Gönderildi!',
    },
    'esikfi5w': {
      'ru': '',
      'en': '',
      'tr': '',
    },
    'qu6x1fch': {
      'ru': '',
      'en': '',
      'tr': '',
    },
    'k33bvf83': {
      'ru': '',
      'en': '',
      'tr': '',
    },
    'mvihcg5y': {
      'ru': '',
      'en': '',
      'tr': '',
    },
    '5auzyko6': {
      'ru': '',
      'en': '',
      'tr': '',
    },
    '4wujy2jo': {
      'ru': '',
      'en': '',
      'tr': '',
    },
    'f0wt0ad7': {
      'ru': '',
      'en': '',
      'tr': '',
    },
    'siamj2jx': {
      'ru': '',
      'en': '',
      'tr': '',
    },
    '2wxlhmit': {
      'ru': '',
      'en': '',
      'tr': '',
    },
    'yb1b9ue8': {
      'ru': '',
      'en': '',
      'tr': '',
    },
    'h0ulojtw': {
      'ru': '',
      'en': '',
      'tr': '',
    },
    'zfn0i1gz': {
      'ru': '',
      'en': '',
      'tr': '',
    },
    'fbt009tp': {
      'ru': '',
      'en': '',
      'tr': '',
    },
    'lljukluk': {
      'ru': '',
      'en': '',
      'tr': '',
    },
  },
].reduce((a, b) => a..addAll(b));
